--建邺城出
local r={
{当前地图=1501,x=13,y=12,目标地图=1505,x1=27,y1=33},--建邺城进建邺杂货铺
{当前地图=1501,x=147,y=59,目标地图=1537,x1=14,y1=29},--建邺城进建邺衙门
{当前地图=1501,x=128,y=102,目标地图=1523,x1=14,y1=24},--建邺城进建邺合生记
{当前地图=1501,x=75.7,y=131.3,目标地图=1502,x1=11,y1=19},--建邺城进建邺兵铁铺
{当前地图=1501,x=172,y=108,目标地图=1503,x1=14,y1=21},--建邺城进建邺布庄
{当前地图=1501,x=219.7,y=136.2,目标地图=1504,x1=22,y1=25},--建邺城进建邺回春堂
{当前地图=1501,x=237,y=63,目标地图=1524,x1=24,y1=27},--建邺城进建邺钱庄
{当前地图=1501,x=272,y=113,目标地图=1506,x1=10,y1=111},--建邺城进东海湾新
{当前地图=1501,x=242,y=12,目标地图=1506,x1=11,y1=37},--建邺城进东海湾旧
{当前地图=1501,x=258,y=55,目标地图=1525,x1=15,y1=18},--建邺城进建邺普通民居
{当前地图=1501,x=4,y=59,目标地图=1527,x1=29,y1=27},--建邺城进建邺李府
{当前地图=1527,x=5,y=20,目标地图=1534,x1=38,y1=19},--建邺李府进建邺李善人家
{当前地图=1501,x=244,y=121,目标地图=1526,x1=26,y1=27},--建邺城进建邺周猎户家
--建邺城进
{当前地图=1505,x=29,y=33,目标地图=1501,x1=118,y1=18},--建邺杂货铺出建邺城
{当前地图=1537,x=9,y=29,目标地图=1501,x1=144,y1=64},--建邺衙门出建邺城
{当前地图=1523,x=10,y=25,目标地图=1501,x1=125,y1=106},--建邺合生记出建邺城
{当前地图=1502,x=9,y=20,目标地图=1501,x1=74,y1=134},--建邺兵铁铺出建邺城
{当前地图=1503,x=11,y=22,目标地图=1501,x1=170,y1=111},--建邺布庄出建邺城
{当前地图=1504,x=28.4,y=24.3,目标地图=1501,x1=223,y1=141},--建邺回春堂出建邺城
{当前地图=1524,x=17,y=25,目标地图=1501,x1=235,y1=68},--建邺钱庄出建邺城
{当前地图=1526,x=31,y=29,目标地图=1501,x1=247,y1=126},--建邺周猎户家出建邺城
{当前地图=1525,x=11,y=19,目标地图=1501,x1=255,y1=58},--建邺普通民居出建邺城
{当前地图=1527,x=32.3,y=27.8,目标地图=1501,x1=8,y1=64},--建邺李府出建邺城
{当前地图=1534,x=41,y=19,目标地图=1527,x1=10,y1=26},--建邺李善人家出建邺李府
--桃源镇出
{当前地图=1003,x=17,y=95,目标地图=1506,x1=144,y1=64},--桃源镇到东海湾
--东海湾进
{当前地图=1506,x=4,y=36,目标地图=1501,x1=237,y1=17},--东海湾进建邺城旧
{当前地图=1506,x=5,y=112,目标地图=1501,x1=268,y1=114},--东海湾进建邺城新
{当前地图=1506,x=89,y=109,目标地图=1507,x1=11,y1=19},--东海湾进东海海底
--{当前地图=1506,x=31,y=8,目标地图=1003,x1=26,y1=92},--东海湾到桃源镇
--东海岩洞出
{当前地图=1126,x=10,y=72,目标地图=1506,x1=86,y1=89},--东海岩洞出东海湾
--龙宫进
{当前地图=1116,x=114,y=52,目标地图=1117,x1=24,y1=32},--龙宫进水晶宫
{当前地图=1116,x=206,y=6,目标地图=1118,x1=10,y1=39},--龙宫进海底迷宫一层
{当前地图=1116,x=132,y=52,目标地图=1117,x1=47,y1=32},--龙宫进水晶宫1
--水晶宫出
{当前地图=1117,x=16.4,y=34.6,目标地图=1116,x1=109,y1=57},--水晶宫出龙宫
{当前地图=1117,x=50.4,y=33,目标地图=1116,x1=137,y1=56},--水晶宫出龙宫1
--海底1进
{当前地图=1118,x=5,y=42,目标地图=1116,x1=199,y1=9},--海底迷宫一层进龙宫
{当前地图=1118,x=58,y=8,目标地图=1119,x1=11,y1=40},--海底迷宫一层进海底迷宫二层
{当前地图=1118,x=14,y=7,目标地图=1120,x1=53,y1=36},--海底迷宫一层进海底迷宫三层
--海底2进
{当前地图=1119,x=6,y=43,目标地图=1118,x1=53,y1=12},--海底迷宫二层进海底迷宫一层
{当前地图=1119,x=53,y=6,目标地图=1532,x1=22,y1=40},--海底迷宫二层进海底迷宫五层
--海底3进
{当前地图=1120,x=56,y=40,目标地图=1118,x1=12,y1=14},--海底迷宫三层进海底迷宫一层
{当前地图=1120,x=57,y=5,目标地图=1121,x1=11,y1=36},--海底迷宫三层进海底迷宫四层
--海底4进
{当前地图=1121,x=4,y=43,目标地图=1120,x1=52,y1=10},--海底迷宫四层进海底迷宫三层
{当前地图=1121,x=55,y=42,目标地图=1532,x1=10,y1=10},--海底迷宫四层进海底迷宫五层
--海底5进
{当前地图=1532,x=20,y=42,目标地图=1119,x1=47,y1=11},--海底迷宫五层进海底迷宫二层
{当前地图=1532,x=4,y=5,目标地图=1121,x1=50,y1=37},--海底迷宫五层进海底迷宫四层
--东海海底进
{当前地图=1507,x=11,y=12.2,目标地图=1506,x1=85,y1=107},--东海海底进东海湾
{当前地图=1507,x=89,y=13.8,目标地图=1508,x1=50,y1=37},
--乘船进出
{当前地图=1508,x=22,y=6,目标地图=1507,x1=85,y1=10},--沉船出东海海底
{当前地图=1508,x=75,y=69,目标地图=1509,x1=14,y1=18},--沉船进沉船内室
{当前地图=1509,x=11,y=14,目标地图=1508,x1=70,y1=65},--沉船内室出沉船
--野外进
{当前地图=1193,x=156,y=64,目标地图=1501,x1=9,y1=141},--江南野外传送建邺城
{当前地图=1193,x=20,y=10,目标地图=1001,x1=532,y1=276},--江南野外传送长安
{当前地图=1193,x=106,y=10,目标地图=1876,x1=136,y1=71},--江南野外传送南岭山
--长安进
{当前地图=1001,x=540,y=277,目标地图=1193,x1=25,y1=17},--长安传送江南野外
{当前地图=1001,x=461,y=112,目标地图=1028,x1=17,y1=38},--长安传送长安酒店一楼
{当前地图=1001,x=502,y=8,目标地图=1002,x1=10,y1=88},--长安传送化生寺
{当前地图=1001,x=475.6,y=238,目标地图=1020,x1=15,y1=21},--长安传送万胜兵器铺
{当前地图=1001,x=394,y=265,目标地图=1017,x1=35,y1=27},--长安传送锦绣饰品店
{当前地图=1001,x=368,y=240,目标地图=1022,x1=31,y1=23},--长安传送张记布庄
{当前地图=1001,x=436,y=219,目标地图=1030,x1=12,y1=22},--长安传送云来酒店
{当前地图=1001,x=447,y=33,目标地图=1004,x1=34,y1=58},--长安传送大雁塔一层路口1
{当前地图=1001,x=475,y=33,目标地图=1004,x1=103,y1=58},--长安传送大雁塔一层路口2
{当前地图=1001,x=308,y=4,目标地图=1198,x1=153,y1=94},--长安传送大唐官府
{当前地图=1001,x=5,y=276,目标地图=1110,x1=332,y1=191},--长安传送大唐国境
{当前地图=1001,x=487,y=120.7,目标地图=1016,x1=14,y1=25},--长安传送回春堂
{当前地图=1001,x=218,y=244.5,目标地图=1033,x1=47,y1=42},--长安传送留香阁
{当前地图=1001,x=529,y=125.5,目标地图=1024,x1=22,y1=28},--长安传送长风镖局
{当前地图=1001,x=281.2,y=77.6,目标地图=1026,x1=49,y1=36},--长安传送国子监
{当前地图=1001,x=100.5,y=46.8,目标地图=1044,x1=97,y1=76},--长安传送金銮殿
{当前地图=1001,x=518,y=206,目标地图=1019,x1=21,y1=26},--长安传送书香斋
{当前地图=1001,x=485,y=182,目标地图=1025,x1=23,y1=23},--长安传送冯记铁铺
{当前地图=1001,x=513,y=82,目标地图=1013,x1=21,y1=29},--长安传送广源钱庄
--长安出
{当前地图=1013,x=17,y=31,目标地图=1001,x1=510,y1=87},--广源钱庄传送长安
{当前地图=1019,x=15,y=29,目标地图=1001,x1=510,y1=210},--书香斋传送长安
{当前地图=1025,x=16,y=24,目标地图=1001,x1=482,y1=188},--冯记铁铺传送长安
{当前地图=1044,x=102.5,y=78,目标地图=1001,x1=104,y1=51},--金銮殿传送长安
{当前地图=1028,x=14,y=39,目标地图=1001,x1=458,y1=116},--长安酒店一楼传送长安
{当前地图=1028,x=31.2,y=14.9,目标地图=1029,x1=41,y1=18},--长安酒店一楼传送长安酒店二楼
{当前地图=1029,x=36,y=15,目标地图=1028,x1=29,y1=20},--长安酒店二楼传送长安酒店一楼
{当前地图=1198,x=162,y=97.5,目标地图=1001,x1=314,y1=10},--大唐官府传送长安
{当前地图=1198,x=77.3,y=56,目标地图=1054,x1=35,y1=27.5},--大唐官府传送程咬金府
{当前地图=1054,x=38.5,y=29,目标地图=1198,x1=82,y1=60},--程咬金府传送大唐官府
{当前地图=1002,x=4,y=92,目标地图=1001,x1=492,y1=14},--化生寺传送长安
{当前地图=1002,x=58,y=56,目标地图=1528,x1=18,y1=26},--化生寺传送光华殿
{当前地图=1002,x=91,y=40,目标地图=1043,x1=7,y1=14},--化生寺传送藏经阁

{当前地图=1043,x=9.9,y=16.4,目标地图=1002,x1=88,y1=45},--藏经阁传送化生寺
{当前地图=1528,x=12,y=26,目标地图=1002,x1=61,y1=61},--光华殿传送化生寺
{当前地图=1004,x=30.2,y=59.8,目标地图=1001,x1=442,y1=37},--大雁塔一层路口1传送长安
{当前地图=1004,x=108,y=60,目标地图=1001,x1=480,y1=37},--大雁塔一层路口2传送长安
{当前地图=1004,x=69,y=4,目标地图=1005,x1=65,y1=22},--大雁塔一层传送大雁塔二层
{当前地图=1005,x=65,y=16,目标地图=1004,x1=73,y1=10},--大雁塔二层传送大雁塔一层
{当前地图=1005,x=78,y=62,目标地图=1006,x1=65,y1=67},--大雁塔二层传送大雁塔三层
{当前地图=1006,x=67,y=66,目标地图=1005,x1=70,y1=73},--大雁塔三层传送大雁塔二层
{当前地图=1006,x=67,y=9,目标地图=1007,x1=64,y1=21},--大雁塔三层传送大雁塔四层
{当前地图=1007,x=60,y=24,目标地图=1006,x1=69,y1=13},--大雁塔四层传送大雁塔三层
{当前地图=1007,x=100,y=23,目标地图=1008,x1=88,y1=33},--大雁塔四层传送大雁塔五层
{当前地图=1008,x=93,y=29,目标地图=1007,x1=103,y1=29},--大雁塔五层传送大雁塔四层
{当前地图=1008,x=16,y=38,目标地图=1090,x1=34,y1=38},--大雁塔五层传送大雁塔六层
{当前地图=1090,x=15,y=40,目标地图=1008,x1=21,y1=45},--大雁塔六层传送大雁塔五层
{当前地图=1090,x=62,y=36,目标地图=1009,x1=472,y1=242},--大雁塔六层传送大雁塔七层
{当前地图=1009,x=38,y=34,目标地图=1090,x1=67,y1=43},--大雁塔七层传送大雁塔六层
{当前地图=1020,x=11.8,y=22.1,目标地图=1001,x1=472,y1=242},--万胜兵器铺传送长安
{当前地图=1017,x=38,y=28,目标地图=1001,x1=396,y1=269},--锦绣饰品店传送长安
{当前地图=1022,x=33,y=24,目标地图=1001,x1=373,y1=246},--张记布庄传送长安
{当前地图=1030,x=9,y=23,目标地图=1001,x1=431,y1=225},--云来酒店传送长安
{当前地图=1016,x=10,y=27,目标地图=1001,x1=484,y1=127},--回春堂传送长安
{当前地图=1033,x=51,y=43.3,目标地图=1001,x1=222,y1=250},--留香阁传送长安
{当前地图=1024,x=8,y=25,目标地图=1001,x1=522,y1=129},--长风镖局传送长安
{当前地图=1024,x=29,y=36,目标地图=1001,x1=522,y1=129},--长风镖局传送长安
{当前地图=1026,x=58.5,y=39.8,目标地图=1001,x1=282,y1=82},--国子监传送长安
--傲来进
{当前地图=1092,x=6,y=11,目标地图=1142,x1=118,y1=131},--傲来国传送女儿村
{当前地图=1092,x=130,y=109,目标地图=1101,x1=13,y1=21},--傲来国传送傲来武器店
{当前地图=1092,x=216,y=9,目标地图=1514,x1=12,y1=108},--傲来国传送花果山
{当前地图=1092,x=180,y=120,目标地图=1093,x1=39,y1=32},--傲来国传送傲来国客栈
{当前地图=1092,x=98,y=131,目标地图=1105,x1=29,y1=25},--傲来国传送傲来国杂货店
{当前地图=1092,x=56,y=110.2,目标地图=1104,x1=38,y1=33},--傲来国传送傲来国药店
{当前地图=1092,x=30.7,y=78.6,目标地图=1095,x1=35,y1=28},--傲来国传送傲来国服饰店
{当前地图=1092,x=138,y=44,目标地图=1100,x1=21,y1=29},--傲来国传送傲来圣殿
{当前地图=1092,x=103,y=91,目标地图=1099,x1=44,y1=33},--傲来国传送傲来钱庄
--傲来出
{当前地图=1099,x=103,y=91,目标地图=1092,x1=106,y1=92},--傲来钱庄传送傲来国
{当前地图=1100,x=103,y=91,目标地图=1092,x1=134,y1=48},--傲来圣殿传送傲来国
{当前地图=1093,x=103,y=91,目标地图=1092,x1=184,y1=123},--傲来国客栈传送傲来国
{当前地图=1104,x=103,y=91,目标地图=1092,x1=57,y1=113},--傲来国药店传送傲来国
{当前地图=1105,x=103,y=91,目标地图=1092,x1=99,y1=135},--傲来国杂货店传送傲来国
{当前地图=1095,x=103,y=91,目标地图=1092,x1=33.2,y1=82.5},--傲来国服饰店传送傲来国
{当前地图=1101,x=8,y=21,目标地图=1092,x1=124,y1=113},--傲来武器店传送傲来国
{当前地图=1142,x=124,y=134,目标地图=1092,x1=13,y1=18},--女儿村传送傲来国
{当前地图=1142,x=14.8,y=18.7,目标地图=1143,x1=31,y1=25},--女儿村传送女儿村村长家
{当前地图=1143,x=34.5,y=26,目标地图=1142,x1=18,y1=22},--女儿村村长家传送女儿村
--花果山进
{当前地图=1514,x=5,y=110,目标地图=1092,x1=209,y1=14},--花果山传送傲来国
{当前地图=1514,x=20,y=15,目标地图=1174,x1=209,y1=39},--花果山传送北俱芦洲
{当前地图=1514,x=65.5,y=48.4,目标地图=1103,x1=11,y1=48},--花果山传送水帘洞
{当前地图=1514,x=103,y=112,目标地图=1118,x1=9,y1=41},--花果山传送海底迷宫1层
--花果山出
{当前地图=1103,x=3,y=47,目标地图=1514,x1=65,y1=55},--水帘洞传送花果山
--北俱芦洲进
{当前地图=1174,x=197,y=64,目标地图=1514,x1=26,y1=19},--北俱芦洲传送花果山
{当前地图=1174,x=10,y=89,目标地图=1177,x1=149,y1=80},--北俱芦洲传送龙窟
{当前地图=1174,x=86,y=19,目标地图=1186,x1=70,y1=10},--北俱芦洲传送凤巢
--龙窟进
{当前地图=1177,x=152,y=87,目标地图=1174,x1=16,y1=95},--龙窟一层传送北俱芦洲
{当前地图=1177,x=17,y=24,目标地图=1178,x1=126,y1=49},--龙窟一层传送龙窟二层
{当前地图=1178,x=130,y=49,目标地图=1177,x1=21,y1=30},--龙窟二层传送龙窟一层
{当前地图=1178,x=21,y=65,目标地图=1179,x1=11,y1=12},--龙窟二层传送龙窟三层
{当前地图=1179,x=10,y=5,目标地图=1178,x1=29,y1=63},--龙窟三层传送龙窟二层
{当前地图=1179,x=133,y=59,目标地图=1180,x1=14,y1=64},--龙窟三层传送龙窟四层
{当前地图=1180,x=4,y=63,目标地图=1179,x1=127,y1=54},--龙窟四层传送龙窟三层
{当前地图=1180,x=124,y=44,目标地图=1181,x1=121,y1=12},--龙窟四层传送龙窟五层
{当前地图=1181,x=131,y=8,目标地图=1180,x1=128,y1=48},--龙窟五层传送龙窟四层
{当前地图=1181,x=51,y=61,目标地图=1182,x1=88,y1=66},--龙窟五层传送龙窟六层
{当前地图=1182,x=120,y=18,目标地图=1183,x1=12,y1=15},--龙窟六层传送龙窟七层
{当前地图=1182,x=81,y=65,目标地图=1181,x1=44,y1=60},--龙窟六层传送龙窟五层
{当前地图=1183,x=6,y=9,目标地图=1182,x1=113,y1=18},--龙窟七层传送龙窟六层
--凤巢进
{当前地图=1186,x=6,y=9,目标地图=1174,x1=84,y1=26},--凤巢一层传送北俱芦洲
{当前地图=1186,x=6,y=9,目标地图=1187,x1=36,y1=12},--凤巢一层传送凤巢二层
{当前地图=1187,x=6,y=9,目标地图=1186,x1=49,y1=59},--凤巢二层传送凤巢一层
{当前地图=1187,x=6,y=9,目标地图=1188,x1=18,y1=17},--凤巢二层传送凤巢三层
{当前地图=1188,x=6,y=9,目标地图=1187,x1=115,y1=21},--凤巢三层传送凤巢二层
{当前地图=1188,x=6,y=9,目标地图=1189,x1=23,y1=20},--凤巢三层传送凤巢四层
{当前地图=1189,x=6,y=9,目标地图=1188,x1=114,y1=61},--凤巢四层传送凤巢三层
{当前地图=1189,x=6,y=9,目标地图=1190,x1=76,y1=65},--凤巢四层传送凤巢五层
{当前地图=1190,x=6,y=9,目标地图=1189,x1=70,y1=10},--凤巢五层传送凤巢四层
{当前地图=1190,x=6,y=9,目标地图=1191,x1=6,y1=64},--凤巢五层传送凤巢六层
{当前地图=1191,x=6,y=9,目标地图=1190,x1=111,y1=8},--凤巢六层传送凤巢五层
{当前地图=1191,x=6,y=9,目标地图=1192,x1=12,y1=31},--凤巢六层传送凤巢七层
{当前地图=1192,x=6,y=9,目标地图=1191,x1=120,y1=31},--凤巢七层传送凤巢六层
--国境进
{当前地图=1110,x=340,y=186,目标地图=1001,x1=10,y1=275},--大唐国境传送长安
{当前地图=1110,x=51,y=9,目标地图=1122,x1=137,y1=113},--大唐国境传送阴曹地府
{当前地图=1110,x=4,y=259,目标地图=1173,x1=626,y1=23},--大唐国境传送大唐境外
{当前地图=1110,x=123,y=149,目标地图=1153,x1=31,y1=25},--大唐国境传送金山寺
--金山寺进
{当前地图=1153,x=41,y=28,目标地图=1110,x1=133,y1=160},--金山寺传送大唐国境
--江州府
{当前地图=1168,x=15,y=26,目标地图=1110,x1=313,y1=38},--江州府传送大唐国境
--凌波城
{当前地图=1150,x=3,y=93,目标地图=1110,x1=181,y1=77},--凌波城传送大唐国境
--普陀山
{当前地图=1140,x=88,y=67,目标地图=1110,x1=234,y1=277},--普陀山传送大唐国境
{当前地图=1140,x=3,y=5,目标地图=1141,x1=46,y1=36},--普陀山传送潮音洞
--潮音洞
{当前地图=1141,x=58,y=43,目标地图=1140,x1=11,y1=13},--潮音洞传送普陀山
{当前地图=1141,x=38.6,y=9.2,目标地图=1605,x1=12,y1=87},--潮音洞传送天鸣洞天
--天鸣洞天
{当前地图=1605,x=4,y=92,目标地图=1141,x1=37,y1=16},--天鸣洞天传送潮音洞
--阴曹地府
{当前地图=1122,x=146,y=116,目标地图=1110,x1=43,y1=13},--阴曹地府传送大唐国境
{当前地图=1122,x=34,y=9,目标地图=1127,x1=6,y1=21},--阴曹地府传送地狱迷宫一层
{当前地图=1122,x=30.2,y=51.7,目标地图=1123,x1=40,y1=32},--阴曹地府传送森罗殿
{当前地图=1122,x=105,y=66,目标地图=1125,x1=24,y1=27},--阴曹地府传送轮回司
--森罗殿
{当前地图=1123,x=25.9,y=11.5,目标地图=1124,x1=35,y1=27},--森罗殿传送地藏王府
{当前地图=1123,x=47,y=33,目标地图=1122,x1=34,y1=57},--森罗殿传送阴曹地府
{当前地图=1123,x=41,y=29,目标地图=1123,x1=29,y1=14},--地藏王府传送森罗殿
{当前地图=1123,x=29,y=31,目标地图=1122,x1=104,y1=72},--轮回司传送阴曹地府
--地狱迷宫
{当前地图=1127,x=7,y=13,目标地图=1122,x1=29,y1=14},--地狱迷宫一层传送阴曹地府
{当前地图=1127,x=18,y=75,目标地图=1128,x1=99,y1=16},--地狱迷宫一层传送地狱迷宫二层
{当前地图=1128,x=100,y=11,目标地图=1127,x1=17,y1=72},--地狱迷宫二层传送地狱迷宫一层
{当前地图=1128,x=112,y=82,目标地图=1129,x1=12,y1=69},--地狱迷宫二层传送地狱迷宫三层
{当前地图=1128,x=114,y=53,目标地图=1129,x1=14,y1=24},--地狱迷宫二层传送地狱迷宫三层2
{当前地图=1129,x=6,y=70,目标地图=1128,x1=102,y1=79},--地狱迷宫三层传送地狱迷宫二层2
{当前地图=1129,x=114,y=83,目标地图=1130,x1=15,y1=11},--地狱迷宫三层传送地狱迷宫四层
{当前地图=1129,x=5,y=24,目标地图=1128,x1=105,y1=53},--地狱迷宫三层传送地狱迷宫二层1
{当前地图=1130,x=6,y=7,目标地图=1129,x1=106,y1=83},--地狱迷宫四层传送地狱迷宫三层
{当前地图=1130,x=85,y=33,目标地图=1202,x1=16,y1=113},--地狱迷宫四层传送无名鬼城
{当前地图=1202,x=16,y=107,目标地图=1130,x1=91,y1=31},--无名鬼城传送地狱迷宫四层
--长寿村进
{当前地图=1070,x=153,y=205,目标地图=1091,x1=151,y1=18},--长寿村传送长寿郊外
{当前地图=1070,x=109,y=5,目标地图=1135,x1=10,y1=134},--长寿村传送方寸山
{当前地图=1070,x=74,y=103,目标地图=1085,x1=24,y1=21},--长寿村传送长寿村武器店
{当前地图=1070,x=83.8,y=136.8,目标地图=1083,x1=12,y1=19},--长寿村传送长寿村服装店
{当前地图=1070,x=128,y=27,目标地图=1082,x1=12,y1=16},--长寿村传送长寿神庙
{当前地图=1070,x=144,y=114,目标地图=1081,x1=22,y1=18},--长寿村传送长寿钱庄
{当前地图=1070,x=147,y=64,目标地图=1084,x1=22,y1=18},--长寿村传送长生村民

--长寿村出
{当前地图=1082,x=9,y=19,目标地图=1070,x1=132,y1=31},--长寿神庙传送长寿村
{当前地图=1083,x=9.9,y=20.7,目标地图=1070,x1=87,y1=139},--长寿村服装店传送长寿村
{当前地图=1084,x=18,y=20,目标地图=1070,x1=150,y1=65},--长寿村传送长生村民
{当前地图=1085,x=27,y=22.4,目标地图=1070,x1=69.5,y1=106},--长寿村武器店传送长寿村

{当前地图=1091,x=155,y=9,目标地图=1070,x1=139,y1=199},--长寿郊外传送长寿村
{当前地图=1091,x=18,y=57,目标地图=1233,x1=137,y1=85},--长寿郊外传送柳林坡
{当前地图=1091,x=19,y=140,目标地图=1235,x1=591,y1=15},--长寿郊外传送丝绸之路
--方寸山
{当前地图=1135,x=5,y=132,目标地图=1070,x1=106,y1=12},--方寸山传送长寿村
{当前地图=1135,x=130,y=30,目标地图=1137,x1=21,y1=41},--方寸山传送灵台宫
{当前地图=1135,x=164.5,y=149,目标地图=1223,x1=50,y1=10},--方寸山传送观星台
{当前地图=1137,x=17.3,y=42.7,目标地图=1135,x1=124,y1=35},--灵台宫传送方寸山
{当前地图=1223,x=51,y=4,目标地图=1135,x1=154,y1=147},--观星台传送方寸山
-- 天宫
{当前地图=1111,x=146,y=104,目标地图=1112,x1=75,y1=57},--天宫传送凌霄宝殿
{当前地图=1111,x=5,y=99,目标地图=1231,x1=143,y1=89},--天宫传送蟠桃园
{当前地图=1111,x=44,y=5,目标地图=1114,x1=116,y1=85},--天宫传送月宫
{当前地图=1111,x=27,y=142,目标地图=1113,x1=40,y1=26},--天宫传送兜率宫
{当前地图=1112,x=79.3,y=58.4,目标地图=1111,x1=148,y1=108},--凌霄宝殿传送天宫
{当前地图=1114,x=124,y=87,目标地图=1111,x1=50,y1=9},--月宫传送天宫
{当前地图=1231,x=148,y=90,目标地图=1111,x1=12,y1=97},--蟠桃园传送天宫
{当前地图=1113,x=43,y=30,目标地图=1111,x1=26,y1=147},--兜率宫传送天宫
-- 境外
{当前地图=1173,x=57,y=5,目标地图=1512,x1=12,y1=79},--大唐境外传送魔王寨
{当前地图=1173,x=635,y=41,目标地图=1146,x1=10,y1=64},--大唐境外传送五庄观
{当前地图=1173,x=4,y=72,目标地图=1131,x1=112,y1=14},--大唐境外传送狮驼岭
{当前地图=1173,x=636,y=17,目标地图=1110,x1=14,y1=263},--大唐境外传送大唐国境
{当前地图=1173,x=528.5,y=4,目标地图=1513,x1=187,y1=140},--大唐境外传送盘丝岭
{当前地图=1173,x=6,y=54,目标地图=1208,x1=10,y1=114},--大唐境外传送朱紫国
{当前地图=1173,x=10,y=21,目标地图=1203,x1=102,y1=233},--大唐境外传送小西天
{当前地图=1173,x=236,y=13,目标地图=1218,x1=77,y1=165},--大唐境外传送墨家村
-- 魔王
{当前地图=1512,x=13,y=86,目标地图=1173,x1=60,y1=12},--魔王寨传送大唐境外
{当前地图=1512,x=94,y=15,目标地图=1145,x1=19,y1=27},--魔王寨传送魔王居
{当前地图=1145,x=15,y=29,目标地图=1512,x1=88,y1=21},--魔王居传送魔王寨
-- 五庄
{当前地图=1146,x=4,y=71,目标地图=1173,x1=628,y1=45},--五庄观传送大唐境外
{当前地图=1146,x=59,y=35.5,目标地图=1147,x1=20,y1=24},--五庄观传送乾坤殿
{当前地图=1147,x=16,y=25,目标地图=1146,x1=54,y1=40},--乾坤殿传送五庄观
-- 狮驼
{当前地图=1131,x=125,y=4,目标地图=1173,x1=13,y1=68},--狮驼岭传送大唐境外
{当前地图=1131,x=118,y=68,目标地图=1134,x1=20,y1=25},--狮驼岭传送狮王洞
{当前地图=1131,x=28,y=11,目标地图=1132,x1=20,y1=24},--狮驼岭传送大象洞
{当前地图=1131,x=15,y=56,目标地图=1133,x1=9,y1=24},--狮驼岭传送老雕洞
{当前地图=1132,x=20.80,y=26.2,目标地图=1131,x1=23,y1=18},--大象洞传送狮驼岭
{当前地图=1133,x=6,y=24,目标地图=1131,x1=17,y1=63},--老雕洞传送狮驼岭
{当前地图=1134,x=15,y=26,目标地图=1131,x1=112,y1=77},--狮王洞传送狮驼岭
-- 盘丝
{当前地图=1513,x=188.5,y=145.55,目标地图=1173,x1=533,y1=11},--盘丝岭传送大唐境外
{当前地图=1513,x=192,y=19,目标地图=1144,x1=15,y1=52},--盘丝岭传送盘丝洞
{当前地图=1144,x=11,y=55,目标地图=1513,x1=187,y1=24},--盘丝洞传送盘丝岭
-- 战神山
{当前地图=1205,x=125,y=101,目标地图=1001,x1=340,y1=215},--战神山传送长安
{当前地图=1205,x=9,y=100,目标地图=1138,x1=61,y1=153},--战神山传送神木林
-- 神木林
{当前地图=1138,x=77,y=163,目标地图=1205,x1=16,y1=99},--神木林传送战神山
{当前地图=1138,x=47.8,y=93,目标地图=1154,x1=45.5,y1=38},--神木林传送神木屋
{当前地图=1154,x=48,y=38.5,目标地图=1138,x1=49,y1=96},--神木屋传送神木林
-- 碗子山
{当前地图=1228,x=92,y=184,目标地图=1173,x1=21,y1=97},--碗子山传送大唐境外
{当前地图=1228,x=3,y=183.2,目标地图=1226,x1=148,y1=110},--碗子山传送宝象国
{当前地图=1228,x=69.7,y=12,目标地图=1229,x1=13,y1=16},--碗子山传送波月洞
-- 波月洞
{当前地图=1229,x=7.8,y=11,目标地图=1228,x1=64,y1=19},--波月洞传送碗子山
-- 无底洞
{当前地图=1139,x=87,y=39.5,目标地图=1228,x1=28,y1=180},--无底洞传送碗子山
{当前地图=1139,x=60,y=116,目标地图=1156,x1=9,y1=48},--无底洞传送琉璃殿
{当前地图=1156,x=5,y=49,目标地图=1139,x1=59,y1=122},--琉璃殿传送无底洞
-- 宝象国
{当前地图=1226,x=4,y=55,目标地图=1235,x1=393,y1=14},--宝象国传送丝绸之路
{当前地图=1226,x=4,y=10,目标地图=1227,x1=69,y1=49},--宝象国传送宝象国皇宫
{当前地图=1226,x=126,y=35,目标地图=1042,x1=104,y1=91},--宝象国传送解阳山
{当前地图=1226,x=4.75,y=113.3,目标地图=1210,x1=54,y1=139},--宝象国传送麒麟山
{当前地图=1226,x=153,y=112.3,目标地图=1228,x1=9,y1=184},--宝象国传送碗子山
{当前地图=1227,x=72.5,y=51,目标地图=1226,x1=8,y1=15},--宝象国皇宫传送宝象国
-- 解阳山
{当前地图=1042,x=7,y=85.9,目标地图=1041,x1=73,y1=12},--解阳山传送子母河底
{当前地图=1042,x=113,y=90,目标地图=1226,x1=122,y1=8},--解阳山传送宝象国
-- 子母河底
{当前地图=1041,x=72.5,y=4.5,目标地图=1042,x1=13,y1=90},--子母河底传送解阳山
{当前地图=1041,x=15.2,y=86.2,目标地图=1040,x1=153,y1=109},--子母河底传送西梁女国
-- 西梁女国
{当前地图=1040,x=156.4,y=111.1,目标地图=1041,x1=19,y1=85},--西梁女国传送子母河底
-- 麒麟山
{当前地图=1210,x=16,y=17,目标地图=1211,x1=52,y1=90},--麒麟山传送太岁府
{当前地图=1210,x=181,y=139,目标地图=1208,x1=7,y1=13},--麒麟山传送朱紫国
{当前地图=1211,x=57.5,y=91.3,目标地图=1210,x1=23,y1=24},--太岁府传送麒麟山
-- 丝绸之路
{当前地图=1235,x=214,y=6.5,目标地图=1242,x1=74,y1=195},--丝绸之路传送须弥东界
{当前地图=1235,x=348.4,y=92.5,目标地图=1232,x1=10,y1=26},--丝绸之路传送比丘国
{当前地图=1235,x=5,y=92,目标地图=1920,x1=109,y1=213},--丝绸之路传送凌云渡
{当前地图=1235,x=308,y=3,目标地图=1208,x1=152,y1=106},--丝绸之路传送朱紫国
{当前地图=1235,x=391,y=5,目标地图=1226,x1=9,y1=53},--丝绸之路传送宝象国
{当前地图=1235,x=596,y=9,目标地图=1091,x1=28,y1=138},--丝绸之路传长寿郊外
-- 比丘国
{当前地图=1232,x=3,y=26,目标地图=1235,x1=348,y1=88},--比丘国传送丝绸之路
{当前地图=1232,x=36.5,y=3.5,目标地图=1233,x1=17,y1=101},--比丘国传送柳林坡
-- 柳林坡
{当前地图=1233,x=8,y=102,目标地图=1232,x1=38,y1=10},--柳林坡传送比丘国
{当前地图=1233,x=147,y=93,目标地图=1091,x1=25,y1=64},--柳林坡传送长寿郊外
-- 朱紫国
{当前地图=1208,x=5,y=115.5,目标地图=1173,x1=11,y1=46},--朱紫国传送大唐境外
{当前地图=1208,x=3,y=8,目标地图=1210,x1=176,y1=139},--朱紫国传送麒麟山
{当前地图=1208,x=148,y=20,目标地图=1209,x1=30,y1=56},--朱紫国传送朱紫国皇宫
{当前地图=1208,x=159,y=107,目标地图=1235,x1=305,y1=7},--朱紫国传送丝绸之路
{当前地图=1208,x=23,y=61,目标地图=1208,x1=143,y1=25},--朱紫国皇宫传送朱紫国
-- 墨家村
{当前地图=1218,x=86,y=163,目标地图=1173,x1=229,y1=17},--墨家村传送大唐境外
{当前地图=1218,x=52,y=7,目标地图=1221,x1=21,y1=10},--墨家村传送墨家禁地
{当前地图=1221,x=25,y=4,目标地图=1218,x1=48,y1=11},--墨家禁地传送墨家村
-- 小西天
{当前地图=1203,x=104,y=235,目标地图=1173,x1=16,y1=25},--小西天传送大唐境外
{当前地图=1203,x=21,y=19,目标地图=1204,x1=169,y1=131},--小西天传送小雷音寺
{当前地图=1204,x=174.4,y=133.4,目标地图=1203,x1=26,y1=23},--小雷音寺传送小西天
-- 女娲神迹
{当前地图=1201,x=40,y=111.5,目标地图=1174,x1=20,y1=21},--女娲神迹传送北俱芦洲
{当前地图=1242,x=82,y=196,目标地图=1235,x1=214,y1=14},--须弥东界传送丝绸之路
-- 凌云渡
{当前地图=1920,x=114,y=218,目标地图=1235,x1=12,y1=91},--凌云渡传送丝绸之路
-- 朱紫国皇宫
{当前地图=1209,x=24,y=59,目标地图=1208,x1=143,y1=25},--朱紫国皇宫传送朱紫国
-- 仙缘洞天
{当前地图=1216,x=213,y=46,目标地图=1208,x1=77,y1=110},--仙缘洞天到朱紫国
{当前地图=1237,x=242,y=5,目标地图=1876,x1=12,y1=97},--四方城传送南岭山
{当前地图=1876,x=4,y=99,目标地图=1237,x1=235,y1=8},--南岭山传送四方城
{当前地图=1876,x=145,y=72,目标地图=1193,x1=102,y1=13},--南岭山传送江南野外
}
return r















