--########################################################?自己修改?##########################################
require("gge函数")
require("script/全局/自己_专用")--引用头
f函数=require("ffi函数2")

全局游戏宽度 = 800 --读配置("./config.ini","mhxy","宽度")+0--     --1000
全局游戏高度 = 600 -- 读配置("./config.ini","mhxy","高度")+0--     --620
wdf配置 = "wdf"--读配置("./config.ini","mhxy","wdf") or "WDF"
_ds=true
鼠标延时2=0
全局鬼天眼 = {地图=0,X=0,Y=0,鬼名=""}
全局大分区=""
全局小分区=""
全局行走开关={天庭叛逆=true,冥古=true,上古=true,远古=true,抓鬼=true,知了王=true,妖魔=true}
--========================================
时间=0
游戏音量 = math.ceil(读配置("./config.ini","mhxy","音量")+0) or 30
游戏音效 = math.ceil(读配置("./config.ini","mhxy","音效")+0) or 50
触碰延时=0
收到流程=0
发送流程=0
坐标地图显示=true
本地调试=调试模式
连点模式=false
坐标显示=本地调试
消息闪烁=false
推广模式=false
跨服模式=false
程序目录=取当前目录()..[[\]]
人物点击=false
鼠标={x=0,y=0}
申请队伍=false
全局临时路径=nil
系统退出=false
多角色操作 = false
多角色操作数据 = {}
全局资源地址 = {}
日夜="白天"
新加战斗锦衣 = {
      冰寒绡月白="aaa",
      冰雪玉兔="bbb",
      炽云缎墨黑="ccc",
      从军行="ddd",
      从军行月曜="aab",
      飞天舞="aac",
      飞天舞朝露="aad",
      绯雪织凝霜="aba",
      官服="abc",
      花间梦="abd",
      蒹葭苍苍寒月="abb",
      浪淘纱="aca",
      浪淘纱墨黑="acb",
      鹿角弯弯="acd",
      萌萌小厨="ada",
      明光宝甲="adb",
      青花瓷="adc",
      水云归="add",
      霞姿月韵="baa",
      闲云野鹤="bcc",
      雪眸影夜烬="bdd",
      夜影="caa",
      羽仙歌="cbb",
}



模型代码={
  逍遥生="aaa",剑侠客="bbb",偃无师="ccc",桃夭夭="ddd",舞天姬="aab",玄彩娥="aac",杀破狼="aad",
  巫蛮儿="abb",羽灵神="abc",巨魔王="abd",虎头怪="aca",英女侠="acb",飞燕女="acc",鬼潇潇="acd",
  神天兵="ada",骨精灵="adb",影精灵="adb",龙太子="adc",狐美人="add"
}


--=========================================
if 全局游戏宽度 < 849 then
	全局游戏宽度=800
end
if 全局游戏高度 < 619 then
	全局游戏高度=600
end
--=====
if 全局游戏宽度 > 1281 then
	全局游戏宽度=1280
end
if 全局游戏高度 > 822 then
	全局游戏高度=820
end
全局msg制作团队 = [[

]]
全局时辰微秒 = 0
全局时辰秒 = 0
全局时辰秒2=0
抽奖全局秒 = 0
全局自动走路秒 = 0
全局自动走路开关 = false
tp = 引擎.场景
local s时间,上次时间=0,0
界面字体=(读配置("./config.ini","mhxy","界面字体") + 0  or 1 )
NPC列表 = {}
传送数据 = {}
function 场景取假人表(地图ID, 假人ID)
    if not 地图ID  then
      return {}
    elseif  not NPC列表[地图ID] then
      return {}
    elseif 假人ID then
      return  NPC列表[地图ID][假人ID]
    else
        return NPC列表[地图ID]
    end
end


function 取地图id(地图)
  if  地图== 6001 then
    return 1131
  elseif 地图 == 6002 then
    return 1209
  elseif  地图>=6003 and 地图<=6009   then
    return 1197
  elseif  地图>=6010 and 地图<=6019   then
    return 1876
  elseif  地图 == 6020 then
    return 1514
  elseif  地图 == 6021 then
    return 1204
  elseif  地图 == 6022 then
    return 1137
  elseif  地图 == 6023 then
    return 1111
  elseif  地图 == 6024 then
    return 1002
  elseif  地图 == 6025 then
    return 1001
  elseif  地图 == 6026 then
    return 1211
  elseif  地图 == 6027 then
    return 1070
  elseif  地图 == 6028 then
    return 1140
  elseif  地图 == 6029 then
    return 1116
  elseif  地图 == 6030 then
    return 1202
  elseif  地图 == 6031 then
    return 1511
  elseif  地图 == 6032 then
    return 1231
  elseif  地图 == 6033 then
    return 1514
  elseif  地图 == 6034 then
    return 1007
  elseif  地图 == 6035 then
    return 1111
  elseif  地图 == 6036 then
    return 1514
  elseif  地图 == 6037 then
    return 1122
  elseif  地图 == 6038 then
    return 1111
  elseif  地图 == 6039 then
    return 1009
  elseif  地图 == 7001 then
    return 1237
  elseif  地图 == 7002 then
    return 1170
  elseif  地图 == 7003 then
    return 1412
  elseif  地图 == 7004 then
    return 1041
  elseif  地图 == 5003 then
    return 1221
  elseif  地图 == 10000 or 地图 == 10001  then
    return 1197
  elseif  地图 == 10002 or 地图 == 10012 then
    return 1142
  elseif  地图 == 10003 or 地图 == 10013 then
    return 1131
  elseif  地图 == 10004 or 地图 == 10014 then
    return 1218
  elseif  地图 == 10005 or 地图 == 10015 then
    return 1514
  elseif  地图 == 10006 or 地图 == 10016 then
    return 1116
  elseif  地图 == 10007 or 地图 == 10017 then
    return 1211
  elseif  地图 == 10008 or 地图 == 10018 then
    return 1114
  elseif  地图 == 10009  then
    return 1201
  elseif  地图 == 8000  then
    return 1206
  elseif  地图 == 8001 or 地图 == 8002 then
    return 1876
  elseif 5001 == 地图 then
    return 1042
  elseif 1621 == 地图 then
    return 1193
  elseif 1622 == 地图 then
    return 1090
  elseif 地图 >= 1600 and 地图 <= 1620 then
    return 1514
  -- elseif 1310 == 地图 or 1311 == 地图 or 1312 == 地图 or 1313 == 地图 or 1314 == 地图 or 1315 == 地图 or 1316 == 地图 or 1317 == 地图 or 1318 == 地图 or 1319 == 地图 then
  --   return 1310
  -- elseif 1320 == 地图 or 1321 == 地图 or 1322 == 地图 or 1323 == 地图 or 1324 == 地图 or 1325 == 地图 or 1326 == 地图 or 1327 == 地图 or 1328 == 地图 or 1329 == 地图 then
  --   return 1320
  -- elseif 1933 == 地图 or 1935 == 地图 or 1937 == 地图 or 1939 == 地图 or 1941 == 地图 or 1943 == 地图 or 1945 == 地图 or 1947 == 地图 or 1949 == 地图 or 1951 == 地图 then
  --   return 1933
  -- elseif 1934 == 地图 or 1936 == 地图 or 1938 == 地图 or 1940 == 地图 or 1942 == 地图 or 1944 == 地图 or 1946 == 地图 or 1948 == 地图 or 1950 == 地图 or 1952 == 地图 then
  --   return 1934
  elseif 地图>100000 and tp.房屋数据 then
      if tp.房屋数据.庭院ID == 地图 then
          return tp.房屋数据.庭院地图
      elseif tp.房屋数据.房屋ID == 地图 then
            return tp.房屋数据.房屋地图
      elseif tp.房屋数据.阁楼ID == 地图 then
            return tp.房屋数据.阁楼地图
      elseif tp.房屋数据.牧场ID == 地图 then
          return tp.房屋数据.牧场地图
      end
  end
  return 地图
end


function 场景取名称(地图ID)---  +40
    local 传送名称 = {}
    if 地图ID == 1003 then--桃源村
      传送名称[1] = {x=13,y=128,名称="0一9级",等级字体=true,红字体=false}
    elseif 地图ID == 1126 then--东海岩洞
      传送名称[1] = {x=5,y=103,名称="0一9级",等级字体=true,红字体=false}
    --  传送名称[2] = {x=185,y=35,名称="魁拔墓",等级字体=false,红字体=true}
    elseif 地图ID == 1508 then--沉船
      传送名称[1] = {x=26,y=10,名称="2一12级",等级字体=true,红字体=false}
      传送名称[2] = {x=150,y=160,名称="沉船内室",等级字体=false,红字体=false}
    elseif 地图ID == 1506 then--东海湾
      传送名称[1] = {x=100,y=102,名称="2一12级",等级字体=true,红字体=false}
      传送名称[2] = {x=100,y=120,名称="2一12级",等级字体=true,红字体=false}
    elseif 地图ID == 1501 then--建邺城
      传送名称[1] = {x=27,y=119,名称="6一16级",等级字体=true,红字体=false}
      传送名称[2] = {x=252,y=120,名称="0一9级",等级字体=true,红字体=false}
      传送名称[3] = {x=206,y=-4,名称="0一9级",等级字体=true,红字体=false}
    elseif 地图ID == 1193 then--江南野外
      传送名称[1] = {x=104,y=9,名称="南岭山",等级字体=false,红字体=false}
    elseif 地图ID == 1876 then--南岭山
      传送名称[1] = {x=180,y=100,名称="江南野外",等级字体=false,红字体=false}
      传送名称[2] = {x=1,y=135,名称="四方城",等级字体=false,红字体=false}
    elseif 地图ID == 1605 then--天鸣洞天
      传送名称[1] = {x=1,y=130,名称="潮音洞",等级字体=false,红字体=false}
    elseif 地图ID == 1135 then--方寸山
      传送名称[1] = {x=122,y=120,名称="观星台",等级字体=false,红字体=false}
    elseif 地图ID == 1237  then--四方城
      传送名称[1] = {x=250,y=10,名称="南岭山",等级字体=false,红字体=false}
    elseif 地图ID == 1208  then--朱紫国
      传送名称[1] = {x=76,y=105,名称="仙源洞天",等级字体=false,红字体=false}
    elseif 地图ID == 2008 then--九黎城
      传送名称[1] = {x=160  ,y=228,名称="大唐境外",等级字体=false,红字体=false}
    end
    return 传送名称
end



function 全局登陆内容()
--   全局登陆说明 = [[#Z常用游戏快捷键:
-- #G背包快捷键#YALT+E #G队伍快捷键#YALT+T
-- #G商城快捷键#YALT+D #G炼妖快捷键#YALT+C
-- #G任务快捷键#YALT+Q #G活动快捷键#YALT+Q
-- #G宠物快捷键#YALT+F
-- #Z游戏战斗快捷键:
-- #G攻击快捷键#YALT+A #G防御快捷键#YALT+D
-- #G道具快捷键#YALT+E #G法术快捷键#YALT+W
-- #G捕捉快捷键#YALT+G #G法术自动键#YALT+Q
-- #G法宝自动键#YALT+S #G特技自动键#YALT+Z
-- #G宠物召唤键#YALT+R #G自动战斗键#YALT+X
-- ]]
全局登陆说明 = [[]]
  tp.窗口.消息框:清空内容()
  tp.窗口.消息框:添加文本(全局登陆说明,"系统")
end

function 递归清空(表)
        if type(表)=="table" then
            for k,v in pairs(表) do
                if type(v)=="table" then
                  -- table.print(v)
                    递归清空(v)
                end
                表[k]=nil
            end
        end
end



function 整分处理(时间)
  if 时间=="00" or 时间=="10" or 时间=="20" or 时间=="30" or 时间=="40" or 时间=="50" then
      for i,v in pairs(跑商) do
        跑商[i] = 取商品卖出价格(i)
      end
  end
end

function 取商品卖出价格(spm)

  local dj
  if spm== "商品武器" then
      dj = 取随机数(3600,4500)
  elseif spm== "商品棉布" then
      dj = 取随机数(3200,3800)
  elseif spm== "商品佛珠" then
      dj = 取随机数(6200,8000)
  elseif spm== "商品扇子" then
      dj = 取随机数(3500,4200)
  elseif spm== "商品纸钱" then
      dj = 取随机数(2600,3400)
  elseif spm== "商品夜明珠" then
      dj = 取随机数(7600,9000)
  elseif spm== "商品首饰" then
      dj = 取随机数(3600,4800)
  elseif spm== "商品珍珠" then
      dj = 取随机数(5000,6000)
  elseif spm== "商品帽子" then
      dj = 取随机数(3000,4000)
  elseif spm== "商品盐" then
      dj = 取随机数(4800,6000)
  elseif spm== "商品蜡烛" then
      dj = 取随机数(1500,2500)
  elseif spm== "商品酒" then
      dj = 取随机数(3200,4500)
  elseif spm== "商品木材" then
      dj = 取随机数(3200,5000)
  elseif spm== "商品鹿茸" then
      dj = 取随机数(6800,8500)
  elseif spm== "商品面粉" then
      dj = 取随机数(2500,3500)
  elseif spm== "商品符" then
      dj = 取随机数(4500,6000)
  elseif spm== "商品人参" then
      dj = 取随机数(6500,9000)
  elseif spm== "商品铃铛" then
      dj = 取随机数(3200,4800)
  elseif spm== "商品香油" then
      dj = 取随机数(3200,5000)
  elseif spm== "商品麻线" then
      dj = 取随机数(2000,3800)
  end
  return dj
end

跑商={}
跑商.商品棉布=取商品卖出价格("商品棉布")
跑商.商品佛珠=取商品卖出价格("商品佛珠")
跑商.商品扇子=取商品卖出价格("商品扇子")
跑商.商品武器=取商品卖出价格("商品武器")
跑商.商品纸钱=取商品卖出价格("商品纸钱")
跑商.商品帽子=取商品卖出价格("商品帽子")
跑商.商品木材=取商品卖出价格("商品木材")
跑商.商品人参=取商品卖出价格("商品人参")
跑商.商品夜明珠=取商品卖出价格("商品夜明珠")
跑商.商品盐=取商品卖出价格("商品盐")
跑商.商品鹿茸=取商品卖出价格("商品鹿茸")
跑商.商品铃铛=取商品卖出价格("商品铃铛")
跑商.商品首饰=取商品卖出价格("商品首饰")
跑商.商品蜡烛=取商品卖出价格("商品蜡烛")
跑商.商品面粉=取商品卖出价格("商品面粉")
跑商.商品香油=取商品卖出价格("商品香油")
跑商.商品珍珠=取商品卖出价格("商品珍珠")
跑商.商品酒=取商品卖出价格("商品酒")
跑商.商品符=取商品卖出价格("商品符")
跑商.商品麻线=取商品卖出价格("商品麻线")

function 全局时辰刷新()
  s时间=os.time()
  if s时间-上次时间>=1 then
      时间=s时间
     上次时间=os.time()
  end
  if 全局时辰微秒 ~= 60 then
      全局时辰微秒 = 全局时辰微秒 + 1
      if 全局自动走路开关 == true then
          全局自动走路秒 = 全局自动走路秒 + 1
      end
  else
      全局时辰秒 = 全局时辰秒 + 1
      全局时辰秒2=全局时辰秒2+1
      抽奖全局秒 = 抽奖全局秒 + 1
      全局时辰微秒 = 0
  end
  if 抽奖全局秒 >= 15 then
     抽奖全局秒 = 0
  end
  if 全局时辰秒2 >= 60 then
      全局时辰秒2 =0
  end
end

function 数额尾数转换(数值)
  数值 = tonumber(数值)
   if 数值 < 10000 then
     return 数值
   elseif 数值 >= 10000 and 数值 < 100000000 then
     return string.format("%s%s",math.floor(数值/10000),"万")
   elseif 数值 >= 100000000 and 数值 < 1000000000000  then
     return string.format("%s%s",math.floor(数值/100000000),"亿")
   elseif  数值 >= 1000000000000 and 数值 < 10000000000000000  then
     return string.format("%s%s",math.floor(数值/1000000000000),"兆")
   elseif  数值 >= 10000000000000000  then
     return string.format("%s%s",math.floor(数值/10000000000000000),"京")
  end
end

function 取百分比转换(加入值,可减少值,总值)
  加入值 = 加入值 or 0
  return 加入值/(总值-可减少值)
end

function 重建tp()
  yq.场景 = require("script/全局/主控")()
  yq.垂直同步(false)
  local tp = yq.场景
end

function 引擎创建完成()

end






function 银两显示(字体,数额,x,y)
  银两个数=0
  if 数额~=nil then
    银两个数=string.len(数额)
  end

  if(银两个数==5)then
      字体:置颜色(蓝色)
  elseif(银两个数==6)then
      字体:置颜色(绿色)
  elseif(银两个数==7)then
      字体:置颜色(红色)
  elseif(银两个数==8)then
      字体:置颜色(黄色)
  elseif(银两个数>=9)then
      字体:置颜色(紫色)
  else
      字体:置颜色(紫色)
  end
  字体:显示(x,y,数额)
end

function 取金钱颜色(s)
  if s<10000 then
    return 黑色
  elseif s<100000 then
    return 蓝色
  elseif s<1000000 then
    return 绿色
  elseif s<10000000 then
    return 红色
  elseif s<100000000 then
    return 黄色
  else
    return 紫色
  end
end

function 取商城金钱颜色(s)
  if s<10000 then
    return 白色
  elseif s<100000 then
    return 蓝色
  elseif s<1000000 then
    return 绿色
  elseif s<10000000 then
    return 红色
  elseif s<100000000 then
    return 黄色
  else
    return 紫色
  end
end





随机序列=0
function 取随机数(q,w)
  随机序列=随机序列+1
  if 随机序列>=1000 then
    随机序列=0
  end
  if q==nil or w==nil then
    q=1 w=100
  else
  end
  math.randomseed(tostring(os.clock()*os.time()*随机序列))
  return  math.random(math.floor(q),math.floor(w))
end

function 取五行()
  local 五行_ = {"金","木","水","火","土"}
  return 五行_[取随机数(1,5)]
end

function 数字转大写(a)
  if a==1 then
    return "一"
  elseif a==2 then
    return "二"
  elseif a==3 then
    return "三"
  elseif a==4 then
    return "四"
  elseif a==5 then
    return "五"
  elseif a==6 then
    return "六"
  elseif a==7 then
    return "七"
  elseif a==8 then
    return "八"
  elseif a==9 then
    return "九"
  end
end


function 写出文件(qq,ww)
  写出内容(qq,ww)
  lfs.chdir(程序目录)

end

function 写出内容(qq, ww)
  if qq == nil or ww == nil or ww == "" then
    return 0
  end
  qq = 程序目录 .. qq
  local file = io.open(qq,"w")
  if file == nil then
    __S服务:输出("写出内容失败,请检查写出路径:"..qq)
    return 0
  end
  file:write(ww)
  file:close()
  text =0
  程序目录=lfs.currentdir()..[[\]]
  return text
end



function DeepCopy(object)
  local lookup_table = {}
  local function _copy(object)
    if type(object) ~= "table" then
      return object
    elseif lookup_table[object] then
      return lookup_table[object]
    end
    local new_table = {}
    lookup_table[object] = new_table
    for key, value in pairs(object) do
      new_table[_copy(key)] = _copy(value)
    end
    return setmetatable(new_table, getmetatable(object))
  end
  return _copy(object)
end

function 名称显示(名称,x,名称颜色)
  local 文字坐标={x=x.x,y=x.y+20}
  文字坐标.x=文字坐标.x-名称字体:取宽度(名称)/2
  --名称="比武大会精锐组状元"
  --名称="时尚宠儿"
  if 名称=="游戏管理员" then
    名称字体:置颜色(红色):置阴影颜色(ARGB(170,0,0,0))
    名称字体:显示(文字坐标.x,文字坐标.y,名称)
  else
    local 颜色=0xFF70FC70
    if 名称颜色~=nil then
      颜色=名称颜色
    end
    名称字体:置颜色(颜色):置阴影颜色(ARGB(170,0,0,0))
    名称字体:显示(文字坐标.x,文字坐标.y,名称)
  end
end

function 角度算四方向(角)
  local 方向 = 0
  if(角 >0 and 角 < 91) then
    方向 = 0 --"东北"
  elseif(角 > 90 and 角 < 181) then
    方向 = 1 --"西北"
  elseif(角 > 180 and 角 < 271) then
    方向 = 2 --"西南"
  elseif(角 > 270 or  角 == 0) then
    方向 = 3 --"东南"
  end
  return 方向
end


kemy={}
mab = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/*=.，'
key={["B"]="Cb,",["S"]="3C,",["5"]="6D,",["D"]="2W,",["c"]="dc,",["E"]="cj,",["b"]="vt,",["3"]="Iv,",["s"]="j1,",["N"]="23,",["d"]="mP,",["6"]="wd,",["7"]="7R,",["e"]="ET,",["t"]="nB,",["8"]="9v,",["4"]="yP,",["W"]="j6,",["9"]="Wa,",["H"]="D2,",["G"]="Ve,",["g"]="JA,",["I"]="Au,",["X"]="NR,",["m"]="DG,",["w"]="Cx,",["Y"]="Qi,",["V"]="es,",["F"]="pF,",["z"]="CO,",["K"]="XC,",["f"]="aW,",["J"]="DT,",["x"]="S9,",["y"]="xi,",["v"]="My,",["L"]="PW,",["u"]="Aa,",["k"]="Yx,",["M"]="qL,",["j"]="ab,",["r"]="fN,",["q"]="0W,",["T"]="de,",["l"]="P8,",["0"]="q6,",["n"]="Hu,",["O"]="A2,",["1"]="VP,",["i"]="hY,",["h"]="Uc,",["C"]="cK,",["A"]="f4,",["P"]="is,",["U"]="u2,",["o"]="m9,",["Q"]="vd,",["R"]="gZ,",["2"]="Zu,",["Z"]="Pf,",["a"]="Lq,",["p"]="Sw,"}

function jm(数据)
  数据=encodeBase641(数据)
  local jg=""
  for n=1,#数据 do
   local z=string.sub(数据,n,n)
   --print(z,key[z],n,#数据)
  if z~="" then
   if key[z]==nil then
      jg=jg..z
    else
      jg=jg..key[z]
     end
    end
    end
  return jg
end

function jm1(数据)
  local jg=数据
  for n=1,#mab do
    local z=string.sub(mab,n,n)
    -- print(key[z],z)
    -- if z=="," then
    --   print(66)
    -- end
    if key[z]~=nil then
      jg=string.gsub(jg,key[z],z)
    end
  end
 return decodeBase641(jg)
end

键盘符号={
    左键=0x00,
    中键=0x02,
    右键=0x01,
    退格=0x08,
    回车=0x0D,
    空格=0x20,
    tab=0x9,
    左=0x25,
    上=0x26,
    右=0x27,
    下=0x28
}
-- function 读入文件(fileName)
--     local f = assert(io.open(fileName,'r'))
--     local content = f:read('*all')
--     f:close()
--     return content
-- end

function 读入文件(fileName)
  local f = assert(io.open(fileName,'r'))
  local content = f:read('*all')
  f:close()
  if content=="" then content="无文本" end
  return content
end



-- function 计算修炼等级经验(等级,上限)
--     if 等级==0 then return 110 end
--     local 临时经验=110
--     for n=1,上限+1 do
--       临时经验=临时经验+20+n*20
--       if n==等级 then return  math.floor(临时经验) end
--     end
-- end


function 计算修炼经验(等级)
    等级= tonumber(等级) or 0
    if 等级==0 then return 110 end
    local 经验=110
    for n=1,等级 do
        经验=经验+20+n*20
    end
    return  math.floor(经验)
end

阵法位置={
    鸟翔阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=367,["x"]=587},[2]={["y"]=359,["x"]=703},[4]={["y"]=287,["x"]=689},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=429,["x"]=449},[10]={["y"]=243,["x"]=636},[3]={["y"]=436,["x"]=582},[6]={["y"]=327,["x"]=521}} return ret end]]
    ,天覆阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=384,["x"]=596},[2]={["y"]=383,["x"]=500},[4]={["y"]=412,["x"]=429},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=283,["x"]=686},[10]={["y"]=243,["x"]=636},[3]={["y"]=320,["x"]=613},[6]={["y"]=324,["x"]=522}} return ret end]]
    ,云垂阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=428,["x"]=670},[2]={["y"]=383,["x"]=500},[4]={["y"]=412,["x"]=429},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=282,["x"]=673},[10]={["y"]=243,["x"]=636},[3]={["y"]=320,["x"]=613},[6]={["y"]=326,["x"]=526}} return ret end]]
    ,地载阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=384,["x"]=597},[2]={["y"]=345,["x"]=552},[4]={["y"]=390,["x"]=490},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=415,["x"]=650},[10]={["y"]=243,["x"]=636},[3]={["y"]=320,["x"]=613},[6]={["y"]=320,["x"]=518}} return ret end]]
    ,风扬阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=400,["x"]=637},[2]={["y"]=360,["x"]=696},[4]={["y"]=321,["x"]=638},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=394,["x"]=512},[10]={["y"]=243,["x"]=636},[3]={["y"]=432,["x"]=573},[6]={["y"]=322,["x"]=525}} return ret end]]
    ,龙飞阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=448,["x"]=584},[2]={["y"]=467,["x"]=639},[4]={["y"]=440,["x"]=451},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=395,["x"]=526},[10]={["y"]=243,["x"]=636},[3]={["y"]=291,["x"]=690},[6]={["y"]=323,["x"]=525}} return ret end]]
    ,虎翼阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=444,["x"]=699},[2]={["y"]=359,["x"]=703},[4]={["y"]=287,["x"]=689},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=429,["x"]=449},[10]={["y"]=243,["x"]=636},[3]={["y"]=436,["x"]=582},[6]={["y"]=327,["x"]=521}} return ret end]]
    ,蛇蟠阵=[[do local ret={[7]={["y"]=357,["x"]=450},[1]={["y"]=408,["x"]=650},[2]={["y"]=441,["x"]=577},[4]={["y"]=403,["x"]=519},[8]={["y"]=274,["x"]=575},[9]={["y"]=385,["x"]=382},[5]={["y"]=447,["x"]=720},[10]={["y"]=243,["x"]=636},[3]={["y"]=368,["x"]=712},[6]={["y"]=327,["x"]=521}} return ret end]]
}

阵法位置1={
    天覆阵={[1]={x=138,y=145},--x=60  y=30
    [2]={x=115,y=200},
    [3]={x=235,y=140},
    [4]={x=55,y=230},
    [5]={x=295,y=110},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,云垂阵={[1]={x=118,y=125},--x=60  y=30
    [2]={x=115,y=200},
    [3]={x=235,y=140},
    [4]={x=55,y=230},
    [5]={x=295,y=110},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,地载阵={[1]={x=135,y=135},--x=60  y=30
    [2]={x=215,y=85},
    [3]={x=55,y=170},
    [4]={x=175,y=170},
    [5]={x=98,y=105},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,蛇蟠阵={[1]={x=135,y=135},--x=60  y=30
    [2]={x=215,y=85},
    [3]={x=55,y=170},
    [4]={x=260,y=115},
    [5]={x=98,y=105},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,鸟翔阵={[1]={x=175,y=170},--x=60  y=30
    [2]={x=55,y=240},
    [5]={x=60,y=180},
    [4]={x=200,y=115},
    [3]={x=295,y=110},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,虎翼阵={[1]={x=98,y=115},--x=60  y=30
    [2]={x=55,y=240},
    [5]={x=60,y=180},
    [4]={x=200,y=115},
    [3]={x=295,y=110},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,龙飞阵={[1]={x=135,y=135},--x=60  y=30
    [2]={x=175,y=160},
    [5]={x=98,y=115},
    [4]={x=240,y=140},
    [3]={x=55,y=230},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}

    ,风扬阵={[1]={x=135,y=135},--x=60  y=30
    [2]={x=215,y=85},
    [3]={x=55,y=170},
    [4]={x=240,y=140},
    [5]={x=118,y=205},
    [6]={x=220,y=210},--x=60  y=30
    [7]={x=160,y=240},
    [8]={x=280,y=180},
    [9]={x=100,y=270},
    [10]={x=340,y=150}}
}

帮派修炼={
  [1]=16,
  [2]=32,
  [3]=52,
  [4]=75,
  [5]=103,
  [6]=136,
  [7]=179,
  [8]=231,
  [9]=295,
  [10]=372,
  [11]=466,
  [12]=578,
  [13]=711,
  [14]=867,
  [15]=1049,
  [16]=1280,
  [17]=1503,
  [18]=1780,
  [19]=2096,
  [20]=2452,
  [21]=2854,
  [22]=3304,
  [23]=3807,
  [24]=4364,
  [25]=4983
}

帮派技能={
  [1]=16,
  [2]=32,
  [3]=52,
  [4]=75,
  [5]=103,
  [6]=136,
  [7]=179,
  [8]=231,
  [9]=295,
  [10]=372,
  [11]=466,
  [12]=578,
  [13]=711,
  [14]=867,
  [15]=1049,
  [16]=1280,
  [17]=1503,
  [18]=1780,
  [19]=2096,
  [20]=2452,
  [21]=2854,
  [22]=3304,
  [23]=3807,
  [24]=4364,
  [25]=4983,
  [26]=5664,
  [27]=6415,
  [28]=7238,
  [29]=8138,
  [30]=9120,
  [31]=10188,
  [32]=11347,
  [33]=12602,
  [34]=13959,
  [35]=15423,
  [36]=16998,
  [37]=18692,
  [38]=20508,
  [39]=22452,
  [40]=24532,
  [41]=26753,
  [42]=29121,
  [43]=31642,
  [44]=34323,
  [45]=37169,
  [46]=40186,
  [47]=43388,
  [48]=46773,
  [49]=50352,
  [50]=54132,
  [51]=58120,
  [52]=62324,
  [53]=66750,
  [54]=71407,
  [55]=76303,
  [56]=81444,
  [57]=86840,
  [58]=92500,
  [59]=104640,
  [60]=111136,
  [61]=117931,
  [62]=125031,
  [63]=132444,
  [64]=140183,
  [65]=148253,
  [66]=156666,
  [67]=156666,
  [68]=165430,
  [69]=174556,
  [70]=184052,
  [71]=193930,
  [72]=204198,
  [73]=214868,
  [74]=225948,
  [75]=237449,
  [76]=249383,
  [77]=261760,
  [78]=274589,
  [79]=287884,
  [80]=301652,
  [81]=315908,
  [82]=330662,
  [83]=345924,
  [84]=361708,
  [85]=378023,
  [86]=394882,
  [87]=412297,
  [88]=430280,
  [89]=448844,
  [90]=468000,
  [91]=487760,
  [92]=508137,
  [93]=529145,
  [94]=550796,
  [95]=573103,
  [96]=596078,
  [97]=619735,
  [98]=644088,
  [99]=669149,
  [100]=721452,
  [101]=748722,
  [102]=776755,
  [103]=805566,
  [104]=835169,
  [105]=865579,
  [106]=896809,
  [107]=928876,
  [108]=961792,
  [109]=995572,
  [110]=1030234,
  [111]=1065190,
  [112]=1102256,
  [113]=1139649,
  [114]=1177983,
  [115]=1217273,
  [116]=1256104,
  [117]=1298787,
  [118]=1341043,
  [119]=1384320,
  [120]=1428632,
  [121]=1473999,
  [122]=1520435,
  [123]=1567957,
  [124]=1616583,
  [125]=1666328,
  [126]=1717211,
  [127]=1769248,
  [128]=1822456,
  [129]=1876852,
  [130]=1932456,
  [131]=1989284,
  [132]=2047353,
  [133]=2106682,
  [134]=2167289,
  [135]=2229192,
  [136]=2292410,
  [137]=2356960,
  [138]=2422861,
  [139]=2490132,
  [140]=2558792,
  [141]=2628860,
  [142]=2700356,
  [143]=2773296,
  [144]=2847703,
  [145]=2923593,
  [146]=3000989,
  [147]=3079908,
  [148]=3160372,
  [149]=3242400,
  [150]=6652022,
  [151]=6822452,
  [152]=6996132,
  [153]=7173104,
  [154]=7353406,
  [155]=11305620,
  [156]=15305620,
  [157]=22305620,
  [158]=27305620,
  [159]=37305620,
  [160]=45305620,
  [161]=54305620
}

技能消耗={}
技能消耗.经验={
  [1]=16,
  [2]=32,
  [3]=52,
  [4]=75,
  [5]=103,
  [6]=136,
  [7]=179,
  [8]=231,
  [9]=295,
  [10]=372,
  [11]=466,
  [12]=578,
  [13]=711,
  [14]=867,
  [15]=1049,
  [16]=1280,
  [17]=1503,
  [18]=1780,
  [19]=2096,
  [20]=2452,
  [21]=2854,
  [22]=3304,
  [23]=3807,
  [24]=4364,
  [25]=4983,
  [26]=5664,
  [27]=6415,
  [28]=7238,
  [29]=8138,
  [30]=9120,
  [31]=10188,
  [32]=11347,
  [33]=12602,
  [34]=13959,
  [35]=15423,
  [36]=16998,
  [37]=18692,
  [38]=20508,
  [39]=22452,
  [40]=24532,
  [41]=26753,
  [42]=29121,
  [43]=31642,
  [44]=34323,
  [45]=37169,
  [46]=40186,
  [47]=43388,
  [48]=46773,
  [49]=50352,
  [50]=54132,
  [51]=58120,
  [52]=62324,
  [53]=66750,
  [54]=71407,
  [55]=76303,
  [56]=81444,
  [57]=86840,
  [58]=92500,
  [59]=104640,
  [60]=111136,
  [61]=117931,
  [62]=125031,
  [63]=132444,
  [64]=140183,
  [65]=148253,
  [66]=156666,
  [67]=156666,
  [68]=165430,
  [69]=174556,
  [70]=184052,
  [71]=193930,
  [72]=204198,
  [73]=214868,
  [74]=225948,
  [75]=237449,
  [76]=249383,
  [77]=261760,
  [78]=274589,
  [79]=287884,
  [80]=301652,
  [81]=315908,
  [82]=330662,
  [83]=345924,
  [84]=361708,
  [85]=378023,
  [86]=394882,
  [87]=412297,
  [88]=430280,
  [89]=448844,
  [90]=468000,
  [91]=487760,
  [92]=508137,
  [93]=529145,
  [94]=550796,
  [95]=573103,
  [96]=596078,
  [97]=619735,
  [98]=644088,
  [99]=669149,
  [100]=721452,
  [101]=748722,
  [102]=776755,
  [103]=805566,
  [104]=835169,
  [105]=865579,
  [106]=896809,
  [107]=928876,
  [108]=961792,
  [109]=995572,
  [110]=1030234,
  [111]=1065190,
  [112]=1102256,
  [113]=1139649,
  [114]=1177983,
  [115]=1217273,
  [116]=1256104,
  [117]=1298787,
  [118]=1341043,
  [119]=1384320,
  [120]=1428632,
  [121]=1473999,
  [122]=1520435,
  [123]=1567957,
  [124]=1616583,
  [125]=1666328,
  [126]=1717211,
  [127]=1769248,
  [128]=1822456,
  [129]=1876852,
  [130]=1932456,
  [131]=1989284,
  [132]=2047353,
  [133]=2106682,
  [134]=2167289,
  [135]=2229192,
  [136]=2292410,
  [137]=2356960,
  [138]=2422861,
  [139]=2490132,
  [140]=2558792,
  [141]=2628860,
  [142]=2700356,
  [143]=2773296,
  [144]=2847703,
  [145]=2923593,
  [146]=3000989,
  [147]=3079908,
  [148]=3160372,
  [149]=3242400,
  [150]=6652022,
  [151]=6822452,
  [152]=6996132,
  [153]=7173104,
  [154]=7353406,
  [155]=11305620,
  [156]=15305620,
  [157]=22305620,
  [158]=27305620,
  [159]=37305620,
  [160]=45305620,
  [161]=54305620,
  [162]=57305620,
  [163]=60305620,
  [164]=65305620,
  [165]=70305620,
  [166]=84305620,
}

for n=167,250 do
  技能消耗.经验[n]=math.floor(技能消耗.经验[n-1]*1.2)
end

技能消耗.金钱={
  [1]=6,
  [2]=12,
  [3]=19,
  [4]=28,
  [5]=38,
  [6]=51,
  [7]=67,
  [8]=86,
  [9]=110,
  [10]=139,
  [11]=174,
  [12]=216,
  [13]=266,
  [14]=325,
  [15]=393,
  [16]=472,
  [17]=563,
  [18]=667,
  [19]=786,
  [20]=919,
  [21]=1070,
  [22]=1238,
  [23]=1426,
  [24]=1636,
  [25]=1868,
  [26]=2124,
  [27]=2404,
  [28]=2714,
  [29]=3050,
  [30]=3420,
  [31]=3820,
  [32]=4255,
  [33]=4725,
  [34]=5234,
  [35]=5783,
  [36]=6374,
  [37]=7009,
  [38]=7680,
  [39]=8419,
  [40]=9199,
  [41]=10032,
  [42]=10920,
  [43]=11865,
  [44]=12871,
  [45]=13938,
  [46]=15070,
  [47]=16270,
  [48]=17540,
  [49]=18882,
  [50]=20299,
  [51]=21795,
  [52]=23371,
  [53]=25031,
  [54]=26777,
  [55]=28613,
  [56]=30541,
  [57]=32565,
  [58]=34687,
  [59]=36911,
  [60]=39240,
  [61]=41676,
  [62]=44224,
  [63]=46886,
  [64]=49666,
  [65]=52568,
  [66]=55595,
  [67]=58749,
  [68]=62036,
  [69]=65458,
  [70]=69019,
  [71]=72723,
  [72]=76574,
  [73]=80575,
  [74]=84730,
  [75]=89043,
  [76]=93516,
  [77]=98160,
  [78]=102971,
  [79]=107956,
  [80]=113119,
  [81]=118465,
  [82]=123998,
  [83]=129721,
  [84]=135640,
  [85]=141758,
  [86]=148080,
  [87]=154611,
  [88]=161355,
  [89]=168316,
  [90]=175500,
  [91]=182910,
  [92]=190551,
  [93]=198429,
  [94]=206548,
  [95]=214913,
  [96]=223529,
  [97]=232400,
  [98]=241533,
  [99]=250931,
  [100]=260599,
  [101]=270544,
  [102]=280770,
  [103]=291283,
  [104]=302087,
  [105]=313188,
  [106]=324592,
  [107]=336303,
  [108]=348328,
  [109]=360672,
  [110]=373339,
  [111]=386337,
  [112]=399671 ,
  [113]=413346,
  [114]=427368,
  [115]=441743,
  [116]=456477,
  [117]=471576,
  [118]=487045,
  [119]=502891,
  [120]=519120,
  [121]=535737,
  [122]=552749,
  [123]=570163,
  [124]=587984,
  [125]=606218,
  [126]=624873,
  [127]=643954,
  [128]=663468 ,
  [129]=683421,
  [130]=703819,
  [131]=724671,
  [132]=745981,
  [133]=767757,
  [134]=790005,
  [135]=812733,
  [136]=835947 ,
  [137]=859653,
  [138]=883860,
  [139]=908573 ,
  [140]=933799 ,
  [141]=959547 ,
  [142]=985822,
  [143]=1012633,
  [144]=1039986,
  [145]=1067888 ,
  [146]=1096347,
  [147]=1125371,
  [148]=1154965,
  [149]=1185139,
  [150]=1215900,
  [151]=2494508,
  [152]=2558419,
  [153]=2623549,
  [154]=2689914,
  [155]=2757527,
  [156]=4239607,
  [157]=6239607,
  [158]=8239607,
  [159]=10239607,
  [160]=15239607,
  [161]=18239607,
  [162]=20239607,
  [163]=25239607,
  [164]=30239607,
  [165]=36239607,
  [166]=40239607,
}
for n=167,250 do
  技能消耗.金钱[n]=math.floor(技能消耗.金钱[n-1]*1.2)
end


function 取角色锦衣武器类型(模型,武器)
    if (模型 == "逍遥生" or  模型 == "偃无师")  and 武器 == "剑" then------
           return 1
    elseif 模型 == "剑侠客" and 武器 == "刀" then----
           return 1
    elseif 模型 == "舞天姬" and 武器 == "环圈" then
           return 1
    elseif 模型 == "桃夭夭"  and 武器 == "飘带" then
           return 1
    elseif (模型 == "玄彩娥" or 模型 == "骨精灵") and 武器 == "魔棒" then
           return 1
    elseif 模型 == "杀破狼" and 武器 == "宝珠" then
           return 1
    elseif (模型 == "巫蛮儿" or 模型 == "羽灵神") and 武器 == "法杖" then
           return 1
    elseif (模型 == "神天兵" or 模型 == "虎头怪" or 模型 == "巨魔王") and 武器 == "锤" then
           return 1
    elseif (模型 == "飞燕女" or 模型 == "狐美人") and 武器 == "双短剑" then
           return 1
    elseif 模型 == "英女侠" and 武器 == "鞭" then
           return 1
    elseif 模型 == "鬼潇潇" and 武器 == "爪刺" then
           return 1
    elseif 模型 == "龙太子" and 武器 == "枪矛" then
           return 1
    else
         return 2
    end

end

function 金色id(名字,参数)
   local s=tostring(名字)
   local k=string.len(s)
   local list1={}
   for i=1,k do
    list1[i]=string.sub(s,i,i)
   end
   local 靓号=""
   for n=1,#list1 do
     靓号=靓号.."#"..list1[n]+111+参数*10
   end

   return 靓号
end









-- if 授权名称=="单机" then
--    分区内容 =[[
--         1 绝世西游
--         1 1 绝世单机 127.0.0.1 8079
--         ]]
--   elseif 授权名称=="绝世西游" then
--      分区内容 =[[
--         1 绝世西游
--         1 1 绝世西游 124.223.42.26 8079
--         ]]
--   elseif 授权名称=="梦回长安"  then
--        分区内容 =[[
--            1 梦回长安
--            1 1 黄粱一梦 120.46.203.169 8079
--            ]]
--   elseif 授权名称=="追忆年华"  then
--        分区内容 =[[
--            1 追忆年华
--            1 1 侠客行 111.231.28.242 9079
--            ]]
--   elseif 授权名称=="情怀梦幻"  then
--        分区内容 =[[
--           1 情怀梦幻
--           1 1 情怀梦幻 139.199.199.46 8079
--           ]]
--   elseif 授权名称=="永恒西游"  then
--       分区内容 =[[
--           1 永恒西游
--           1 1 永恒西游 127.2.69.207 8079
--           ]]
--   elseif 授权名称=="棋牌室"  then
--        分区内容 =[[
--           1 棋牌室
--           1 1 棋牌室 127.2.67.85 8079
--           ]]
--   else

--    分区内容 =[[
--           1 绝世西游
--           1 1 绝世西游 103.39.230.151 9100

--    ]]
--  end


