-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2022-10-18 18:19:15
-- @最后修改来自: baidwwy
-- @Last Modified time: 2025-01-02 21:37:09
function 引擎.取剧情动画(动画id)
	local 人物组 = {}
	local 事件组 = {}
	local 初始镜头坐标 = nil
	if 动画id==7001 then
		人物组 = {
			{名称="证婚人",模型="男人_道士",X=15,Y=37,方向=0,编号=1},
			{主角=true,X=29,Y=45,方向=2,编号=2},
			{名称="新郎",模型="逍遥生",X=20,Y=37,方向=1,编号=3},
			{名称="新娘",模型="飞燕女",X=15,Y=41,方向=3,编号=4},
			{名称="小妞妞",模型="小丫丫",X=33,Y=42,方向=2,编号=5},
			{名称="叶夫人",模型="飞燕女",X=22,Y=48,方向=2,编号=6},
			{名称="媒婆",模型="女人_赵姨娘",X=22,Y=44,方向=3,编号=7},
			{名称="田百万",模型="男人_财主",X=30,Y=41,方向=1,编号=8},
			{名称="鸾儿姑娘",模型="狐美人",X=28,Y=43,方向=2,编号=9},
		}
		事件组 = {
			[1]={
				[[引擎.场景.第二场景:加入喊话(100,1,"一拜天地#6",600)]],
				[[引擎.场景.第二场景:加入喊话(120,2,"恭喜恭喜#1",600)]],
				[[引擎.场景.第二场景:加入喊话(150,5,"新娘子姐姐好漂亮啊#80",600)]],
				[[引擎.场景.第二场景:加入喊话(500,1,"二拜高堂#22",600)]],
				[[引擎.场景.第二场景:加入喊话(550,8,"这件婚事一成，崔家的财产就全进了新女婿的口袋啦！",600)]],
				[[引擎.场景.第二场景:加入喊话(600,7,"这番排场，啧啧啧~~~~~~~~",600)]],
				[[引擎.场景.第二场景:加入喊话(900,1,"夫妻对拜#89",600)]],
				[[引擎.场景.第二场景:加入喊话(910,2,"真是热闹啊，不愧是四方城中数一数二的大户人家！",600)]],
				[[引擎.场景.第二场景:加入喊话(1050,9,"啊！！！！！！我要杀了你们",600)]],
				[[引擎.场景.第二场景:置人物方向(1101,3,0)]],
				[[引擎.场景.第二场景:置人物方向(1102,4,0)]],
				[[引擎.场景.第二场景:置人物方向(1103,5,1)]],
				[[引擎.场景.第二场景:置人物方向(1104,7,0)]],
				[[引擎.场景.第二场景:加入喊话(1300,1,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1301,2,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1302,3,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1303,4,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1304,5,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1305,7,"？？？？？",600)]],
				[[引擎.场景.第二场景:加入喊话(1306,8,"？？？？？",600)]],
				[[引擎.场景.第二场景:关闭(500)]]
			}
		}
	elseif 动画id==7002 then
		人物组 = {
			{名称="沈唐",模型="逍遥生",武器="星瀚",X=20,Y=37,方向=1,编号=1},
			{名称="崔明珠",模型="英女侠",X=15,Y=41,方向=3,编号=2},
			{主角=true,X=26,Y=60,方向=2,编号=3,不允许加入=true},
		}
		事件组 = {
			[1]={
				[[引擎.场景.第二场景:加入喊话(200,1,"明珠，岳父大人待我恩重如山，我无以为报，若是此次以我顶罪，便可以保住崔家的家业和声名。",1000)]],
				[[引擎.场景.第二场景:加入喊话(600,2,"你……不必这样的……父亲他们是清白的……我们一定可以想到别的办法……",1000)]],
				[[引擎.场景.第二场景:加入喊话(1000,1,"如今的境况……珠儿，你喝下这杯合婚酒，我们未完的婚礼便完成了……这也算是个道别吧……",1000)]],
				[[引擎.场景.第二场景:置入人物(1200,{3},{"无","无"})]],
		      	[[引擎.场景.第二场景:置人物移动(1200,3,21,42)]],
		      	[[引擎.场景.第二场景:加入喊话(1400,3,"明珠姑娘，你不要听信这个家伙！！酒里有毒！！",1000)]],
		      	[[引擎.场景.第二场景:置人物动作(1600,3,"攻击")]],
		      	[[引擎.场景.第二场景:置人物动作(1660,2,"挨打")]],
				[[引擎.场景.第二场景:关闭(350)]]
			}
		}
		初始镜头坐标=生成XY(25,40)
	elseif 动画id==7003 then
		人物组 = {
			{名称="沈唐",模型="鲛人",X=70,Y=62,方向=1,编号=1},
			{名称="崔明珠",模型="英女侠",X=71,Y=68,方向=2,编号=2},
			{主角=true,X=60,Y=66,方向=3,编号=3},
		}
		事件组 = {
			[1]={
				[[引擎.场景.第二场景:置人物移动(50,3,63,66)]],
				[[引擎.场景.第二场景:置人物移动(70,2,68,64)]],
				[[引擎.场景.第二场景:加入喊话(100,2,"不要伤害他！！",800)]],
				[[引擎.场景.第二场景:置人物动作(140,3,"攻击")]],
				[[引擎.场景.第二场景:置人物模型(160,2,"英女侠_倒下")]],
				[[引擎.场景.第二场景:置人物方向(160,2,2)]],
				[[引擎.场景.第二场景:置人物帧行为(170,2,1)]],
				[[引擎.场景.第二场景:加入喊话(250,3,"明珠姑娘！",1600)]],
				[[引擎.场景.第二场景:加入喊话(400,2,"我一直都觉得……你……有心事……本来想……无论如何……我都会尽我所能……帮你了结这番心事……",1600)]],
				[[引擎.场景.第二场景:加入喊话(1000,2,"也不枉……我…们……夫妻……一……场……",1600)]],
				[[引擎.场景.第二场景:加入喊话(1600,2,"可是却想不到……竟……是爹爹……我……求求你……不要再恨下去……",1600)]],
				[[引擎.场景.第二场景:加入喊话(2200,2,"回……四方城……关掉崔家所有的……铺子……",1600)]],
				[[引擎.场景.第二场景:加入喊话(2800,1,"明珠，你醒醒，你……#52#52",1600)]],
				[[引擎.场景.第二场景:关闭(500)]]
			}
		}
		初始镜头坐标=生成XY(70,61)
	end
	return 人物组,事件组,初始镜头坐标
end