--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2025-06-02 16:34:07
--======================================================================--
function 引擎.取战斗模型(pg,wq)
	if pg==nil then
	    pg = "天将"
	end
	local pgs = {}
	local pg2 = pg
	local s = "_普通"
	if wq ~= nil and wq ~= "" then
	   	s = "_"..wq
	end
	pg = pg..s





	if pg == "竹节双剑_飞燕女_普通" then
		pgs[1] = 1107292387
		pgs[2] = 1107292387
		pgs[3] = 2521369664
		pgs[4] = 3431990852
		pgs[6] = 2150756975
		pgs[7] = 2948306353
		pgs[8] = 3415383948
		pgs[9] = 2723304031
		pgs[10] = "战斗模型.wdf"
	elseif pg == "骨精灵_爪刺" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xD04D9728
		pgs[12] = 0x3563D35F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "无极丝_玄彩娥_普通" then
		pgs[1] = 720570501
		pgs[2] = 720570501
		pgs[3] = 177832508
		pgs[4] = 2487726993
		pgs[6] = 3513269889
		pgs[7] = 629550622
		pgs[8] = 327433169
		pgs[9] = 2643257844
		pgs[10] = "战斗模型.wdf"
	elseif pg == "羽灵神_法杖" then
		pgs[1] = 529648379
		pgs[2] = 529648379
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 2280958058
		pgs[7] = 4138194582
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xC7F8CA2F
		pgs[12] = 0xA2E7AFCF
		pgs[15] = "audio/1115.mp3"
	elseif pg == "狼牙锤_虎头怪_普通" then
		pgs[1] = 2073386691
		pgs[2] = 2073386691
		pgs[3] = 336486465
		pgs[4] = 381771912
		pgs[6] = 4106128916
		pgs[7] = 1791439790
		pgs[8] = 568824381
		pgs[9] = 1676981226
		pgs[10] = "战斗模型.wdf"
	elseif pg == "腾云杖_巫蛮儿_普通" then
		pgs[1] = 3456418962
		pgs[2] = 3456418962
		pgs[3] = 1443524884
		pgs[4] = 2407737199
		pgs[6] = 4073450724
		pgs[7] = 4073450724
		pgs[8] = 2828185705
		pgs[9] = 2088694658
		pgs[10] = "战斗模型.wdf"
	elseif pg == "逍遥生_普通" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 2305122459
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙太子_扇" then
		pgs[1] = 241140809
		pgs[2] = 241140809
		pgs[3] = 1280216665
		pgs[4] = 3101694266
		pgs[6] = 2034116134
		pgs[7] = 2603954881
		pgs[8] = 4232546957
		pgs[9] = 3966136859
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x6DDC0F67
		pgs[12] = 0x42C2F6BE
		pgs[15] = "audio/1115.mp3"
	elseif pg == "游龙剑_剑侠客_普通" then
		pgs[1] = 3922251448
		pgs[2] = 3922251448
		pgs[3] = 2729643500
		pgs[4] = 3737672137
		pgs[6] = 525352739
		pgs[7] = 948395215
		pgs[8] = 563220674
		pgs[9] = 3149578823
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青铜短剑_逍遥生_普通" then
		pgs[1] = 1198108472
		pgs[2] = 1198108472
		pgs[3] = 1361263285
		pgs[4] = 2271925935
		pgs[6] = 2946567894
		pgs[7] = 3149178979
		pgs[8] = 3990213912
		pgs[9] = 3929526014
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞燕女_普通" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 322750433
		pgs[4] = 29450010
		pgs[6] = 3234089534
		pgs[7] = 2076610755
		pgs[8] = 2826457680
		pgs[9] = 2418368925
		pgs[10] = "战斗模型.wdf"
	elseif pg == "七彩罗刹_玄彩娥_普通" then
		pgs[1] = 2097271664
		pgs[2] = 2097271664
		pgs[3] = 446065688
		pgs[4] = 34704861
		pgs[6] = 2226391655
		pgs[7] = 4023029297
		pgs[8] = 2658422875
		pgs[9] = 1050015636
		pgs[10] = "战斗模型.wdf"
	elseif pg == "神火扇_龙太子_普通" then
		pgs[1] = 1818358093
		pgs[2] = 1818358093
		pgs[3] = 3568094185
		pgs[4] = 1584219148
		pgs[6] = 3409145103
		pgs[7] = 666236837
		pgs[8] = 3980290410
		pgs[9] = 1171511807
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青铜斧_虎头怪_普通" then
		pgs[1] = 2625820889
		pgs[2] = 2625820889
		pgs[3] = 1963828881
		pgs[4] = 1319228411
		pgs[6] = 860172680
		pgs[7] = 36420174
		pgs[8] = 3821452431
		pgs[9] = 303003892
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狐美人_爪刺" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 3180126153
		pgs[4] = 3467601219
		pgs[6] = 1873404188
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x846F1074
		pgs[12] = 0x1D156715
		pgs[15] = "audio/1115.mp3"
	elseif pg == "青龙牙_骨精灵_普通" then
		pgs[1] = 3799914888
		pgs[2] = 3799914888
		pgs[3] = 1849406648
		pgs[4] = 623293418
		pgs[6] = 4122645564
		pgs[7] = 674755217
		pgs[8] = 1075420620
		pgs[9] = 3643822727
		pgs[10] = "战斗模型.wdf"
	elseif pg == "乌金三叉戟_神天兵_普通" then
		pgs[1] = 408164304
		pgs[2] = 408164304
		pgs[3] = 4205323621
		pgs[4] = 2362411253
		pgs[6] = 2944638184
		pgs[7] = 611952719
		pgs[8] = 907746138
		pgs[9] = 1478073855
		pgs[10] = "战斗模型.wdf"
	elseif pg == "如意宝珠_杀破狼_普通" then
		pgs[1] = 2994264484
		pgs[2] = 2994264484
		pgs[3] = 1404894523
		pgs[4] = 530980268
		pgs[6] = 3593075951
		pgs[7] = 4288686185
		pgs[8] = 834957611
		pgs[9] = 935164006
		pgs[10] = "战斗模型.wdf"
	elseif pg == "竹节双剑_英女侠_普通" then
		pgs[1] = 785035487
		pgs[2] = 785035487
		pgs[3] = 388404819
		pgs[4] = 3063317704
		pgs[6] = 781929242
		pgs[7] = 992739922
		pgs[8] = 2099829177
		pgs[9] = 2839104966
		pgs[10] = "战斗模型.wdf"
	elseif pg == "双弦钺_虎头怪_普通" then
		pgs[1] = 3106550770
		pgs[2] = 3106550770
		pgs[3] = 867109572
		pgs[4] = 813505863
		pgs[6] = 4256430594
		pgs[7] = 1073168906
		pgs[8] = 3722911626
		pgs[9] = 1532549372
		pgs[10] = "战斗模型.wdf"
	elseif pg == "羽灵神_弓弩" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x78B26A25
		pgs[12] = 0x3C1EC801
		pgs[15] = "audio/1115.mp3"
	elseif pg == "羽灵神_弓弩1" then
		pgs[1] = 0042392635
		pgs[2] = 0042392635
		pgs[3] = 0570130129
		pgs[4] = 1552868103
		pgs[6] = 1139367548
		pgs[7] = 0xB4F23D56
		pgs[8] = 1750053013
		pgs[9] = 1516641634
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x78B26A25
		pgs[12] = 0x3C1EC801
		pgs[15] = "audio/1115.mp3"
	elseif pg == "青铜短剑_剑侠客_普通" then
		pgs[1] = 4256351077
		pgs[2] = 4256351077
		pgs[3] = 1799000911
		pgs[4] = 3029718579
		pgs[6] = 2340710053
		pgs[7] = 874161900
		pgs[8] = 1001128045
		pgs[9] = 3927011624
		pgs[10] = "战斗模型.wdf"
	elseif pg == "无极丝_舞天姬_普通" then
		pgs[1] = 614245463
		pgs[2] = 614245463
		pgs[3] = 1946824091
		pgs[4] = 694856255
		pgs[6] = 2175791405
		pgs[7] = 448343009
		pgs[8] = 2148337924
		pgs[9] = 2923284079
		pgs[10] = "战斗模型.wdf"
	elseif pg == "翡翠珠_巫蛮儿_普通" then
		pgs[1] = 3539296504
		pgs[2] = 3539296504
		pgs[3] = 2255315467
		pgs[4] = 1802143462
		pgs[6] = 1510770330
		pgs[7] = 1930701898
		pgs[8] = 3505690179
		pgs[9] = 1435774063
		pgs[10] = "战斗模型.wdf"
	elseif pg == "虎头怪_斧钺" then
		pgs[1] = 2471916192
		pgs[2] = 2471916192
		pgs[3] = 1740983547
		pgs[4] = 1851258377
		pgs[6] = 1927395527
		pgs[7] = 1883982028
		pgs[8] = 2089007572
		pgs[9] = 92383142
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x9E683B76
		pgs[12] = 0x7A01CD70
		pgs[15] = "audio/1115.mp3"
	elseif pg == "点金棒_骨精灵_普通" then
		pgs[1] = 3310814476
		pgs[2] = 3310814476
		pgs[3] = 3103212281
		pgs[4] = 3301564224
		pgs[6] = 1122132964
		pgs[7] = 3107411095
		pgs[8] = 155295757
		pgs[9] = 1580683403
		pgs[10] = "战斗模型.wdf"
	elseif pg == "琉璃珠_巫蛮儿_普通" then
		pgs[1] = 1403236209
		pgs[2] = 1403236209
		pgs[3] = 1329700091
		pgs[4] = 1691312599
		pgs[6] = 786593580
		pgs[7] = 164320860
		pgs[8] = 2463504053
		pgs[9] = 2573416526
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狼牙刀_巨魔王_普通" then
		pgs[1] = 1348040770
		pgs[2] = 1348040770
		pgs[3] = 352421824
		pgs[4] = 1800113692
		pgs[6] = 1284246655
		pgs[7] = 4283867446
		pgs[8] = 1391628501
		pgs[9] = 2232000579
		pgs[10] = "战斗模型.wdf"
	elseif pg == "牛皮鞭_英女侠_普通" then
		pgs[1] = 3931398716
		pgs[2] = 3931398716
		pgs[3] = 1978009081
		pgs[4] = 3180100501
		pgs[6] = 2391704735
		pgs[7] = 2419933303
		pgs[8] = 2521677817
		pgs[9] = 2956424440
		pgs[10] = "战斗模型.wdf"
	elseif pg == "钢结鞭_狐美人_普通" then
		pgs[1] = 2383050056
		pgs[2] = 2383050056
		pgs[3] = 3281460149
		pgs[4] = 3516998304
		pgs[6] = 246739877
		pgs[7] = 3039794984
		pgs[8] = 875610474
		pgs[9] = 3210281280
		pgs[10] = "战斗模型.wdf"
	elseif pg == "逍遥生_剑" then
		pgs[1] = 2801151609
		pgs[2] = 2801151609
		pgs[3] = 1782439566
		pgs[4] = 3738039458
		pgs[6] = 1629704855
		pgs[7] = 1539613628
		pgs[8] = 1512265752
		pgs[9] = 116130982
		pgs[10] = "战斗模型.wdf"
	    pgs[11] = 0x3936CBE8
		pgs[12] = 0x6620A3A2
		pgs[15] = "audio/1115.mp3"
	elseif pg == "折扇_逍遥生_普通" then
		pgs[1] = 2964614373
		pgs[2] = 2964614373
		pgs[3] = 3257923907
		pgs[4] = 293936349
		pgs[6] = 1375158316
		pgs[7] = 3094890393
		pgs[8] = 1511168433
		pgs[9] = 391725534
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青刚刺_狐美人_普通" then
		pgs[1] = 181873383
		pgs[2] = 181873383
		pgs[3] = 1794635107
		pgs[4] = 429992710
		pgs[6] = 1822050644
		pgs[7] = 366643004
		pgs[8] = 2389652378
		pgs[9] = 2180063945
		pgs[10] = "战斗模型.wdf"
	elseif pg == "折扇_龙太子_普通" then
		pgs[1] = 1892693347
		pgs[2] = 1892693347
		pgs[3] = 3257923907
		pgs[4] = 1204995981
		pgs[6] = 1362359639
		pgs[7] = 2228831626
		pgs[8] = 3633790550
		pgs[9] = 80506382
		pgs[10] = "战斗模型.wdf"
	elseif pg == "腾云杖_羽灵神_普通" then
		pgs[1] = 446004749
		pgs[2] = 446004749
		pgs[3] = 866998113
		pgs[4] = 30654504
		pgs[6] = 3664608621
		pgs[7] = 631837046
		pgs[8] = 3821365630
		pgs[9] = 172627858
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙太子_普通" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 1284179344
		pgs[9] = 1173564955
		pgs[10] = "战斗模型.wdf"
	elseif pg == "双弦钺_巨魔王_普通" then
		pgs[1] = 1793132112
		pgs[2] = 1793132112
		pgs[3] = 1963828881
		pgs[4] = 3898773470
		pgs[6] = 2550126650
		pgs[7] = 153091850
		pgs[8] = 544328121
		pgs[9] = 2797209389
		pgs[10] = "战斗模型.wdf"
	elseif pg == "铁爪_骨精灵_普通" then
		pgs[1] = 3158218287
		pgs[2] = 3158218287
		pgs[3] = 4058918673
		pgs[4] = 619798639
		pgs[6] = 4166133046
		pgs[7] = 2469680581
		pgs[8] = 1948730791
		pgs[9] = 2320459601
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青藤柳叶鞭_英女侠_普通" then
		pgs[1] = 2804585084
		pgs[2] = 2804585084
		pgs[3] = 60106873
		pgs[4] = 1142701864
		pgs[6] = 3663657779
		pgs[7] = 1499832483
		pgs[8] = 3691312807
		pgs[9] = 3691312807
		pgs[10] = "战斗模型.wdf"
	elseif pg == "舞天姬_普通" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 365985475
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞燕女_双短剑" then
		pgs[1] = 2103710679
		pgs[2] = 2103710679
		pgs[3] = 322750433
		pgs[4] = 29450010
		pgs[6] = 3234089534
		pgs[7] = 2076610755
		pgs[8] = 2826457680
		pgs[9] = 2418368925
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x7D959E28
		pgs[12] = 0x87F8C21A
		pgs[15] = "audio/1115.mp3"
	elseif pg == "细木棒_骨精灵_普通" then
		pgs[1] = 572946160
		pgs[2] = 572946160
		pgs[3] = 869013113
		pgs[4] = 430229213
		pgs[6] = 0x8FE3BEA0
		pgs[7] = 87009475
		pgs[8] = 3532585728
		pgs[9] = 1194431645
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金背大砍刀_剑侠客_普通" then
		pgs[1] = 2695990707
		pgs[2] = 2695990707
		pgs[3] = 1837946764
		pgs[4] = 1995983471
		pgs[6] = 3956010201
		pgs[7] = 3740065177
		pgs[8] = 3607972716
		pgs[9] = 1238352835
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狐美人_普通" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 3180126153
		pgs[4] = 3467601219
		pgs[6] = 1734212905
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玄铁矛_神天兵_普通" then
		pgs[1] = 457024889
		pgs[2] = 457024889
		pgs[3] = 575337904
		pgs[4] = 970913679
		pgs[6] = 3111818852
		pgs[7] = 1880364342
		pgs[8] = 883798385
		pgs[9] = 2466450533
		pgs[10] = "战斗模型.wdf"
	elseif pg == "黄铜圈_飞燕女_普通" then
		pgs[1] = 4146113787
		pgs[2] = 4146113787
		pgs[3] = 3328869375
		pgs[4] = 2935267523
		pgs[6] = 2104438938
		pgs[7] = 3418401452
		pgs[8] = 867616434
		pgs[9] = 2580407403
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玄铁矛_龙太子_普通" then
		pgs[1] = 650631390
		pgs[2] = 650631390
		pgs[3] = 1332270280
		pgs[4] = 1220141886
		pgs[6] = 407764697
		pgs[7] = 477458607
		pgs[8] = 4281686609
		pgs[9] = 663869830
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巨魔王_普通" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 4036925699
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青藤柳叶鞭_狐美人_普通" then
		pgs[1] = 1451526591
		pgs[2] = 1451526591
		pgs[3] = 672510267
		pgs[4] = 2873780575
		pgs[6] = 2492119629
		pgs[7] = 599092463
		pgs[8] = 3419036208
		pgs[9] = 2641306317
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玄彩娥_魔棒" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 3870010961
		pgs[6] = 184048410
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x440A2BC5
		pgs[12] = 0x4FF6B583
		pgs[15] = "audio/1115.mp3"
	elseif pg == "连珠神弓_羽灵神_普通" then
		pgs[1] = 2326794251
		pgs[2] = 2326794251
		pgs[3] = 2712600528
		pgs[4] = 3987564547
		pgs[6] = 427605991
		pgs[7] = 3545789610
		pgs[8] = 49846298
		pgs[9] = 4190609956
		pgs[10] = "战斗模型.wdf"
	elseif pg == "蛇形月_飞燕女_普通" then
		pgs[1] = 1584140220
		pgs[2] = 1584140220
		pgs[3] = 1692063004
		pgs[4] = 1463150317
		pgs[6] = 4215251914
		pgs[7] = 3715550978
		pgs[8] = 174531720
		pgs[9] = 913070441
		pgs[10] = "战斗模型.wdf"
	elseif pg == "翡翠珠_杀破狼_普通" then
		pgs[1] = 1888438119
		pgs[2] = 1888438119
		pgs[3] = 832082873
		pgs[4] = 2462082254
		pgs[6] = 3335305851
		pgs[7] = 3225276990
		pgs[8] = 3777022322
		pgs[9] = 2618824675
		pgs[10] = "战斗模型.wdf"
	elseif pg == "杀破狼_普通" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "战斗模型.wdf"
	elseif pg == "墨铁拐_羽灵神_普通" then
		pgs[1] = 581491157
		pgs[2] = 581491157
		pgs[3] = 95568889
		pgs[4] = 4136518094
		pgs[6] = 1603576455
		pgs[7] = 2492027915
		pgs[8] = 616237873
		pgs[9] = 2456783957
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞燕女_环圈" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 2068177574
		pgs[4] = 4111908170
		pgs[6] = 1489146739
		pgs[7] = 607870271
		pgs[8] = 1607593791
		pgs[9] = 3911067979
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xBAD926DB
		pgs[12] = 0xC6758D02
		pgs[15] = "audio/1115.mp3"
	elseif pg == "杀破狼_宝珠" then
		pgs[1] = 3067304876
		pgs[2] = 3067304876
		pgs[3] = 3215162495
		pgs[4] = 1186759867
		pgs[6] = 1266038770
		pgs[7] = 2576943278
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xE3AE17C1
		pgs[12] = 0x3C1EC801
		pgs[15] = "audio/1115.mp3"
	elseif pg == "玄彩娥_普通" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "战斗模型.wdf"
	elseif pg == "双短剑_飞燕女_普通" then
		pgs[1] = 18896713
		pgs[2] = 18896713
		pgs[3] = 2502791430
		pgs[4] = 3950458782
		pgs[6] = 0xB1488E22
		pgs[7] = 3421854459
		pgs[8] = 967461082
		pgs[9] = 372406582
		pgs[10] = "战斗模型.wdf"
	elseif pg == "双短剑_英女侠_普通" then
		pgs[1] = 2749813573
		pgs[2] = 2749813573
		pgs[3] = 3182553286
		pgs[4] = 2212413736
		pgs[6] = 2408807811
		pgs[7] = 4220417948
		pgs[8] = 3709846822
		pgs[9] = 4251803233
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巨魔王_斧钺" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 4036925699
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xE3AE17C1
		pgs[12] = 0xE5A28F36
		pgs[15] = "audio/1115.mp3"
	elseif pg == "连珠神弓_杀破狼_普通" then
		pgs[1] = 3896611853
		pgs[2] = 3896611853
		pgs[3] = 2036432029
		pgs[4] = 2102929671
		pgs[6] = 3589969117
		pgs[7] = 3876338026
		pgs[8] = 1811002066
		pgs[9] = 1930889295
		pgs[10] = "战斗模型.wdf"
	elseif pg == "剑侠客_普通" then
		pgs[1] = 2840575336
		pgs[2] = 2840575336
		pgs[3] = 991657694
		pgs[4] = 3738000150
		pgs[6] = 2626634241
		pgs[7] = 1486978342
		pgs[8] = 512918654
		pgs[9] = 361988011
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金刺轮_飞燕女_普通" then
		pgs[1] = 3720262398
		pgs[2] = 3720262398
		pgs[3] = 1115289817
		pgs[4] = 2525078858
		pgs[6] = 827935432
		pgs[7] = 1403033620
		pgs[8] = 2466319363
		pgs[9] = 113367602
		pgs[10] = "战斗模型.wdf"
	elseif pg == "如意宝珠_巫蛮儿_普通" then
		pgs[1] = 3047110383
		pgs[2] = 3047110383
		pgs[3] = 2280873549
		pgs[4] = 2717151389
		pgs[6] = 3043609869
		pgs[7] = 3638266331
		pgs[8] = 2356120530
		pgs[9] = 62625934
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狼牙刀_剑侠客_普通" then
		pgs[1] = 914160701
		pgs[2] = 914160701
		pgs[3] = 790662160
		pgs[4] = 4033879125
		pgs[6] = 2718755916
		pgs[7] = 310154266
		pgs[8] = 2495162598
		pgs[9] = 2607187114
		pgs[10] = "战斗模型.wdf"
	elseif pg == "满天星_玄彩娥_普通" then
		pgs[1] = 3100078257
		pgs[2] = 3100078257
		pgs[3] = 677178981
		pgs[4] = 4188799764
		pgs[6] = 2373806356
		pgs[7] = 123928187
		pgs[8] = 2280722867
		pgs[9] = 591449018
		pgs[10] = "战斗模型.wdf"
	elseif pg == "赤焰双剑_英女侠_普通" then
		pgs[1] = 4168647024
		pgs[2] = 4168647024
		pgs[3] = 3572817351
		pgs[4] = 712581498
		pgs[6] = 2658138658
		pgs[7] = 2764921579
		pgs[8] = 2741994479
		pgs[9] = 4235932064
		pgs[10] = "战斗模型.wdf"
	elseif pg == "英女侠_鞭" then
		pgs[1] = 1083652265
		pgs[2] = 1083652265
		pgs[3] = 550776032
		pgs[4] = 1830207536
		pgs[6] = 487493048
		pgs[7] = 4015503046
		pgs[8] = 3420727052
		pgs[9] = 2264625814
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x2F78067E
		pgs[12] = 0xA241EAB1
		pgs[15] = "audio/1115.mp3"
	elseif pg == "黄铜圈_舞天姬_普通" then
		pgs[1] = 1246340040
		pgs[2] = 1246340040
		pgs[3] = 1695349470
		pgs[4] = 2991787754
		pgs[6] = 1524014588
		pgs[7] = 4075994022
		pgs[8] = 504842185
		pgs[9] = 1374023375
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金背大砍刀_巨魔王_普通" then
		pgs[1] = 2076710374
		pgs[2] = 2076710374
		pgs[3] = 1462666995
		pgs[4] = 1595258466
		pgs[6] = 3808390705
		pgs[7] = 3112271650
		pgs[8] = 1162958128
		pgs[9] = 3317931600
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巫蛮儿_宝珠" then
		pgs[1] = 724036542
		pgs[2] = 724036542
		pgs[3] = 857427883
		pgs[4] = 1487210709
		pgs[6] = 2600092653
		pgs[7] = 4235120544
		pgs[8] = 3377965731
		pgs[9] = 170880794
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xECFD4A73
		pgs[12] = 0x175B63C0
		pgs[15] = "audio/1115.mp3"
	elseif pg == "英女侠_普通" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[10] = "战斗模型.wdf"
	elseif pg == "五色缎带_玄彩娥_普通" then
		pgs[1] = 986673291
		pgs[2] = 986673291
		pgs[3] = 2847084631
		pgs[4] = 1814531001
		pgs[6] = 2478192000
		pgs[7] = 3703252301
		pgs[8] = 3541518516
		pgs[9] = 3812334075
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙太子_枪矛" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 1284179344
		pgs[9] = 1173564955
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xD84C88CC
		pgs[12] = 0x3563D35F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "金刺轮_舞天姬_普通" then
		pgs[1] = 3926831021
		pgs[2] = 3926831021
		pgs[3] = 1774309751
		pgs[4] = 2501160049
		pgs[6] = 2255887722
		pgs[7] = 173996820
		pgs[8] = 4154265461
		pgs[9] = 3161036338
		pgs[10] = "战斗模型.wdf"
	elseif pg == "红缨枪_龙太子_普通" then
		pgs[1] = 4208641994
		pgs[2] = 4208641994
		pgs[3] = 3367459571
		pgs[4] = 4155725796
		pgs[6] = 170841557
		pgs[7] = 2694226760
		pgs[8] = 1612726780
		pgs[9] = 1217969354
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巫蛮儿_法杖" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x440A2BC5
		pgs[12] = 0xA2E7AFCF
		pgs[15] = "audio/1115.mp3"

	elseif pg == "乌金三叉戟_龙太子_普通" then
		pgs[1] = 2664793060
		pgs[2] = 2664793060
		pgs[3] = 1779222969
		pgs[4] = 1212846725
		pgs[6] = 3544733296
		pgs[7] = 2097787361
		pgs[8] = 2856910184
		pgs[9] = 2573475492
		pgs[10] = "战斗模型.wdf"
	elseif pg == "柳叶刀_巨魔王_普通" then
		pgs[1] = 3522958092
		pgs[2] = 3522958092
		pgs[3] = 2519475388
		pgs[4] = 3788202981
		pgs[6] = 333884425
		pgs[7] = 3427345453
		pgs[8] = 1323639728
		pgs[9] = 4266255286
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青刚刺_骨精灵_普通" then
		pgs[1] = 3075032207
		pgs[2] = 3075032207
		pgs[3] = 4256318239
		pgs[4] = 3075032207
		pgs[6] = 1414239405
		pgs[7] = 1414239405
		pgs[8] = 2053717070
		pgs[9] = 2785457115
		pgs[10] = "战斗模型.wdf"
	elseif pg == "羽灵神_普通" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "战斗模型.wdf"
	elseif pg == "琉璃珠_杀破狼_普通" then
		pgs[1] = 1347542308
		pgs[2] = 1347542308
		pgs[3] = 1084648267
		pgs[4] = 2598475041
		pgs[6] = 220293482
		pgs[7] = 309382841
		pgs[8] = 3237534358
		pgs[9] = 4248308764
		pgs[10] = "战斗模型.wdf"
	elseif pg == "虎头怪_锤" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 3845828864
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 3836622392
		pgs[9] = 4274012337
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x92CB1DC9
		pgs[12] = 0x1C55C59F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "五色缎带_舞天姬_普通" then
		pgs[1] = 13536912
		pgs[2] = 13536912
		pgs[3] = 3018065077
		pgs[4] = 4096686404
		pgs[6] = 2509295261
		pgs[7] = 3306367653
		pgs[8] = 4257026415
		pgs[9] = 213886082
		pgs[10] = "战斗模型.wdf"
	elseif pg == "逍遥生_扇" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 2305122459
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[10] = "战斗模型.wdf"
        pgs[11] = 0x797993B0
		pgs[12] = 0x0193E046
		pgs[15] = "audio/1115.mp3"
	elseif pg == "舞天姬_飘带" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 365985475
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x35264F52
		pgs[12] = 0xA2E7AFCF
		pgs[15] = "audio/1115.mp3"
	elseif pg == "赤焰双剑_飞燕女_普通" then
		pgs[1] = 1548996612
		pgs[2] = 1548996612
		pgs[3] = 2446905048
		pgs[4] = 3742981382
		pgs[6] = 2519910999
		pgs[7] = 313011222
		pgs[8] = 3245654395
		pgs[9] = 2878513884
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青锋剑_剑侠客_普通" then
		pgs[1] = 128739684
		pgs[2] = 128739684
		pgs[3] = 1360269025
		pgs[4] = 1259586579
		pgs[6] = 3155607107
		pgs[7] = 3585789919
		pgs[8] = 548399706
		pgs[9] = 3149578823
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狼牙锤_神天兵_普通" then
		pgs[1] = 103920893
		pgs[2] = 103920893
		pgs[3] = 3337098745
		pgs[4] = 1754275390
		pgs[6] = 1598161855
		pgs[7] = 4165662626
		pgs[8] = 3269185703
		pgs[9] = 685627288
		pgs[10] = "战斗模型.wdf"
	elseif pg == "宝雕长弓_杀破狼_普通" then
		pgs[1] = 3187707461
		pgs[2] = 3187707461
		pgs[3] = 3770288341
		pgs[4] = 2752043077
		pgs[6] = 2434290964
		pgs[7] = 3329145004
		pgs[8] = 1745722591
		pgs[9] = 9444076
		pgs[10] = "战斗模型.wdf"
	elseif pg == "宝雕长弓_羽灵神_普通" then
		pgs[1] = 4253393401
		pgs[2] = 4253393401
		pgs[3] = 1615127028
		pgs[4] = 3401409995
		pgs[6] = 2163483216
		pgs[7] = 2874238993
		pgs[8] = 290712464
		pgs[9] = 412551822
		pgs[10] = "战斗模型.wdf"
	elseif pg == "硬木弓_杀破狼_普通" then
		pgs[1] = 3001778802
		pgs[2] = 3001778802
		pgs[3] = 2629114281
		pgs[4] = 370350902
		pgs[6] = 3945843828
		pgs[7] = 297727953
		pgs[8] = 1273865503
		pgs[9] = 1767508772
		pgs[10] = "战斗模型.wdf"
	elseif pg == "硬木弓_羽灵神_普通" then
		pgs[1] = 150635600
		pgs[2] = 150635600
		pgs[3] = 1149486021
		pgs[4] = 1352870002
		pgs[6] = 3031812840
		pgs[7] = 2982615098
		pgs[8] = 3723589923
		pgs[9] = 1534728987
		pgs[10] = "战斗模型.wdf"
	elseif pg == "墨铁拐_巫蛮儿_普通" then
		pgs[1] = 333733022
		pgs[2] = 333733022
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3200804307
		pgs[7] = 2976979233
		pgs[8] = 160002331
		pgs[9] = 1565301941
		pgs[10] = "战斗模型.wdf"
	elseif pg == "乌金鬼头镰_巨魔王_普通" then
		pgs[1] = 208276143
		pgs[2] = 208276143
		pgs[3] = 3914981211
		pgs[4] = 1471811059
		pgs[6] = 1976211634
		pgs[7] = 153091850
		pgs[8] = 3647700056
		pgs[9] = 4019257677
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巨魔王_刀" then
		pgs[1] = 1518169819
		pgs[2] = 1518169819
		pgs[3] = 2951893280
		pgs[4] = 533876880
		pgs[6] = 747524185
		pgs[7] = 594523269
		pgs[8] = 3417945932
		pgs[9] = 2896805672
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x826228C1
		pgs[12] = 0x2A172A4B
		pgs[15] = "audio/1115.mp3"
	elseif pg == "柳叶刀_剑侠客_普通" then
		pgs[1] = 2309692066
		pgs[2] = 2309692066
		pgs[3] = 4083786274
		pgs[4] = 1649684398
		pgs[6] = 3909215663
		pgs[7] = 1820668649
		pgs[8] = 1323639728
		pgs[9] = 3231555815
		pgs[10] = "战斗模型.wdf"
	elseif pg == "英女侠_双短剑" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xBAD926DB
		pgs[12] = 0xA241EAB1
		pgs[15] = "audio/1115.mp3"
	elseif pg == "蛇形月_舞天姬_普通" then
		pgs[1] = 3668441645
		pgs[2] = 3668441645
		pgs[3] = 1423059990
		pgs[4] = 9780356
		pgs[6] = 2142449311
		pgs[7] = 2142449311
		pgs[8] = 4149929342
		pgs[9] = 712091462
		pgs[10] = "战斗模型.wdf"
	elseif pg == "钢结鞭_英女侠_普通" then
		pgs[1] = 271263789
		pgs[2] = 271263789
		pgs[3] = 1861510591
		pgs[4] = 1546457330
		pgs[6] = 2479743000
		pgs[7] = 95594363
		pgs[8] = 2418442398
		pgs[9] = 1501213311
		pgs[10] = "战斗模型.wdf"
	elseif pg == "牛皮鞭_狐美人_普通" then
		pgs[1] = 803587567
		pgs[2] = 803587567
		pgs[3] = 2928593272
		pgs[4] = 3180100501
		pgs[6] = 3201126946
		pgs[7] = 3347553641
		pgs[8] = 435101418
		pgs[9] = 2721039077
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青铜斧_巨魔王_普通" then
		pgs[1] = 182516681
		pgs[2] = 182516681
		pgs[3] = 433361276
		pgs[4] = 3396040890
		pgs[6] = 3108223122
		pgs[7] = 1776525498
		pgs[8] = 3618533458
		pgs[9] = 2670573290
		pgs[10] = "战斗模型.wdf"
	elseif pg == "点金棒_玄彩娥_普通" then
		pgs[1] = 321961419
		pgs[2] = 321961419
		pgs[3] = 1825339978
		pgs[4] = 2854164977
		pgs[6] = 1309940385
		pgs[7] = 3400892076
		pgs[8] = 3042819558
		pgs[9] = 499124570
		pgs[10] = "战斗模型.wdf"
	elseif pg == "剑侠客_刀" then
		pgs[1] = 3074477781
		pgs[2] = 3074477781
		pgs[3] = 991657694
		pgs[4] = 2583942498
		pgs[6] = 1121741199
		pgs[7] = 701848281
		pgs[8] = 621175708
		pgs[9] = 2285822938
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xE3AE17C1
		pgs[12] = 0x1C55C59F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "细木棒_玄彩娥_普通" then
		pgs[1] = 2705175188
		pgs[2] = 2705175188
		pgs[3] = 4202680960
		pgs[4] = 3228448399
		pgs[6] = 436522649
		pgs[7] = 2039230457
		pgs[8] = 1506278188
		pgs[9] = 375356336
		pgs[10] = "战斗模型.wdf"
	elseif pg == "剑侠客_剑" then
		pgs[1] = 2840575336
		pgs[2] = 2840575336
		pgs[3] = 991657694
		pgs[4] = 3738000150
		pgs[6] = 2626634241
		pgs[7] = 1486978342
		pgs[8] = 512918654
		pgs[9] = 361988011
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x846F1074
		pgs[12] = 0x846F1074
		pgs[15] = "audio/1115.mp3"
	elseif pg == "玄彩娥_飘带" then
		pgs[1] = 4201959108
		pgs[2] = 4201959108
		pgs[3] = 3290427143
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 1617545683
		pgs[8] = 339045070
		pgs[9] = 2545689750
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x3CD82541
		pgs[12] = 0x60D01153
		pgs[15] = "audio/1115.mp3"
	elseif pg == "震天锤_神天兵_普通" then
		pgs[1] = 3035485426
		pgs[2] = 3035485426
		pgs[3] = 1437571424
		pgs[4] = 3129123356
		pgs[6] = 3250445538
		pgs[7] = 4112972849
		pgs[8] = 4145837202
		pgs[9] = 4145837202
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青锋剑_逍遥生_普通" then
		pgs[1] = 2028105319
		pgs[2] = 2028105319
		pgs[3] = 3791928171
		pgs[4] = 2088494889
		pgs[6] = 91578554
		pgs[7] = 518706841
		pgs[8] = 3909235980
		pgs[9] = 526326278
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青龙牙_狐美人_普通" then
		pgs[1] = 3328063850
		pgs[2] = 3328063850
		pgs[3] = 3138195936
		pgs[4] = 1207144244
		pgs[6] = 620017539
		pgs[7] = 1100137434
		pgs[8] = 957732521
		pgs[9] = 702824336
		pgs[10] = "战斗模型.wdf"
	elseif pg == "神天兵_普通" then
		pgs[1] = 3139413485
		pgs[2] = 3139413485
		pgs[3] = 3251213113
		pgs[4] = 1857394109
		pgs[6] = 1539170847
		pgs[7] = 1525915374
		pgs[8] = 2489545420
		pgs[9] = 2207457325
		pgs[10] = "战斗模型.wdf"
	elseif pg == "八卦_神天兵_普通" then
		pgs[1] = 0x94265799
		pgs[2] = 0x94265799
		pgs[3] = 0x35A8F0B2
		pgs[4] = 0xF721C3A5
		pgs[6] = 0x82407177
		pgs[7] = 0x14046CB9
		pgs[8] = 0x793550FC
		pgs[9] = 0x66D1B6C4
		pgs[10] = "战斗模型.wdf"
	elseif pg == "八卦_虎头怪_普通" then
		pgs[1] = 0xF4E93C19
		pgs[2] = 0xF4E93C19
		pgs[3] = 0xDAA88DDF
		pgs[4] = 0xDCA25DA6
		pgs[6] = 0x9EB4376A
		pgs[7] = 0x257EEB28
		pgs[8] = 0x6AD54C39
		pgs[9] = 0xBF887095
		pgs[10] = "战斗模型.wdf"
	elseif pg == "神天兵_锤" then
		pgs[1] = 1465303491
		pgs[2] = 1465303491
		pgs[3] = 1649555822
		pgs[4] = 2910864082
		pgs[6] = 3107944047
		pgs[7] = 2714401860
		pgs[8] = 2489545420
		pgs[9] = 2796680623
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xC7B92924
		pgs[12] = 0x3C1EC801
		pgs[15] = "audio/1115.mp3"
	elseif pg == "松木锤_虎头怪_普通" then
		pgs[1] = 3954765830
		pgs[2] = 3954765830
		pgs[3] = 1463806219
		pgs[4] = 4224177154
		pgs[6] = 78625091
		pgs[7] = 2652829739
		pgs[8] = 2214494438
		pgs[9] = 1060924399
		pgs[10] = "战斗模型.wdf"
	elseif pg == "骨精灵_普通" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "战斗模型.wdf"
	elseif pg == "骨精灵_魔棒" then
		pgs[1] = 2452516043
		pgs[2] = 2452516043
		pgs[3] = 1899323518
		pgs[4] = 3477875588
		pgs[6] = 1063711236
		pgs[7] = 3657445131
		pgs[8] = 2024668974
		pgs[9] = 3508788176
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x4FDFFA0C
		pgs[12] = 0xB402D438
		pgs[15] = "audio/1115.mp3"
	elseif pg == "曲柳杖_羽灵神_普通" then
		pgs[1] = 177392781
		pgs[2] = 177392781
		pgs[3] = 126506799
		pgs[4] = 2086224634
		pgs[6] = 2070674478
		pgs[7] = 2841942625
		pgs[8] = 1310664391
		pgs[9] = 945248214
		pgs[10] = "战斗模型.wdf"
	elseif pg == "铁面扇_逍遥生_普通" then
		pgs[1] = 265930064
		pgs[2] = 265930064
		pgs[3] = 1315781189
		pgs[4] = 851934430
		pgs[6] = 3398365059
		pgs[7] = 1327574185
		pgs[8] = 3720853183
		pgs[9] = 2140890725
		pgs[10] = "战斗模型.wdf"
	elseif pg == "舞天姬_环圈" then
		pgs[1] = 4193428466
		pgs[2] = 4193428466
		pgs[3] = 3043244041
		pgs[4] = 2814262767
		pgs[6] = 4189229797
		pgs[7] = 3277294463
		pgs[8] = 3942685609
		pgs[9] = 610824997
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xE0FBFAC1
		pgs[12] = 0x3AE4C1C0
		pgs[15] = "audio/1115.mp3"
	elseif pg == "神火扇_逍遥生_普通" then
		pgs[1] = 809466984
		pgs[2] = 809466984
		pgs[3] = 3900102624
		pgs[4] = 1484450534
		pgs[6] = 1946292417
		pgs[7] = 2773394627
		pgs[8] = 3033319609
		pgs[9] = 815459690
		pgs[10] = "战斗模型.wdf"
	elseif pg == "铁爪_狐美人_普通" then
		pgs[1] = 1341071015
		pgs[2] = 1341071015
		pgs[3] = 2333330309
		pgs[4] = 2453642175
		pgs[6] = 1760107365
		pgs[7] = 4127315635
		pgs[8] = 2476805398
		pgs[9] = 2928915082
		pgs[10] = "战斗模型.wdf"
	elseif pg == "满天星_骨精灵_普通" then
		pgs[1] = 3437083756
		pgs[2] = 3437083756
		pgs[3] = 2306843235
		pgs[4] = 1714484126
		pgs[6] = 373133398
		pgs[7] = 3805394703
		pgs[8] = 1606121584
		pgs[9] = 1531375263
		pgs[10] = "战斗模型.wdf"
	elseif pg == "游龙剑_逍遥生_普通" then
		pgs[1] = 2298557178
		pgs[2] = 2298557178
		pgs[3] = 923259950
		pgs[4] = 145374235
		pgs[6] = 4267993677
		pgs[7] = 3641474775
		pgs[8] = 345371692
		pgs[9] = 551366747
		pgs[10] = "战斗模型.wdf"
	elseif pg == "巫蛮儿_普通" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "战斗模型.wdf"
	elseif pg == "红缨枪_神天兵_普通" then
		pgs[1] = 3072500196
		pgs[2] = 3072500196
		pgs[3] = 1936650700
		pgs[4] = 522874091
		pgs[6] = 72270422
		pgs[7] = 2966336322
		pgs[8] = 117062963
		pgs[9] = 3637390492
		pgs[10] = "战斗模型.wdf"
	elseif pg == "铁面扇_龙太子_普通" then
		pgs[1] = 1892693347
		pgs[2] = 1892693347
		pgs[3] = 3257923907
		pgs[4] = 1204995981
		pgs[6] = 1362359639
		pgs[7] = 2228831626
		pgs[8] = 3633790550
		pgs[9] = 80506382
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狐美人_鞭" then
		pgs[1] = 1138804365
		pgs[2] = 1138804365
		pgs[3] = 247333098
		pgs[4] = 303785981
		pgs[6] = 1734212905
		pgs[7] = 3749438
		pgs[8] = 4126393258
		pgs[9] = 3502426669
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x2F78067E
		pgs[12] = 0xA241EAB1
		pgs[15] = "audio/1115.mp3"
	elseif pg == "乌金鬼头镰_虎头怪_普通" then
		pgs[1] = 3466710001
		pgs[2] = 3466710001
		pgs[3] = 2029741881
		pgs[4] = 3433763427
		pgs[6] = 752010966
		pgs[7] = 2871143747
		pgs[8] = 1261420343
		pgs[9] = 2046811187
		pgs[10] = "战斗模型.wdf"
	elseif pg == "神天兵_枪矛" then
		pgs[1] = 3139413485
		pgs[2] = 3139413485
		pgs[3] = 3251213113
		pgs[4] = 1857394109
		pgs[6] = 1539170847
		pgs[7] = 1525915374
		pgs[8] = 2489545420
		pgs[9] = 2207457325
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x36284398
		pgs[12] = 0x32170257
		pgs[15] = "audio/1115.mp3"
	elseif pg == "震天锤_虎头怪_普通" then
		pgs[1] = 910543157
		pgs[2] = 910543157
		pgs[3] = 396098490
		pgs[4] = 51606250
		pgs[6] = 647794191
		pgs[7] = 1034863730
		pgs[8] = 34149923
		pgs[9] = 2195214010
		pgs[10] = "战斗模型.wdf"
	elseif pg == "七彩罗刹_舞天姬_普通" then
		pgs[1] = 1449553165
		pgs[2] = 1449553165
		pgs[3] = 2145124847
		pgs[4] = 4157162296
		pgs[6] = 1859257571
		pgs[7] = 2698141768
		pgs[8] = 2971905394
		pgs[9] = 2020209393
		pgs[10] = "战斗模型.wdf"
	elseif pg == "松木锤_神天兵_普通" then
		pgs[1] = 4014115127
		pgs[2] = 4014115127
		pgs[3] = 433361276
		pgs[4] = 2686623681
		pgs[6] = 316202605
		pgs[7] = 776522968
		pgs[8] = 400987167
		pgs[9] = 3257370843
		pgs[10] = "战斗模型.wdf"
	elseif pg == "杀破狼_弓弩" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x846F1074
		pgs[12] = 0x1C55C59F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "杀破狼_弓弩1" then
		pgs[1] = 3555676410
		pgs[2] = 3555676410
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 0167917977
		pgs[7] = 2697172445
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x846F1074
		pgs[12] = 0x1C55C59F
		pgs[15] = "audio/1115.mp3"
	elseif pg == "曲柳杖_巫蛮儿_普通" then
		pgs[1] = 3570910020
		pgs[2] = 3570910020
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3312479705
		pgs[7] = 429861263
		pgs[8] = 3316485994
		pgs[9] = 1090261872
		pgs[10] = "战斗模型.wdf"
	elseif pg == "虎头怪_普通" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 3845828864
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 2089007572
		pgs[9] = 4274012337
		pgs[10] = "战斗模型.wdf"
	-- v1.3
	-- 武器新增
	elseif pg == "飞龙在天_神天兵_普通" then
		pgs[1] = 2032927311
		pgs[2] = 2032927311
		pgs[3] = 1657151508
		pgs[4] = 3978455792
		pgs[6] = 1874013939
		pgs[7] = 3740325538
		pgs[8] = 2181635146
		pgs[9] = 599728780
		pgs[10] = "战斗模型.wdf"
	elseif pg == "天龙破城_神天兵_普通" then
		pgs[1] = 0171966452
		pgs[2] = 0171966452
		pgs[3] = 2084794125
		pgs[4] = 2107979991
		pgs[6] = 1581914867
		pgs[7] = 2942548432
		pgs[8] = 1411813089
		pgs[9] = 1849607449
		pgs[10] = "战斗模型.wdf"
	elseif pg == "弑皇_神天兵_普通" then
		pgs[1] = 1997962163
		pgs[2] = 1997962163
		pgs[3] = 0736116348
		pgs[4] = 1627526221
		pgs[6] = 0244362789
		pgs[7] = 0451837867
		pgs[8] = 3255465889
		pgs[9] = 1104681624
		pgs[10] = "战斗模型.wdf"
	elseif pg == "肃魂_虎头怪_普通" then
		pgs[1] = 3347502793
		pgs[2] = 3347502793
		pgs[3] = 3860676924
		pgs[4] = 118700546
		pgs[6] = 2438511946
		pgs[7] = 654574910
		pgs[8] = 2443863215
		pgs[9] = 3044188142
		pgs[10] = "战斗模型.wdf"
	elseif pg == "无敌_虎头怪_普通" then
		pgs[1] = 3570280462
		pgs[2] = 3570280462
		pgs[3] = 4153716432
		pgs[4] = 4066794943
		pgs[6] = 2962716394
		pgs[7] = 2728193647
		pgs[8] = 1018712733
		pgs[9] = 3542032877
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雪蚕之刺_骨精灵_普通" then
		pgs[1] = 463147476
		pgs[2] = 463147476
		pgs[3] = 156477563
		pgs[4] = 2554614685
		pgs[6] = 1016195647
		pgs[7] = 1685978750
		pgs[8] = 882510520
		pgs[9] = 3100053953
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雷神_虎头怪_普通" then
		pgs[1] = 3666407377
		pgs[2] = 3666407377
		pgs[3] = 465270733
		pgs[4] = 2173835439
		pgs[6] = 1254874348
		pgs[7] = 2506000487
		pgs[8] = 3727411622
		pgs[9] = 2103867801
		pgs[10] = "战斗模型.wdf"
	elseif pg == "灵蛇_英女侠_普通" then
		pgs[1] = 3036397933
		pgs[2] = 3036397933
		pgs[3] = 109615900
		pgs[4] = 2747926100
		pgs[6] = 2286194550
		pgs[7] = 2559098069
		pgs[8] = 227111990
		pgs[9] = 2520581903
		pgs[10] = "战斗模型.wdf"
	elseif pg == "冥火薄天_羽灵神_普通" then
		pgs[1] = 2410653859
		pgs[2] = 2410653859
		pgs[3] = 412668278
		pgs[4] = 411982136
		pgs[6] = 2414080025
		pgs[7] = 3270399877
		pgs[8] = 1113080394
		pgs[9] = 2526125934
		pgs[10] = "战斗模型.wdf"
	elseif pg == "晓风残月_巨魔王_普通" then
		pgs[1] = 684541206
		pgs[2] = 684541206
		pgs[3] = 575760044
		pgs[4] = 2922449802
		pgs[6] = 578321277
		pgs[7] = 1145919811
		pgs[8] = 1959824975
		pgs[9] = 2531067724
		pgs[10] = "战斗模型.wdf"
	elseif pg == "斩妖泣血_剑侠客_普通" then
		pgs[1] = 3366877163
		pgs[2] = 3366877163
		pgs[3] = 2527757700
		pgs[4] = 423606103
		pgs[6] = 2965089172
		pgs[7] = 3694647351
		pgs[8] = 223797192
		pgs[9] = 902186530
		pgs[10] = "战斗模型.wdf"
	elseif pg == "业火三灾_剑侠客_普通" then
		pgs[1] = 0210215203
		pgs[2] = 0210215203
		pgs[3] = 0742329354
		pgs[4] = 4144128188
		pgs[6] = 3922982597
		pgs[7] = 3358965260
		pgs[8] = 2322529890
		pgs[9] = 2370381803
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鸣鸿_剑侠客_普通" then
		pgs[1] = 1301462828
		pgs[2] = 1301462828
		pgs[3] = 0874331809
		pgs[4] = 1002416013
		pgs[6] = 0119572952
		pgs[7] = 2800523884
		pgs[8] = 4144463970
		pgs[9] = 3391554113
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九瓣莲花_虎头怪_普通" then
		pgs[1] = 4211862022
		pgs[2] = 4211862022
		pgs[3] = 3700497436
		pgs[4] = 2579634951
		pgs[6] = 3976648204
		pgs[7] = 2765994764
		pgs[8] = 3401808842
		pgs[9] = 4094340569
		pgs[10] = "战斗模型.wdf"
	elseif pg == "暗夜_龙太子_普通" then
		pgs[1] = 741288949
		pgs[2] = 741288949
		pgs[3] = 1972123841
		pgs[4] = 2182082171
		pgs[6] = 4066915831
		pgs[7] = 1492298468
		pgs[8] = 3678212997
		pgs[9] = 1751076384
		pgs[10] = "战斗模型.wdf"
	elseif pg == "祖龙对剑_飞燕女_普通" then
		pgs[1] = 985733706
		pgs[2] = 985733706
		pgs[3] = 3613383230
		pgs[4] = 1544369507
		pgs[6] = 3553066663
		pgs[7] = 4238979964
		pgs[8] = 2190872843
		pgs[9] = 2053572839
		pgs[10] = "战斗模型.wdf"
	elseif pg == "紫电青霜_飞燕女_普通" then
		pgs[1] = 1709377296
		pgs[2] = 1709377296
		pgs[3] = 0883367126
		pgs[4] = 2079837773
		pgs[6] = 2835812814
		pgs[7] = 1289475462
		pgs[8] = 1892940716
		pgs[9] = 1899538113
		pgs[10] = "战斗模型.wdf"
	elseif pg == "浮犀_飞燕女_普通" then
		pgs[1] = 1474639442
		pgs[2] = 1474639442
		pgs[3] = 3471018206
		pgs[4] = 2084990754
		pgs[6] = 2071526304
		pgs[7] = 1695237386
		pgs[8] = 2750824335
		pgs[9] = 0969736831
		pgs[10] = "战斗模型.wdf"
	elseif pg == "秋水人家_龙太子_普通" then
		pgs[1] = 3391613661
		pgs[2] = 3391613661
		pgs[3] = 1065383079
		pgs[4] = 2120876772
		pgs[6] = 2647082872
		pgs[7] = 1201013296
		pgs[8] = 1941233906
		pgs[9] = 817870297
		pgs[10] = "战斗模型.wdf"
	elseif pg == "红莲_玄彩娥_普通" then
		pgs[1] = 3643377339
		pgs[2] = 3643377339
		pgs[3] = 476128501
		pgs[4] = 3322875805
		pgs[6] = 1450950143
		pgs[7] = 1405056236
		pgs[8] = 477554400
		pgs[9] = 1296371001
		pgs[10] = "战斗模型.wdf"
	elseif pg == "裂云啸日_杀破狼_普通" then
		pgs[1] = 1323042371
		pgs[2] = 1323042371
		pgs[3] = 2471306192
		pgs[4] = 2206427343
		pgs[6] = 3359417010
		pgs[7] = 3912741797
		pgs[8] = 753797811
		pgs[9] = 656525376
		pgs[10] = "战斗模型.wdf"
	elseif pg == "云雷万里_杀破狼_普通" then
		pgs[1] = 0929693147
		pgs[2] = 0929693147
		pgs[3] = 2339783982
		pgs[4] = 2673184399
		pgs[6] = 1053032888
		pgs[7] = 1343023772
		pgs[8] = 1593490105
		pgs[9] = 0305349853
		pgs[10] = "战斗模型.wdf"
	elseif pg == "赤明_杀破狼_普通" then
		pgs[1] = 0454754499
		pgs[2] = 0454754499
		pgs[3] = 4014535055
		pgs[4] = 1847890126
		pgs[6] = 0039518222
		pgs[7] = 2065247607
		pgs[8] = 1441775582
		pgs[9] = 0138471714
		pgs[10] = "战斗模型.wdf"
	elseif pg == "元神禁锢_巨魔王_普通" then
		pgs[1] = 1611966521
		pgs[2] = 1611966521
		pgs[3] = 2319213890
		pgs[4] = 3825599050
		pgs[6] = 2980430167
		pgs[7] = 2239466708
		pgs[8] = 1421663600
		pgs[9] = 2749153529
		pgs[10] = "战斗模型.wdf"
	elseif pg == "胭脂_狐美人_普通" then
		pgs[1] = 435255964
		pgs[2] = 435255964
		pgs[3] = 2314371856
		pgs[4] = 3864765510
		pgs[6] = 505158205
		pgs[7] = 1747354624
		pgs[8] = 1199574166
		pgs[9] = 954931940
		pgs[10] = "战斗模型.wdf"
	elseif pg == "刑天之逆_龙太子_普通" then
		pgs[1] = 1200609263
		pgs[2] = 1200609263
		pgs[3] = 2005252098
		pgs[4] = 3509150743
		pgs[6] = 3445110785
		pgs[7] = 951231487
		pgs[8] = 220558504
		pgs[9] = 4062233204
		pgs[10] = "战斗模型.wdf"
	elseif pg == "霹雳_龙太子_普通" then
		pgs[1] = 278992607
		pgs[2] = 278992607
		pgs[3] = 1512127783
		pgs[4] = 3642679990
		pgs[6] = 1313071015
		pgs[7] = 3971560979
		pgs[8] = 2173299537
		pgs[9] = 4060439247
		pgs[10] = "战斗模型.wdf"
	elseif pg == "沧海_玄彩娥_普通" then
		pgs[1] = 3065680078
		pgs[2] = 3065680078
		pgs[3] = 504261236
		pgs[4] = 60075072
		pgs[6] = 3170504444
		pgs[7] = 3448269542
		pgs[8] = 1357669355
		pgs[9] = 3608953515
		pgs[10] = "战斗模型.wdf"
	elseif pg == "贵霜之牙_狐美人_普通" then
		pgs[1] = 2026448705
		pgs[2] = 2026448705
		pgs[3] = 741309234
		pgs[4] = 3203975285
		pgs[6] = 1564840489
		pgs[7] = 474679658
		pgs[8] = 4058539230
		pgs[9] = 926627376
		pgs[10] = "战斗模型.wdf"
	elseif pg == "忘川三途_狐美人_普通" then
		pgs[1] = 0236232349
		pgs[2] = 0236232349
		pgs[3] = 1075219754
		pgs[4] = 1037429893
		pgs[6] = 2989801805
		pgs[7] = 1339124563
		pgs[8] = 3926929253
		pgs[9] = 3874185526
		pgs[10] = "战斗模型.wdf"
	elseif pg == "离钩_狐美人_普通" then
		pgs[1] = 0564401744
		pgs[2] = 0564401744
		pgs[3] = 1267356954
		pgs[4] = 2021299893
		pgs[6] = 3148444658
		pgs[7] = 3954561085
		pgs[8] = 4230441971
		pgs[9] = 1335188315
		pgs[10] = "战斗模型.wdf"
	elseif pg == "护法灭魔_巨魔王_普通" then
		pgs[1] = 1083493637
		pgs[2] = 1083493637
		pgs[3] = 812737125
		pgs[4] = 2551291495
		pgs[6] = 4082536262
		pgs[7] = 2847560160
		pgs[8] = 1955001763
		pgs[9] = 4262995164
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碧血干戚_巨魔王_普通" then
		pgs[1] = 0325617872
		pgs[2] = 0325617872
		pgs[3] = 2652356421
		pgs[4] = 1634024596
		pgs[6] = 2566297187
		pgs[7] = 1516430527
		pgs[8] = 1859893291
		pgs[9] = 1309789755
		pgs[10] = "战斗模型.wdf"
	elseif pg == "裂天_巨魔王_普通" then
		pgs[1] = 3770058550
		pgs[2] = 3770058550
		pgs[3] = 0606207925
		pgs[4] = 4223217027
		pgs[6] = 3564628022
		pgs[7] = 2046633309
		pgs[8] = 2119151502
		pgs[9] = 1758406529
		pgs[10] = "战斗模型.wdf"
	elseif pg == "裂云啸日_巫蛮儿_普通" then
		pgs[1] = 1953175087
		pgs[2] = 1953175087
		pgs[3] = 3696783624
		pgs[4] = 2606125215
		pgs[6] = 1758916755
		pgs[7] = 3089221190
		pgs[8] = 147933165
		pgs[9] = 3171772535
		pgs[10] = "战斗模型.wdf"
	elseif pg == "云雷万里_巫蛮儿_普通" then
		pgs[1] = 3496291125
		pgs[2] = 3496291125
		pgs[3] = 1465968075
		pgs[4] = 1397554648
		pgs[6] = 2459508456
		pgs[7] = 2516514287
		pgs[8] = 3589170230
		pgs[9] = 3317700918
		pgs[10] = "战斗模型.wdf"
	elseif pg == "赤明_巫蛮儿_普通" then
		pgs[1] = 0200658060
		pgs[2] = 0200658060
		pgs[3] = 3759594662
		pgs[4] = 3318654178
		pgs[6] = 4035253624
		pgs[7] = 2693415826
		pgs[8] = 2972224698
		pgs[9] = 3906907508
		pgs[10] = "战斗模型.wdf"
	elseif pg == "元神禁锢_虎头怪_普通" then
		pgs[1] = 345884366
		pgs[2] = 345884366
		pgs[3] = 1989535927
		pgs[4] = 3684415104
		pgs[6] = 3779343772
		pgs[7] = 1164144313
		pgs[8] = 2870850177
		pgs[9] = 1485270944
		pgs[10] = "战斗模型.wdf"
	elseif pg == "游龙惊鸿_英女侠_普通" then
		pgs[1] = 1724242915
		pgs[2] = 1724242915
		pgs[3] = 84894305
		pgs[4] = 1910956791
		pgs[6] = 4279024946
		pgs[7] = 4245988549
		pgs[8] = 204351801
		pgs[9] = 3689683150
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鬼王蚀日_神天兵_普通" then
		pgs[1] = 963362133
		pgs[2] = 963362133
		pgs[3] = 152105194
		pgs[4] = 3867741716
		pgs[6] = 1752393650
		pgs[7] = 278748353
		pgs[8] = 1749943111
		pgs[9] = 0xB1EC4BAE
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狂澜碎岳_神天兵_普通" then
		pgs[1] = 2235903565
		pgs[2] = 2235903565
		pgs[3] = 2603636370
		pgs[4] = 2603636370
		pgs[6] = 2176071785
		pgs[7] = 4182805395
		pgs[8] = 0485622618
		pgs[9] = 0725700904
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碎寂_神天兵_普通" then
		pgs[1] = 3625830153
		pgs[2] = 3625830153
		pgs[3] = 3568054291
		pgs[4] = 2897242392
		pgs[6] = 2339108953
		pgs[7] = 0520986973
		pgs[8] = 3030332360
		pgs[9] = 1269074276
		pgs[10] = "战斗模型.wdf"
	elseif pg == "画龙点睛_龙太子_普通" then
		pgs[1] = 479654062
		pgs[2] = 479654062
		pgs[3] = 2783759891
		pgs[4] = 2828288868
		pgs[6] = 2229841293
		pgs[7] = 235465927
		pgs[8] = 3332787791
		pgs[9] = 1018236421
		pgs[10] = "战斗模型.wdf"
	elseif pg == "紫金葫芦_巫蛮儿_普通" then
		pgs[1] = 2831632905
		pgs[2] = 2831632905
		pgs[3] = 3521304774
		pgs[4] = 3768453514
		pgs[6] = 2981305233
		pgs[7] = 2400756176
		pgs[8] = 1889441810
		pgs[9] = 2164075551
		pgs[10] = "战斗模型.wdf"
	elseif pg == "百花_英女侠旧_普通" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月光双剑_英女侠_普通" then
		pgs[1] = 2739970529
		pgs[2] = 2739970529
		pgs[3] = 1305035055
		pgs[4] = 908717950
		pgs[6] = 1760682539
		pgs[7] = 433987877
		pgs[8] = 2692136956
		pgs[9] = 3445935850
		pgs[10] = "战斗模型.wdf"
	elseif pg == "血刃_巨魔王_普通" then
		pgs[1] = 1939335498
		pgs[2] = 1939335498
		pgs[3] = 877636726
		pgs[4] = 916167152
		pgs[6] = 867523001
		pgs[7] = 3564043256
		pgs[8] = 776791724
		pgs[9] = 1515674466
		pgs[10] = "战斗模型.wdf"
	elseif pg == "此最相思_舞天姬_普通" then
		pgs[1] = 1976958564
		pgs[2] = 1976958564
		pgs[3] = 3060982721
		pgs[4] = 3902626006
		pgs[6] = 1239150663
		pgs[7] = 1817978990
		pgs[8] = 3578667390
		pgs[9] = 2374794875
		pgs[10] = "战斗模型.wdf"
	elseif pg == "揽月摘星_舞天姬_普通" then
		pgs[1] = 3095847005
		pgs[2] = 3095847005
		pgs[3] = 0328405538
		pgs[4] = 2694329428
		pgs[6] = 4179340991
		pgs[7] = 2099180209
		pgs[8] = 0795965688
		pgs[9] = 1691850913
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九霄_舞天姬_普通" then
		pgs[1] = 1709199725
		pgs[2] = 1709199725
		pgs[3] = 4183907044
		pgs[4] = 0940501812
		pgs[6] = 1332030559
		pgs[7] = 3784736116
		pgs[8] = 1618775589
		pgs[9] = 0895130345
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙鸣寒水_杀破狼_普通" then
		pgs[1] = 2135796424
		pgs[2] = 2135796424
		pgs[3] = 4117872420
		pgs[4] = 4105996895
		pgs[6] = 2127507146
		pgs[7] = 4261464327
		pgs[8] = 1514939238
		pgs[9] = 748425136
		pgs[10] = "战斗模型.wdf"
	elseif pg == "暗夜_神天兵_普通" then
		pgs[1] = 1082922820
		pgs[2] = 1082922820
		pgs[3] = 975258259
		pgs[4] = 3895199857
		pgs[6] = 1619820242
		pgs[7] = 3383885620
		pgs[8] = 336694600
		pgs[9] = 932923894
		pgs[10] = "战斗模型.wdf"
	elseif pg == "屠龙_巨魔王_普通" then
		pgs[1] = 1484416784
		pgs[2] = 1484416784
		pgs[3] = 1775621951
		pgs[4] = 1549828750
		pgs[6] = 3154364234
		pgs[7] = 993921470
		pgs[8] = 2220195117
		pgs[9] = 2747950696
		pgs[10] = "战斗模型.wdf"
	elseif pg == "离火_巫蛮儿_普通" then
		pgs[1] = 593251101
		pgs[2] = 593251101
		pgs[3] = 1674828781
		pgs[4] = 83754672
		pgs[6] = 3337153292
		pgs[7] = 341330281
		pgs[8] = 662302587
		pgs[9] = 1380161976
		pgs[10] = "战斗模型.wdf"
	elseif pg == "魏武青虹_剑侠客_普通" then
		pgs[1] = 3545119585
		pgs[2] = 3545119585
		pgs[3] = 157523664
		pgs[4] = 1783491444
		pgs[6] = 1488281366
		pgs[7] = 2951999449
		pgs[8] = 1776089940
		pgs[9] = 599864712
		pgs[10] = "战斗模型.wdf"
	elseif pg == "百花_狐美人_普通" then
		pgs[1] = 1502748093
		pgs[2] = 1502748093
		pgs[3] = 2250675787
		pgs[4] = 2755073465
		pgs[6] = 1990532858
		pgs[7] = 1787167953
		pgs[8] = 3161043606
		pgs[9] = 546759080
		pgs[10] = "战斗模型.wdf"
	elseif pg == "撕天_骨精灵_普通" then
		pgs[1] = 1763722445
		pgs[2] = 1763722445
		pgs[3] = 933726342
		pgs[4] = 974601076
		pgs[6] = 311571350
		pgs[7] = 482224323
		pgs[8] = 1316921786
		pgs[9] = 3581381656
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玉龙_逍遥生_普通" then
		pgs[1] = 291599680
		pgs[2] = 291599680
		pgs[3] = 715603823
		pgs[4] = 1026330223
		pgs[6] = 3159923026
		pgs[7] = 2920506479
		pgs[8] = 2112187507
		pgs[9] = 3163375922
		pgs[10] = "战斗模型.wdf"
	elseif pg == "红莲_骨精灵_普通" then
		pgs[1] = 3424827150
		pgs[2] = 3424827150
		pgs[3] = 934671466
		pgs[4] = 1076423299
		pgs[6] = 3574472708
		pgs[7] = 2280284843
		pgs[8] = 506056336
		pgs[9] = 2313738142
		pgs[10] = "战斗模型.wdf"
	elseif pg == "彩虹_舞天姬_普通" then
		pgs[1] = 3921702263
		pgs[2] = 3921702263
		pgs[3] = 3711439731
		pgs[4] = 261592524
		pgs[6] = 3826935762
		pgs[7] = 1461988918
		pgs[8] = 658865406
		pgs[9] = 2510075859
		pgs[10] = "战斗模型.wdf"
	elseif pg == "魏武青虹_逍遥生_普通" then
		pgs[1] = 2954647770
		pgs[2] = 2954647770
		pgs[3] = 1287899115
		pgs[4] = 3269954632
		pgs[6] = 2567725998
		pgs[7] = 2862658372
		pgs[8] = 4023660358
		pgs[9] = 1267402087
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雪蟒霜寒_巫蛮儿_普通" then
		pgs[1] = 739148944
		pgs[2] = 739148944
		pgs[3] = 1573479582
		pgs[4] = 1491739579
		pgs[6] = 851932811
		pgs[7] = 3605348497
		pgs[8] = 1658854000
		pgs[9] = 759781703
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碧海潮生_巫蛮儿_普通" then
		pgs[1] = 3910342400
		pgs[2] = 3910342400
		pgs[3] = 0733894543
		pgs[4] = 1050839754
		pgs[6] = 3505371915
		pgs[7] = 1647388270
		pgs[8] = 1832777753
		pgs[9] = 0844025414
		pgs[10] = "战斗模型.wdf"
	elseif pg == "弦月_巫蛮儿_普通" then
		pgs[1] = 3736877850
		pgs[2] = 3736877850
		pgs[3] = 3588393432
		pgs[4] = 2220097459
		pgs[6] = 0280199730
		pgs[7] = 3405371659
		pgs[8] = 2586240981
		pgs[9] = 0420838884
		pgs[10] = "战斗模型.wdf"
	elseif pg == "血刃_剑侠客_普通" then
		pgs[1] = 3942369185
		pgs[2] = 3942369185
		pgs[3] = 2744623122
		pgs[4] = 3558966261
		pgs[6] = 2535946630
		pgs[7] = 1477301268
		pgs[8] = 658806952
		pgs[9] = 3254342488
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碧波_玄彩娥_普通" then
		pgs[1] = 970441283
		pgs[2] = 970441283
		pgs[3] = 1029717118
		pgs[4] = 1436245505
		pgs[6] = 3228799230
		pgs[7] = 3957482085
		pgs[8] = 1916346891
		pgs[9] = 1521611307
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞星_巫蛮儿_普通" then
		pgs[1] = 902532881
		pgs[2] = 902532881
		pgs[3] = 1311875894
		pgs[4] = 1263683269
		pgs[6] = 4006180572
		pgs[7] = 941967075
		pgs[8] = 1752683572
		pgs[9] = 173425117
		pgs[10] = "战斗模型.wdf"
	elseif pg == "回风舞雪_巫蛮儿_普通" then
		pgs[1] = 1226070803
		pgs[2] = 1226070803
		pgs[3] = 3590109632
		pgs[4] = 3593543610
		pgs[6] = 3882426852
		pgs[7] = 136839080
		pgs[8] = 1265716525
		pgs[9] = 126040992
		pgs[10] = "战斗模型.wdf"
	elseif pg == "五虎断魂_龙太子_普通" then
		pgs[1] = 1272648373
		pgs[2] = 1272648373
		pgs[3] = 1067074679
		pgs[4] = 1592032597
		pgs[6] = 2132267301
		pgs[7] = 4089962192
		pgs[8] = 1673526656
		pgs[9] = 2635610460
		pgs[10] = "战斗模型.wdf"
	elseif pg == "祖龙对剑_英女侠_普通" then
		pgs[1] = 371522347
		pgs[2] = 371522347
		pgs[3] = 1072281713
		pgs[4] = 3068921098
		pgs[6] = 3389582086
		pgs[7] = 388288592
		pgs[8] = 640740376
		pgs[9] = 3752665492
		pgs[10] = "战斗模型.wdf"
	elseif pg == "紫电青霜_英女侠_普通" then
		pgs[1] = 2940261156
		pgs[2] = 2940261156
		pgs[3] = 0883367126
		pgs[4] = 1476632389
		pgs[6] = 2376803038
		pgs[7] = 3092849276
		pgs[8] = 1335963374
		pgs[9] = 3005914168
		pgs[10] = "战斗模型.wdf"
	elseif pg == "浮犀_英女侠_普通" then
		pgs[1] = 1239588375
		pgs[2] = 1239588375
		pgs[3] = 0756053968
		pgs[4] = 0821109265
		pgs[6] = 1472865246
		pgs[7] = 2192274301
		pgs[8] = 1990043008
		pgs[9] = 3996927795
		pgs[10] = "战斗模型.wdf"

	elseif pg == "盘龙_玄彩娥_普通" then
		pgs[1] = 3068635068
		pgs[2] = 3068635068
		pgs[3] = 959077202
		pgs[4] = 3616804633
		pgs[6] = 2106636810
		pgs[7] = 555283478
		pgs[8] = 2056912982
		pgs[9] = 2481130669
		pgs[10] = "战斗模型.wdf"
	elseif pg == "斩妖泣血_巨魔王_普通" then
		pgs[1] = 1896056556
		pgs[2] = 1896056556
		pgs[3] = 399651097
		pgs[4] = 335656095
		pgs[6] = 4247090300
		pgs[7] = 3557597697
		pgs[8] = 131374191
		pgs[9] = 3408927878
		pgs[10] = "战斗模型.wdf"
	elseif pg == "业火三灾_巨魔王_普通" then
		pgs[1] = 4258129878
		pgs[2] = 4258129878
		pgs[3] = 3927074237
		pgs[4] = 0727738647
		pgs[6] = 0460666887
		pgs[7] = 3086041675
		pgs[8] = 0213811481
		pgs[9] = 2227980701
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鸣鸿_巨魔王_普通" then
		pgs[1] = 2725911621
		pgs[2] = 2725911621
		pgs[3] = 1064946168
		pgs[4] = 0641529870
		pgs[6] = 1154664012
		pgs[7] = 2387777949
		pgs[8] = 0310225545
		pgs[9] = 2338581088
		pgs[10] = "战斗模型.wdf"
	elseif pg == "梨花_神天兵_普通" then
		pgs[1] = 1046350880
		pgs[2] = 1046350880
		pgs[3] = 3432918521
		pgs[4] = 2634626428
		pgs[6] = 3303390888
		pgs[7] = 1240292677
		pgs[8] = 3708021512
		pgs[9] = 1872876301
		pgs[10] = "战斗模型.wdf"
	elseif pg == "仙人指路_狐美人_普通" then
		pgs[1] = 1169841436
		pgs[2] = 1169841436
		pgs[3] = 851455711
		pgs[4] = 1792787137
		pgs[6] = 1034828303
		pgs[7] = 4038631411
		pgs[8] = 1358665134
		pgs[9] = 657246130
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金玉双环_飞燕女_普通" then
		pgs[1] = 358856899
		pgs[2] = 358856899
		pgs[3] = 1504523359
		pgs[4] = 1837818019
		pgs[6] = 2360002112
		pgs[7] = 1630259287
		pgs[8] = 1285329813
		pgs[9] = 1980919951
		pgs[10] = "战斗模型.wdf"
	elseif pg == "阴阳_英女侠_普通" then
		pgs[1] = 3489122494
		pgs[2] = 3489122494
		pgs[3] = 880749981
		pgs[4] = 4142038041
		pgs[6] = 2678300879
		pgs[7] = 3591452298
		pgs[8] = 351801901
		pgs[9] = 2182164503
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金玉双环_舞天姬_普通" then
		pgs[1] = 3279495962
		pgs[2] = 3279495962
		pgs[3] = 1189482605
		pgs[4] = 2148299765
		pgs[6] = 3630009301
		pgs[7] = 3263066954
		pgs[8] = 3371000519
		pgs[9] = 2240511279
		pgs[10] = "战斗模型.wdf"
	elseif pg == "逍遥江湖_龙太子_普通" then
		pgs[1] = 346935725
		pgs[2] = 346935725
		pgs[3] = 91893473
		pgs[4] = 4293635787
		pgs[6] = 4152040342
		pgs[7] = 3271976691
		pgs[8] = 3980106552
		pgs[9] = 2687029336
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玉龙_龙太子_普通" then
		pgs[1] = 2333774279
		pgs[2] = 2333774279
		pgs[3] = 1147744590
		pgs[4] = 444659320
		pgs[6] = 629954791
		pgs[7] = 263378940
		pgs[8] = 1570393999
		pgs[9] = 862461187
		pgs[10] = "战斗模型.wdf"
	elseif pg == "浩气长舒_龙太子_普通" then
		pgs[1] = 0x2CA2202A
		pgs[2] = 0x2CA2202A
		pgs[3] = 0x46585355
		pgs[4] = 0x0322040E
		pgs[6] = 0x0EBBBD6A
		pgs[7] = 0xAF198759
		pgs[8] = 0x7B25ED36
		pgs[9] = 0x08D6EBCD
		pgs[10] = "战斗模型.wdf"
	elseif pg == "星瀚_龙太子_普通" then
		pgs[1] = 0xF67E30AD
		pgs[2] = 0xF67E30AD
		pgs[3] = 0x36CC7C67
		pgs[4] = 0xA7FAAB06
		pgs[6] = 0x67BC1005
		pgs[7] = 0x9FE029BF
		pgs[8] = 0x08B72FF9
		pgs[9] = 0xBF00ABF2
		pgs[10] = "战斗模型.wdf"
	elseif pg == "墨玉骷髅_骨精灵_普通" then
		pgs[1] = 577830528
		pgs[2] = 577830528
		pgs[3] = 3266821735
		pgs[4] = 1068099312
		pgs[6] = 4070992100
		pgs[7] = 977905309
		pgs[8] = 2508349179
		pgs[9] = 100402035
		pgs[10] = "战斗模型.wdf"
	elseif pg == "丝萝乔木_骨精灵_普通" then
		pgs[1] = 0901353063
		pgs[2] = 0901353063
		pgs[3] = 2063487357
		pgs[4] = 0147143279
		pgs[6] = 2653363272
		pgs[7] = 1155369624
		pgs[8] = 1510947809
		pgs[9] = 3973054279
		pgs[10] = "战斗模型.wdf"
	elseif pg == "醍醐_骨精灵_普通" then
		pgs[1] = 1250633387
		pgs[2] = 1250633387
		pgs[3] = 2381723311
		pgs[4] = 1282610978
		pgs[6] = 0138367003
		pgs[7] = 1160534304
		pgs[8] = 3907592293
		pgs[9] = 0808638054
		pgs[10] = "战斗模型.wdf"
	elseif pg == "别情离恨_飞燕女_普通" then
		pgs[1] = 2294614510
		pgs[2] = 2294614510
		pgs[3] = 1412079494
		pgs[4] = 1646305352
		pgs[6] = 2256502232
		pgs[7] = 104447335
		pgs[8] = 471741487
		pgs[9] = 1039274121
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雪蟒霜寒_羽灵神_普通" then
		pgs[1] = 2930005782
		pgs[2] = 2930005782
		pgs[3] = 1411447909
		pgs[4] = 1157464245
		pgs[6] = 1798260255
		pgs[7] = 3245955639
		pgs[8] = 1135006044
		pgs[9] = 272976564
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九阴勾魂_狐美人_普通" then
		pgs[1] = 34055457
		pgs[2] = 34055457
		pgs[3] = 2107661171
		pgs[4] = 2594225835
		pgs[6] = 1606837702
		pgs[7] = 4229873282
		pgs[8] = 14066732
		pgs[9] = 3187095867
		pgs[10] = "战斗模型.wdf"
	elseif pg == "非攻_羽灵神_普通" then
		pgs[1] = 2832976024
		pgs[2] = 2832976024
		pgs[3] = 1185088706
		pgs[4] = 4004334076
		pgs[6] = 3652084138
		pgs[7] = 384985378
		pgs[8] = 2233740441
		pgs[9] = 1204493716
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九阴勾魂_骨精灵_普通" then
		pgs[1] = 1703807983
		pgs[2] = 1703807983
		pgs[3] = 1108591457
		pgs[4] = 2771732364
		pgs[6] = 489022779
		pgs[7] = 3267946192
		pgs[8] = 3766522110
		pgs[9] = 2175760076
		pgs[10] = "战斗模型.wdf"
	elseif pg == "梨花_龙太子_普通" then
		pgs[1] = 3747222349
		pgs[2] = 3747222349
		pgs[3] = 3189155092
		pgs[4] = 3062365732
		pgs[6] = 1598243358
		pgs[7] = 2389430522
		pgs[8] = 3918605409
		pgs[9] = 1648372626
		pgs[10] = "战斗模型.wdf"
	elseif pg == "护法灭魔_虎头怪_普通" then
		pgs[1] = 2333757160
		pgs[2] = 2333757160
		pgs[3] = 608625932
		pgs[4] = 1240918279
		pgs[6] = 4006191476
		pgs[7] = 291325187
		pgs[8] = 1586774719
		pgs[9] = 2726510090
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碧血干戚_虎头怪_普通" then
		pgs[1] = 2522616044
		pgs[2] = 2522616044
		pgs[3] = 3551561984
		pgs[4] = 4132910073
		pgs[6] = 2916654539
		pgs[7] = 1375729749
		pgs[8] = 3235367936
		pgs[9] = 2444186613
		pgs[10] = "战斗模型.wdf"
	elseif pg == "裂天_虎头怪_普通" then
		pgs[1] = 3605525759
		pgs[2] = 3605525759
		pgs[3] = 1658258788
		pgs[4] = 1428790516
		pgs[6] = 1927582914
		pgs[7] = 0157199347
		pgs[8] = 2018235479
		pgs[9] = 0184731195
		pgs[10] = "战斗模型.wdf"
	elseif pg == "五虎断魂_神天兵_普通" then
		pgs[1] = 2816878895
		pgs[2] = 2816878895
		pgs[3] = 3237243180
		pgs[4] = 298941115
		pgs[6] = 555909501
		pgs[7] = 683330927
		pgs[8] = 2195670772
		pgs[9] = 223295368
		pgs[10] = "战斗模型.wdf"
	elseif pg == "庄周梦蝶_羽灵神_普通" then
		pgs[1] = 101429091
		pgs[2] = 101429091
		pgs[3] = 1184168411
		pgs[4] = 3432364546
		pgs[6] = 3657330082
		pgs[7] = 548056296
		pgs[8] = 3683860076
		pgs[9] = 1443396752
		pgs[10] = "战斗模型.wdf"
	elseif pg == "庄周梦蝶_巫蛮儿_普通" then
		pgs[1] = 2699629829
		pgs[2] = 2699629829
		pgs[3] = 19941067
		pgs[4] = 2214888719
		pgs[6] = 2405414221
		pgs[7] = 3124365588
		pgs[8] = 181704645
		pgs[9] = 1598617101
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鹿鸣_羽灵神_普通" then
		pgs[1] = 430621291
		pgs[2] = 430621291
		pgs[3] = 3690027526
		pgs[4] = 2690907506
		pgs[6] = 2067206624
		pgs[7] = 3983937939
		pgs[8] = 2646614429
		pgs[9] = 664180130
		pgs[10] = "战斗模型.wdf"

	elseif pg == "碧海潮生_羽灵神_普通" then
		pgs[1] = 2874500726
		pgs[2] = 2874500726
		pgs[3] = 2974311966
		pgs[4] = 3236853267
		pgs[6] = 2141705747
		pgs[7] = 3946028962
		pgs[8] = 4233351592
		pgs[9] = 2739863852
		pgs[10] = "战斗模型.wdf"
	elseif pg == "弦月_羽灵神_普通" then
		pgs[1] = 4100861245
		pgs[2] = 4100861245
		pgs[3] = 2434737195
		pgs[4] = 2220097459
		pgs[6] = 0862692538
		pgs[7] = 2870088340
		pgs[8] = 1671028156
		pgs[9] = 2129606162
		pgs[10] = "战斗模型.wdf"
	elseif pg == "连理双树_飞燕女_普通" then
		pgs[1] = 2798452597
		pgs[2] = 2798452597
		pgs[3] = 2779592090
		pgs[4] = 111849301
		pgs[6] = 3818492150
		pgs[7] = 359904366
		pgs[8] = 981796200
		pgs[9] = 1623427017
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青藤玉树_骨精灵_普通" then
		pgs[1] = 3707129187
		pgs[2] = 3707129187
		pgs[3] = 260368700
		pgs[4] = 1260458106
		pgs[6] = 2796632770
		pgs[7] = 1119703569
		pgs[8] = 229416981
		pgs[9] = 2366517522
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月光双剑_飞燕女_普通" then
		pgs[1] = 2513982445
		pgs[2] = 2513982445
		pgs[3] = 1641721613
		pgs[4] = 2962390676
		pgs[6] = 586287519
		pgs[7] = 851655841
		pgs[8] = 1872246816
		pgs[9] = 3097886899
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鬼牙_神天兵_普通" then
		pgs[1] = 2430761776
		pgs[2] = 2430761776
		pgs[3] = 3359352706
		pgs[4] = 2621027170
		pgs[6] = 1110189315
		pgs[7] = 2486917341
		pgs[8] = 2741674073
		pgs[9] = 2681319409
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玉辉_羽灵神_普通" then
		pgs[1] = 1799011000
		pgs[2] = 1799011000
		pgs[3] = 3831187618
		pgs[4] = 2997063111
		pgs[6] = 3312955607
		pgs[7] = 3013082841
		pgs[8] = 1939053710
		pgs[9] = 1116805220
		pgs[10] = "战斗模型.wdf"
	elseif pg == "乾坤_飞燕女_普通" then
		pgs[1] = 3034288425
		pgs[2] = 3034288425
		pgs[3] = 2723272677
		pgs[4] = 1960402927
		pgs[6] = 3867771865
		pgs[7] = 1780449233
		pgs[8] = 967310259
		pgs[9] = 2120714102
		pgs[10] = "战斗模型.wdf"
	elseif pg == "倚天_剑侠客_普通" then
		pgs[1] = 1368524342
		pgs[2] = 1368524342
		pgs[3] = 1068916714
		pgs[4] = 4221789782
		pgs[6] = 360062771
		pgs[7] = 517811079
		pgs[8] = 3380216158
		pgs[9] = 195389599
		pgs[10] = "战斗模型.wdf"
	elseif pg == "玉辉_巫蛮儿_普通" then
		pgs[1] = 2197847487
		pgs[2] = 2197847487
		pgs[3] = 647814036
		pgs[4] = 643336377
		pgs[6] = 3288644239
		pgs[7] = 869836664
		pgs[8] = 2936127898
		pgs[9] = 2134751551
		pgs[10] = "战斗模型.wdf"
	elseif pg == "业焰_羽灵神_普通" then
		pgs[1] = 1471856529
		pgs[2] = 1471856529
		pgs[3] = 1895438642
		pgs[4] = 1769877803
		pgs[6] = 4245874516
		pgs[7] = 572738149
		pgs[8] = 1774544621
		pgs[9] = 565335915
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鱼肠_逍遥生_普通" then
		pgs[1] = 111752242
		pgs[2] = 111752242
		pgs[3] = 2779964916
		pgs[4] = 3099677412
		pgs[6] = 1315883113
		pgs[7] = 4096670906
		pgs[8] = 3380575361
		pgs[9] = 3347297766
		pgs[10] = "战斗模型.wdf"
	elseif pg == "肃魂_巨魔王_普通" then
		pgs[1] = 3727576188
		pgs[2] = 3727576188
		pgs[3] = 3246311288
		pgs[4] = 4127273897
		pgs[6] = 1400005662
		pgs[7] = 3888898365
		pgs[8] = 2920150876
		pgs[9] = 696981765
		pgs[10] = "战斗模型.wdf"
	elseif pg == "业焰_巫蛮儿_普通" then
		pgs[1] = 358788281
		pgs[2] = 358788281
		pgs[3] = 3187541069
		pgs[4] = 1276652632
		pgs[6] = 746435059
		pgs[7] = 1492176534
		pgs[8] = 4078550197
		pgs[9] = 2864410571
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙鸣寒水_羽灵神_普通" then
		pgs[1] = 2288999152
		pgs[2] = 2288999152
		pgs[3] = 3191815629
		pgs[4] = 975203915
		pgs[6] = 3559987378
		pgs[7] = 0xDE5063CD
		pgs[8] = 55816849
		pgs[9] = 1433469896
		pgs[10] = "战斗模型.wdf"
	elseif pg == "太极流光_杀破狼_普通" then
		pgs[1] = 2074525537
		pgs[2] = 2074525537
		pgs[3] = 449187270
		pgs[4] = 2759360079
		pgs[6] = 3413608092
		pgs[7] = 1682905191
		pgs[8] = 4051367450
		pgs[9] = 3252077695
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九霄风雷_杀破狼_普通" then
		pgs[1] = 3704392067
		pgs[2] = 3704392067
		pgs[3] = 3632605747
		pgs[4] = 2197826216
		pgs[6] = 2845081681
		pgs[7] = 2020968771
		pgs[8] = 3450511222
		pgs[9] = 1885695436
		pgs[10] = "战斗模型.wdf"
	elseif pg == "若木_杀破狼_普通" then
		pgs[1] = 2783866786
		pgs[2] = 2783866786
		pgs[3] = 1862994822
		pgs[4] = 1445406110
		pgs[6] = 1501063042
		pgs[7] = 1500235485
		pgs[8] = 3264257605
		pgs[9] = 3963075748
		pgs[10] = "战斗模型.wdf"

	elseif pg == "秋水落霞_玄彩娥_普通" then
		pgs[1] = 2834670277
		pgs[2] = 2834670277
		pgs[3] = 3677397747
		pgs[4] = 1773897847
		pgs[6] = 2096851051
		pgs[7] = 2528379760
		pgs[8] = 4035277094
		pgs[9] = 2619283310
		pgs[10] = "战斗模型.wdf"
	elseif pg == "湛卢_剑侠客_普通" then
		pgs[1] = 174574078
		pgs[2] = 174574078
		pgs[3] = 2462930631
		pgs[4] = 623897396
		pgs[6] = 357132169
		pgs[7] = 1091639193
		pgs[8] = 132771616
		pgs[9] = 1502161679
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞星_杀破狼_普通" then
		pgs[1] = 1920229574
		pgs[2] = 1920229574
		pgs[3] = 3670774470
		pgs[4] = 1565695987
		pgs[6] = 612719827
		pgs[7] = 304215519
		pgs[8] = 15688186
		pgs[9] = 3390941259
		pgs[10] = "战斗模型.wdf"
	elseif pg == "太极流光_羽灵神_普通" then
		pgs[1] = 2848033504
		pgs[2] = 2848033504
		pgs[3] = 2656382753
		pgs[4] = 2977776427
		pgs[6] = 1141425103
		pgs[7] = 3968350241
		pgs[8] = 2316321007
		pgs[9] = 104034525
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九霄风雷_羽灵神_普通" then
		pgs[1] = 0158730771
		pgs[2] = 0158730771
		pgs[3] = 0132145415
		pgs[4] = 0764898549
		pgs[6] = 3046428836
		pgs[7] = 0756094913
		pgs[8] = 1838448889
		pgs[9] = 0827920690
		pgs[10] = "战斗模型.wdf"
	elseif pg == "若木_羽灵神_普通" then
		pgs[1] = 4068136814
		pgs[2] = 4068136814
		pgs[3] = 0418458259
		pgs[4] = 3490606442
		pgs[6] = 3417142708
		pgs[7] = 3650939868
		pgs[8] = 3613858643
		pgs[9] = 3612898812
		pgs[10] = "战斗模型.wdf"
	elseif pg == "冥火薄天_杀破狼_普通" then
		pgs[1] = 871369705
		pgs[2] = 871369705
		pgs[3] = 1399674031
		pgs[4] = 1805010867
		pgs[6] = 1620002437
		pgs[7] = 1839576620
		pgs[8] = 621841422
		pgs[9] = 3126248794
		pgs[10] = "战斗模型.wdf"
	elseif pg == "幽篁_杀破狼_普通" then
		pgs[1] = 1663842501
		pgs[2] = 1663842501
		pgs[3] = 2110884946
		pgs[4] = 4241477506
		pgs[6] = 4245424904
		pgs[7] = 1184291529
		pgs[8] = 3595306000
		pgs[9] = 3541370331
		pgs[10] = "战斗模型.wdf"
	elseif pg == "霹雳_神天兵_普通" then
		pgs[1] = 1051053489
		pgs[2] = 1051053489
		pgs[3] = 4239140569
		pgs[4] = 2085918398
		pgs[6] = 3349289903
		pgs[7] = 3508045990
		pgs[8] = 143015740
		pgs[9] = 2889808459
		pgs[10] = "战斗模型.wdf"
	elseif pg == "四法青云_剑侠客_普通" then
		pgs[1] = 2301962273
		pgs[2] = 2301962273
		pgs[3] = 1642344190
		pgs[4] = 4019743340
		pgs[6] = 690548315
		pgs[7] = 654838706
		pgs[8] = 3259089844
		pgs[9] = 3268379919
		pgs[10] = "战斗模型.wdf"

	elseif pg == "霜冷九州_逍遥生_普通" then
		pgs[1] = 3500923187
		pgs[2] = 3500923187
		pgs[3] = 3419416515
		pgs[4] = 4121135422
		pgs[6] = 1766329695
		pgs[7] = 1208240575
		pgs[8] = 2948332373
		pgs[9] = 0569489195
		pgs[10] = "战斗模型.wdf"
	elseif pg == "霜冷九州_剑侠客_普通" then
		pgs[1] = 3750052903
		pgs[2] = 3750052903
		pgs[3] = 3978185529
		pgs[4] = 1126547325
		pgs[6] = 3133397477
		pgs[7] = 1400612648
		pgs[8] = 1048600867
		pgs[9] = 0587348277
		pgs[10] = "战斗模型.wdf"
	elseif pg == "擒龙_逍遥生_普通" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "战斗模型.wdf"
	elseif pg == "擒龙_剑侠客_普通" then
		pgs[1] = 2066485351
		pgs[2] = 2066485351
		pgs[3] = 3200400983
		pgs[4] = 4074782058
		pgs[6] = 2739156816
		pgs[7] = 2620255839
		pgs[8] = 3164581880
		pgs[9] = 0839277591
		pgs[10] = "战斗模型.wdf"
	elseif pg == "百鬼_杀破狼_普通" then
		pgs[1] = 2607438844
		pgs[2] = 2607438844
		pgs[3] = 894755654
		pgs[4] = 1601466888
		pgs[6] = 520922337
		pgs[7] = 3106122659
		pgs[8] = 610584642
		pgs[9] = 1809776963
		pgs[10] = "战斗模型.wdf"
	elseif pg == "破魄_巨魔王_普通" then
		pgs[1] = 319488423
		pgs[2] = 319488423
		pgs[3] = 276199838
		pgs[4] = 3984718092
		pgs[6] = 3043299876
		pgs[7] = 2152441077
		pgs[8] = 4105273607
		pgs[9] = 1812185996
		pgs[10] = "战斗模型.wdf"
	elseif pg == "贵霜之牙_骨精灵_普通" then
		pgs[1] = 13151833
		pgs[2] = 13151833
		pgs[3] = 3119070731
		pgs[4] = 2925176370
		pgs[6] = 799282094
		pgs[7] = 602955150
		pgs[8] = 2619296391
		pgs[9] = 1165096955
		pgs[10] = "战斗模型.wdf"
	elseif pg == "忘川三途_骨精灵_普通" then
		pgs[1] = 1057196119
		pgs[2] = 1057196119
		pgs[3] = 3284493434
		pgs[4] = 3066925446
		pgs[6] = 0859112470
		pgs[7] = 2663913050
		pgs[8] = 1551227703
		pgs[9] = 2945401960
		pgs[10] = "战斗模型.wdf"
	elseif pg == "离钩_骨精灵_普通" then
		pgs[1] = 4162960663
		pgs[2] = 4162960663
		pgs[3] = 2169364374
		pgs[4] = 0433475784
		pgs[6] = 0158171847
		pgs[7] = 2484616195
		pgs[8] = 1699445520
		pgs[9] = 2751461351
		pgs[10] = "战斗模型.wdf"

	elseif pg == "幽篁_羽灵神_普通" then
		pgs[1] = 1385345996
		pgs[2] = 1385345996
		pgs[3] = 767991055
		pgs[4] = 2413280637
		pgs[6] = 3907295353
		pgs[7] = 4034909222
		pgs[8] = 590632369
		pgs[9] = 1102812055
		pgs[10] = "战斗模型.wdf"
	elseif pg == "非攻_杀破狼_普通" then
		pgs[1] = 1885839562
		pgs[2] = 1885839562
		pgs[3] = 3957124377
		pgs[4] = 3204102825
		pgs[6] = 2379415806
		pgs[7] = 1950788981
		pgs[8] = 1127738414
		pgs[9] = 2661471858
		pgs[10] = "战斗模型.wdf"
	elseif pg == "紫金葫芦_杀破狼_普通" then
		pgs[1] = 994535269
		pgs[2] = 994535269
		pgs[3] = 4014927528
		pgs[4] = 3310480847
		pgs[6] = 2831639351
		pgs[7] = 122206673
		pgs[8] = 1940957103
		pgs[9] = 2257546251
		pgs[10] = "战斗模型.wdf"
	elseif pg == "回风舞雪_杀破狼_普通" then
		pgs[1] = 723925966
		pgs[2] = 723925966
		pgs[3] = 1798299344
		pgs[4] = 1212380108
		pgs[6] = 1637540313
		pgs[7] = 2653292719
		pgs[8] = 257191592
		pgs[9] = 2659671813
		pgs[10] = "战斗模型.wdf"
	elseif pg == "飞龙在天_龙太子_普通" then
		pgs[1] = 0x49187E40
		pgs[2] = 0x49187E40
		pgs[3] = 0xA87E49E8
		pgs[4] = 0x41E835B5
		pgs[6] = 0x28FCF221
		pgs[7] = 0x367AC070
		pgs[8] = 0x1255644D
		pgs[9] = 0x4E9D13AE
		pgs[10] = "战斗模型.wdf"
	elseif pg == "天龙破城_龙太子_普通" then
		pgs[1] = 0666227171
		pgs[2] = 0666227171
		pgs[3] = 3545294647
		pgs[4] = 1075279479
		pgs[6] = 4013753607
		pgs[7] = 1440842173
		pgs[8] = 1146668387
		pgs[9] = 1609569152
		pgs[10] = "战斗模型.wdf"
	elseif pg == "弑皇_龙太子_普通" then
		pgs[1] = 0x2F84D4CA
		pgs[2] = 0x2F84D4CA
		pgs[3] = 0x9792B519
		pgs[4] = 0xB80DD092
		pgs[6] = 0xEF721760
		pgs[7] = 0x6B780672
		pgs[8] = 0xA85D5556
		pgs[9] = 0x28B45289
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雪蚕之刺_狐美人_普通" then
		pgs[1] = 3375230005
		pgs[2] = 3375230005
		pgs[3] = 49297381
		pgs[4] = 4186182464
		pgs[6] = 4168563223
		pgs[7] = 3779159654
		pgs[8] = 1556439270
		pgs[9] = 3143637419
		pgs[10] = "战斗模型.wdf"
	elseif pg == "毒牙_狐美人_普通" then
		pgs[1] = 2678046311
		pgs[2] = 2678046311
		pgs[3] = 147162749
		pgs[4] = 1046153681
		pgs[6] = 3025877259
		pgs[7] = 4196456021
		pgs[8] = 2797725717
		pgs[9] = 648763427
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鬼牙_虎头怪_普通" then
		pgs[1] = 3191385649
		pgs[2] = 3191385649
		pgs[3] = 964246481
		pgs[4] = 439390498
		pgs[6] = 2557976454
		pgs[7] = 899308703
		pgs[8] = 1809962467
		pgs[9] = 1310176885
		pgs[10] = "战斗模型.wdf"
	elseif pg == "五丁开山_巨魔王_普通" then
		pgs[1] = 2764988110
		pgs[2] = 2764988110
		pgs[3] = 658496727
		pgs[4] = 1647167110
		pgs[6] = 3579833021
		pgs[7] = 1948978116
		pgs[8] = 1824676110
		pgs[9] = 1166051005
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月光双环_舞天姬_普通" then
		pgs[1] = 3165243568
		pgs[2] = 3165243568
		pgs[3] = 16282348
		pgs[4] = 2288648467
		pgs[6] = 3693039080
		pgs[7] = 2693457978
		pgs[8] = 3984861090
		pgs[9] = 1429132352
		pgs[10] = "战斗模型.wdf"
	elseif pg == "晓风残月_剑侠客_普通" then
		pgs[1] = 3614142659
		pgs[2] = 3614142659
		pgs[3] = 222137428
		pgs[4] = 162101136
		pgs[6] = 3111105254
		pgs[7] = 1410594659
		pgs[8] = 1285154537
		pgs[9] = 1663734878
		pgs[10] = "战斗模型.wdf"
	elseif pg == "无敌_巨魔王_普通" then
		pgs[1] = 1778946713
		pgs[2] = 1778946713
		pgs[3] = 524617246
		pgs[4] = 1841084145
		pgs[6] = 2152432898
		pgs[7] = 2969721676
		pgs[8] = 1229188957
		pgs[9] = 788779469
		pgs[10] = "战斗模型.wdf"
	elseif pg == "离火_杀破狼_普通" then
		pgs[1] = 1736891488
		pgs[2] = 1736891488
		pgs[3] = 1516097158
		pgs[4] = 1419099406
		pgs[6] = 619566973
		pgs[7] = 332324123
		pgs[8] = 942082261
		pgs[9] = 4082318050
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碧波_舞天姬_普通" then
		pgs[1] = 1034789143
		pgs[2] = 1034789143
		pgs[3] = 4113412723
		pgs[4] = 2355929470
		pgs[6] = 2655943207
		pgs[7] = 2855246102
		pgs[8] = 241555200
		pgs[9] = 1141838919
		pgs[10] = "战斗模型.wdf"
	elseif pg == "此最相思_玄彩娥_普通" then
		pgs[1] = 193367860
		pgs[2] = 193367860
		pgs[3] = 1702432156
		pgs[4] = 2340791616
		pgs[6] = 493173921
		pgs[7] = 1169690561
		pgs[8] = 2674679688
		pgs[9] = 668529798
		pgs[10] = "战斗模型.wdf"
	elseif pg == "揽月摘星_玄彩娥_普通" then
		pgs[1] = 3957461210
		pgs[2] = 3957461210
		pgs[3] = 1507018653
		pgs[4] = 1507018653
		pgs[6] = 2821704604
		pgs[7] = 3505463631
		pgs[8] = 2825593192
		pgs[9] = 1456089502
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九霄_玄彩娥_普通" then
		pgs[1] = 1925606125
		pgs[2] = 1925606125
		pgs[3] = 1672964794
		pgs[4] = 3074777996
		pgs[6] = 3263307981
		pgs[7] = 1083356098
		pgs[8] = 2475418304
		pgs[9] = 2130671600
		pgs[10] = "战斗模型.wdf"
	elseif pg == "连理双树_英女侠_普通" then
		pgs[1] = 1056087193
		pgs[2] = 1056087193
		pgs[3] = 158990972
		pgs[4] = 2230185189
		pgs[6] = 3682647142
		pgs[7] = 3580865845
		pgs[8] = 686282707
		pgs[9] = 3554518006
		pgs[10] = "战斗模型.wdf"
	elseif pg == "凤翼流珠_巫蛮儿_普通" then
		pgs[1] = 2005711219
		pgs[2] = 2005711219
		pgs[3] = 1777115444
		pgs[4] = 738268467
		pgs[6] = 3554514707
		pgs[7] = 2166949971
		pgs[8] = 2242679788
		pgs[9] = 3110874208
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金龙双剪_飞燕女_普通" then
		pgs[1] = 1411197712
		pgs[2] = 1411197712
		pgs[3] = 4046830583
		pgs[4] = 2149768266
		pgs[6] = 3896276189
		pgs[7] = 1274536324
		pgs[8] = 3865893351
		pgs[9] = 4293096481
		pgs[10] = "战斗模型.wdf"
	elseif pg == "游龙惊鸿_狐美人_普通" then
		pgs[1] = 1677496371
		pgs[2] = 1677496371
		pgs[3] = 1419416100
		pgs[4] = 1427572959
		pgs[6] = 3911390728
		pgs[7] = 4269124018
		pgs[8] = 1118732647
		pgs[9] = 1632285264
		pgs[10] = "战斗模型.wdf"
	elseif pg == "倚天_逍遥生_普通" then
		pgs[1] = 944530413
		pgs[2] = 944530413
		pgs[3] = 4288693369
		pgs[4] = 2648862354
		pgs[6] = 893536575
		pgs[7] = 3580840293
		pgs[8] = 1513199932
		pgs[9] = 1959183902
		pgs[10] = "战斗模型.wdf"
	elseif pg == "雷神_神天兵_普通" then
		pgs[1] = 148474283
		pgs[2] = 148474283
		pgs[3] = 2398394513
		pgs[4] = 2945190989
		pgs[6] = 3920362664
		pgs[7] = 3086874992
		pgs[8] = 2993116090
		pgs[9] = 2515289535
		pgs[10] = "战斗模型.wdf"
	elseif pg == "湛卢_逍遥生_普通" then
		pgs[1] = 4122820611
		pgs[2] = 4122820611
		pgs[3] = 39942374
		pgs[4] = 3784693035
		pgs[6] = 3879135399
		pgs[7] = 1799718291
		pgs[8] = 2656683712
		pgs[9] = 356672046
		pgs[10] = "战斗模型.wdf"
	elseif pg == "屠龙_剑侠客_普通" then
		pgs[1] = 892827193
		pgs[2] = 892827193
		pgs[3] = 2530500829
		pgs[4] = 3739812188
		pgs[6] = 408410478
		pgs[7] = 2903940161
		pgs[8] = 1040159026
		pgs[9] = 319067749
		pgs[10] = "战斗模型.wdf"
	elseif pg == "盘龙_骨精灵_普通" then
		pgs[1] = 399188318
		pgs[2] = 399188318
		pgs[3] = 3336570526
		pgs[4] = 2823302607
		pgs[6] = 4143522053
		pgs[7] = 4066814475
		pgs[8] = 2053873433
		pgs[9] = 4254444118
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙筋_英女侠旧_普通" then
		pgs[1] = 151
		pgs[2] = 151
		pgs[3] = 153
		pgs[4] = 150
		pgs[6] = 257
		pgs[7] = 152
		pgs[8] = 256
		pgs[9] = 148
		pgs[10] = "战斗模型.wdf"
	elseif pg == "秋风_龙太子_普通" then
		pgs[1] = 775882284
		pgs[2] = 775882284
		pgs[3] = 749947548
		pgs[4] = 4103046621
		pgs[6] = 4079294468
		pgs[7] = 1774952424
		pgs[8] = 409973300
		pgs[9] = 342475400
		pgs[10] = "战斗模型.wdf"
	elseif pg == "胭脂_骨精灵_普通" then
		pgs[1] = 4115672778
		pgs[2] = 4115672778
		pgs[3] = 2352019632
		pgs[4] = 1274576130
		pgs[6] = 970419487
		pgs[7] = 2008951769
		pgs[8] = 275870055
		pgs[9] = 2737514270
		pgs[10] = "战斗模型.wdf"
	elseif pg == "画龙点睛_逍遥生_普通" then
		pgs[1] = 1820963257
		pgs[2] = 1820963257
		pgs[3] = 177826354
		pgs[4] = 847585063
		pgs[6] = 2168341927
		pgs[7] = 2999351206
		pgs[8] = 2759214368
		pgs[9] = 3485764253
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月光双剑_英女侠旧_普通" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "战斗模型.wdf"
	elseif pg == "混元金锤_神天兵_普通" then
		pgs[1] = 1923208867
		pgs[2] = 1923208867
		pgs[3] = 3952062894
		pgs[4] = 1295504995
		pgs[6] = 577114027
		pgs[7] = 1445398766
		pgs[8] = 3171781597
		pgs[9] = 1835217455
		pgs[10] = "战斗模型.wdf"
	elseif pg == "降魔玉杵_玄彩娥_普通" then
		pgs[1] = 4099217390
		pgs[2] = 4099217390
		pgs[3] = 3206381160
		pgs[4] = 2229271781
		pgs[6] = 2242027872
		pgs[7] = 775886307
		pgs[8] = 3480235058
		pgs[9] = 3182933271
		pgs[10] = "战斗模型.wdf"
	elseif pg == "流云_舞天姬_普通" then
		pgs[1] = 4195857049
		pgs[2] = 4195857049
		pgs[3] = 2514907580
		pgs[4] = 972420940
		pgs[6] = 198547491
		pgs[7] = 2802292186
		pgs[8] = 3885561582
		pgs[9] = 1837939421
		pgs[10] = "战斗模型.wdf"
	elseif pg == "如意_舞天姬_普通" then
		pgs[1] = 3267454880
		pgs[2] = 3267454880
		pgs[3] = 1911031086
		pgs[4] = 2351280146
		pgs[6] = 850292701
		pgs[7] = 500162329
		pgs[8] = 1166644566
		pgs[9] = 197968673
		pgs[10] = "战斗模型.wdf"
	elseif pg == "流云_玄彩娥_普通" then
		pgs[1] = 2363368052
		pgs[2] = 2363368052
		pgs[3] = 469609710
		pgs[4] = 1588271293
		pgs[6] = 688944433
		pgs[7] = 4012911086
		pgs[8] = 4199981403
		pgs[9] = 459658607
		pgs[10] = "战斗模型.wdf"
	elseif pg == "晃金仙绳_舞天姬_普通" then
		pgs[1] = 480998208
		pgs[2] = 480998208
		pgs[3] = 536662357
		pgs[4] = 1983509384
		pgs[6] = 2029228117
		pgs[7] = 1363856210
		pgs[8] = 66546999
		pgs[9] = 4226984468
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鹿鸣_巫蛮儿_普通" then
		pgs[1] = 2923599993
		pgs[2] = 2923599993
		pgs[3] = 862900418
		pgs[4] = 2806977290
		pgs[6] = 2678464587
		pgs[7] = 893469617
		pgs[8] = 3689245011
		pgs[9] = 780797617
		pgs[10] = "战斗模型.wdf"
	elseif pg == "沧海_骨精灵_普通" then
		pgs[1] = 3063376651
		pgs[2] = 3063376651
		pgs[3] = 2245942073
		pgs[4] = 3879413923
		pgs[6] = 3414421168
		pgs[7] = 4221563191
		pgs[8] = 3538250889
		pgs[9] = 3779942817
		pgs[10] = "战斗模型.wdf"
	elseif pg == "太极_龙太子_普通" then
		pgs[1] = 3905888692
		pgs[2] = 3905888692
		pgs[3] = 2235760273
		pgs[4] = 518907138
		pgs[6] = 121079973
		pgs[7] = 662010105
		pgs[8] = 1852360605
		pgs[9] = 269312850
		pgs[10] = "战斗模型.wdf"
	elseif pg == "阴阳_英女侠旧_普通" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "战斗模型.wdf"
	elseif pg == "吹雪_英女侠_普通" then
		pgs[1] = 1984457860
		pgs[2] = 1984457860
		pgs[3] = 2659822722
		pgs[4] = 4091160803
		pgs[6] = 2259108135
		pgs[7] = 1616653577
		pgs[8] = 3980490964
		pgs[9] = 1671498156
		pgs[10] = "战斗模型.wdf"
	elseif pg == "太极_逍遥生_普通" then
		pgs[1] = 649896254
		pgs[2] = 649896254
		pgs[3] = 1386995615
		pgs[4] = 2206939775
		pgs[6] = 4084370231
		pgs[7] = 730224004
		pgs[8] = 2110134716
		pgs[9] = 297375576
		pgs[10] = "战斗模型.wdf"
	elseif pg == "百花_英女侠_普通" then
		pgs[1] = 1180240329
		pgs[2] = 1180240329
		pgs[3] = 2921076198
		pgs[4] = 2432608663
		pgs[6] = 1464871645
		pgs[7] = 2411376211
		pgs[8] = 421272947
		pgs[9] = 1686679961
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九天金线_飞燕女_普通" then
		pgs[1] = 256145777
		pgs[2] = 256145777
		pgs[3] = 805152074
		pgs[4] = 612236907
		pgs[6] = 1205883736
		pgs[7] = 4056107702
		pgs[8] = 1146798449
		pgs[9] = 876728636
		pgs[10] = "战斗模型.wdf"
	elseif pg == "无关风月_飞燕女_普通" then
		pgs[1] = 2051866479
		pgs[2] = 2051866479
		pgs[3] = 1785158753
		pgs[4] = 1982666386
		pgs[6] = 3204942337
		pgs[7] = 1654668611
		pgs[8] = 0930614766
		pgs[9] = 3051530981
		pgs[10] = "战斗模型.wdf"
	elseif pg == "朝夕_飞燕女_普通" then
		pgs[1] = 4138802289
		pgs[2] = 4138802289
		pgs[3] = 0258017396
		pgs[4] = 0480690756
		pgs[6] = 2701132789
		pgs[7] = 3192094510
		pgs[8] = 3576848265
		pgs[9] = 1213207317
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鱼肠_剑侠客_普通" then
		pgs[1] = 4227823198
		pgs[2] = 4227823198
		pgs[3] = 2698488437
		pgs[4] = 3798717939
		pgs[6] = 3533475904
		pgs[7] = 3303465815
		pgs[8] = 1861666518
		pgs[9] = 1012813203
		pgs[10] = "战斗模型.wdf"
	elseif pg == "别情离恨_舞天姬_普通" then
		pgs[1] = 799504916
		pgs[2] = 799504916
		pgs[3] = 842553389
		pgs[4] = 1982103646
		pgs[6] = 2210222918
		pgs[7] = 1858157676
		pgs[8] = 1117799210
		pgs[9] = 3296383020
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月华_杀破狼_普通" then
		pgs[1] = 3883698348
		pgs[2] = 3883698348
		pgs[3] = 1535796704
		pgs[4] = 81237364
		pgs[6] = 786918783
		pgs[7] = 1149367266
		pgs[8] = 2874084219
		pgs[9] = 2578429791
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月光双环_飞燕女_普通" then
		pgs[1] = 4194305873
		pgs[2] = 4194305873
		pgs[3] = 2807816879
		pgs[4] = 73773078
		pgs[6] = 1041791674
		pgs[7] = 1651978044
		pgs[8] = 2848081881
		pgs[9] = 3069409432
		pgs[10] = "战斗模型.wdf"
	elseif pg == "彩虹_玄彩娥_普通" then
		pgs[1] = 4010760941
		pgs[2] = 4010760941
		pgs[3] = 3725639444
		pgs[4] = 444072186
		pgs[6] = 1602142769
		pgs[7] = 3326013825
		pgs[8] = 1763662402
		pgs[9] = 2222466647
		pgs[10] = "战斗模型.wdf"
	elseif pg == "墨玉骷髅_玄彩娥_普通" then
		pgs[1] = 1829371224
		pgs[2] = 1829371224
		pgs[3] = 2002019356
		pgs[4] = 2320316366
		pgs[6] = 2555196614
		pgs[7] = 335647506
		pgs[8] = 2671690470
		pgs[9] = 85118950
		pgs[10] = "战斗模型.wdf"
	elseif pg == "丝萝乔木_玄彩娥_普通" then
		pgs[1] = 1121230155
		pgs[2] = 1121230155
		pgs[3] = 0322946589
		pgs[4] = 4206785453
		pgs[6] = 2777298091
		pgs[7] = 2186653861
		pgs[8] = 1884580054
		pgs[9] = 0740212343
		pgs[10] = "战斗模型.wdf"
	elseif pg == "醍醐_玄彩娥_普通" then
		pgs[1] = 3632446855
		pgs[2] = 3632446855
		pgs[3] = 2786004275
		pgs[4] = 4043816298
		pgs[6] = 0583826926
		pgs[7] = 2781044081
		pgs[8] = 0752278480
		pgs[9] = 0053905909
		pgs[10] = "战斗模型.wdf"
	elseif pg == "百鬼_羽灵神_普通" then
		pgs[1] = 433769011
		pgs[2] = 433769011
		pgs[3] = 1388983839
		pgs[4] = 2412124226
		pgs[6] = 3519132595
		pgs[7] = 2744030084
		pgs[8] = 3242785816
		pgs[9] = 4010155361
		pgs[10] = "战斗模型.wdf"
	elseif pg == "鬼王蚀日_虎头怪_普通" then
		pgs[1] = 2268846765
		pgs[2] = 2268846765
		pgs[3] = 257733900
		pgs[4] = 733650393
		pgs[6] = 2155760337
		pgs[7] = 3690009014
		pgs[8] = 3223595996
		pgs[9] = 553446556
		pgs[10] = "战斗模型.wdf"
	elseif pg == "狂澜碎岳_虎头怪_普通" then
		pgs[1] = 0843924172
		pgs[2] = 0843924172
		pgs[3] = 3497818294
		pgs[4] = 0119723529
		pgs[6] = 2748969191
		pgs[7] = 1323769114
		pgs[8] = 1279428078
		pgs[9] = 1811551067
		pgs[10] = "战斗模型.wdf"
	elseif pg == "碎寂_虎头怪_普通" then
		pgs[1] = 3620927202
		pgs[2] = 3620927202
		pgs[3] = 1460939045
		pgs[4] = 3684775387
		pgs[6] = 3894472815
		pgs[7] = 0534677085
		pgs[8] = 1857702941
		pgs[9] = 3336710114
		pgs[10] = "战斗模型.wdf"
	elseif pg == "秋风_逍遥生_普通" then
		pgs[1] = 2946234719
		pgs[2] = 2946234719
		pgs[3] = 918869516
		pgs[4] = 913597263
		pgs[6] = 1906683947
		pgs[7] = 3000647151
		pgs[8] = 3901133072
		pgs[9] = 1776219114
		pgs[10] = "战斗模型.wdf"
	elseif pg == "血之刺藤_英女侠_普通" then
		pgs[1] = 543888368
		pgs[2] = 543888368
		pgs[3] = 3535124792
		pgs[4] = 1279996625
		pgs[6] = 676243872
		pgs[7] = 355830171
		pgs[8] = 3183836178
		pgs[9] = 373595036
		pgs[10] = "战斗模型.wdf"
	elseif pg == "牧云清歌_英女侠_普通" then
		pgs[1] = 4166360919
		pgs[2] = 4166360919
		pgs[3] = 2255696063
		pgs[4] = 3268785498
		pgs[6] = 0534627512
		pgs[7] = 1644779301
		pgs[8] = 0411350546
		pgs[9] = 3269704350
		pgs[10] = "战斗模型.wdf"
	elseif pg == "霜陨_英女侠_普通" then
		pgs[1] = 3617687903
		pgs[2] = 3617687903
		pgs[3] = 3055706917
		pgs[4] = 0667306037
		pgs[6] = 4248825161
		pgs[7] = 0234849785
		pgs[8] = 0336164631
		pgs[9] = 2174583476
		pgs[10] = "战斗模型.wdf"
	elseif pg == "灵犀神剑_剑侠客_普通" then
		pgs[1] = 1664613177
		pgs[2] = 1664613177
		pgs[3] = 739286596
		pgs[4] = 3081380929
		pgs[6] = 2240524266
		pgs[7] = 2235430645
		pgs[8] = 2276071821
		pgs[9] = 83886513
		pgs[10] = "战斗模型.wdf"
	elseif pg == "冷月_剑侠客_普通" then
		pgs[1] = 1050757801
		pgs[2] = 1050757801
		pgs[3] = 2523626742
		pgs[4] = 332965488
		pgs[6] = 797204911
		pgs[7] = 1739503652
		pgs[8] = 3541810222
		pgs[9] = 1219913712
		pgs[10] = "战斗模型.wdf"
	elseif pg == "四法青云_逍遥生_普通" then
		pgs[1] = 3016226515
		pgs[2] = 3016226515
		pgs[3] = 52451636
		pgs[4] = 1691019474
		pgs[6] = 2058662475
		pgs[7] = 1670645347
		pgs[8] = 372928672
		pgs[9] = 3475794618
		pgs[10] = "战斗模型.wdf"
	elseif pg == "刑天之逆_神天兵_普通" then
		pgs[1] = 4050435392
		pgs[2] = 4050435392
		pgs[3] = 1597843931
		pgs[4] = 1688528240
		pgs[6] = 2425493529
		pgs[7] = 1710005881
		pgs[8] = 507405361
		pgs[9] = 167694840
		pgs[10] = "战斗模型.wdf"
	elseif pg == "偃月青龙_剑侠客_普通" then
		pgs[1] = 190424072
		pgs[2] = 190424072
		pgs[3] = 1961249071
		pgs[4] = 3838801989
		pgs[6] = 2829649300
		pgs[7] = 3543370033
		pgs[8] = 1454309726
		pgs[9] = 1450613061
		pgs[10] = "战斗模型.wdf"
	elseif pg == "偃月青龙_巨魔王_普通" then
		pgs[1] = 4010127360
		pgs[2] = 4010127360
		pgs[3] = 1888302904
		pgs[4] = 1208038344
		pgs[6] = 1840793383
		pgs[7] = 1348825008
		pgs[8] = 868863512
		pgs[9] = 514498611
		pgs[10] = "战斗模型.wdf"
	elseif pg == "灵蛇_飞燕女_普通" then
		pgs[1] = 2306957117
		pgs[2] = 2306957117
		pgs[3] = 1793932680
		pgs[4] = 2656017222
		pgs[6] = 3801799119
		pgs[7] = 2677792087
		pgs[8] = 1072683373
		pgs[9] = 2798173689
		pgs[10] = "战斗模型.wdf"
	elseif pg == "混元金锤_虎头怪_普通" then
		pgs[1] = 3310158404
		pgs[2] = 3310158404
		pgs[3] = 3916719461
		pgs[4] = 2256126103
		pgs[6] = 1047119087
		pgs[7] = 649007137
		pgs[8] = 3287631002
		pgs[9] = 3272074169
		pgs[10] = "战斗模型.wdf"
	elseif pg == "秋水人家_逍遥生_普通" then
		pgs[1] = 3722556358
		pgs[2] = 3722556358
		pgs[3] = 1425493699
		pgs[4] = 817486875
		pgs[6] = 2119665882
		pgs[7] = 79540806
		pgs[8] = 1912450629
		pgs[9] = 3131282288
		pgs[10] = "战斗模型.wdf"
	elseif pg == "血之刺藤_狐美人_普通" then
		pgs[1] = 4050126740
		pgs[2] = 4050126740
		pgs[3] = 3429497989
		pgs[4] = 2489520435
		pgs[6] = 2605547995
		pgs[7] = 888707380
		pgs[8] = 1942318093
		pgs[9] = 3544559629
		pgs[10] = "战斗模型.wdf"
	elseif pg == "牧云清歌_狐美人_普通" then
		pgs[1] = 1719727329
		pgs[2] = 1719727329
		pgs[3] = 0210056156
		pgs[4] = 4235354976
		pgs[6] = 3324406676
		pgs[7] = 4002747821
		pgs[8] = 2497747470
		pgs[9] = 0747942707
		pgs[10] = "战斗模型.wdf"
	elseif pg == "霜陨_狐美人_普通" then
		pgs[1] = 1258580513
		pgs[2] = 1258580513
		pgs[3] = 1285805382
		pgs[4] = 3557049784
		pgs[6] = 0373506230
		pgs[7] = 1376923560
		pgs[8] = 4168352366
		pgs[9] = 1324744500
		pgs[10] = "战斗模型.wdf"
	elseif pg == "冷月_巨魔王_普通" then
		pgs[1] = 432866760
		pgs[2] = 432866760
		pgs[3] = 1400294209
		pgs[4] = 2104157931
		pgs[6] = 1649287571
		pgs[7] = 3373155289
		pgs[8] = 3573839422
		pgs[9] = 914206326
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九天金线_舞天姬_普通" then
		pgs[1] = 1669961605
		pgs[2] = 1669961605
		pgs[3] = 280626373
		pgs[4] = 2737030257
		pgs[6] = 1711064047
		pgs[7] = 2155201472
		pgs[8] = 2934052938
		pgs[9] = 2722500657
		pgs[10] = "战斗模型.wdf"
	elseif pg == "无关风月_舞天姬_普通" then
		pgs[1] = 3653729862
		pgs[2] = 3653729862
		pgs[3] = 2118476708
		pgs[4] = 1290614140
		pgs[6] = 2011121195
		pgs[7] = 3035499198
		pgs[8] = 3842984317
		pgs[9] = 1519396140
		pgs[10] = "战斗模型.wdf"
	elseif pg == "朝夕_舞天姬_普通" then
		pgs[1] = 2395353653
		pgs[2] = 2395353653
		pgs[3] = 0708502548
		pgs[4] = 3224442340
		pgs[6] = 3649114993
		pgs[7] = 2271525100
		pgs[8] = 3918368321
		pgs[9] = 3452351752
		pgs[10] = "战斗模型.wdf"
	elseif pg == "逍遥江湖_逍遥生_普通" then
		pgs[1] = 3459742955
		pgs[2] = 3459742955
		pgs[3] = 1723293957
		pgs[4] = 4224277364
		pgs[6] = 1818516162
		pgs[7] = 3783711264
		pgs[8] = 3566337709
		pgs[9] = 2650676483
		pgs[10] = "战斗模型.wdf"
	elseif pg == "浩气长舒_逍遥生_普通" then
		pgs[1] = 1787687382
		pgs[2] = 1787687382
		pgs[3] = 2437076334
		pgs[4] = 2007103844
		pgs[6] = 1976544695
		pgs[7] = 1456930860
		pgs[8] = 2385855153
		pgs[9] = 3599367465
		pgs[10] = "战斗模型.wdf"
	elseif pg == "星瀚_逍遥生_普通" then
		pgs[1] = 2809028406
		pgs[2] = 2809028406
		pgs[3] = 3517798323
		pgs[4] = 0635822686
		pgs[6] = 4199298440
		pgs[7] = 4100767959
		pgs[8] = 3470836750
		pgs[9] = 0649411872
		pgs[10] = "战斗模型.wdf"
	elseif pg == "五丁开山_虎头怪_普通" then
		pgs[1] = 2062014821
		pgs[2] = 2062014821
		pgs[3] = 2363797327
		pgs[4] = 3661893622
		pgs[6] = 1889040253
		pgs[7] = 1541320741
		pgs[8] = 1738256578
		pgs[9] = 722835269
		pgs[10] = "战斗模型.wdf"
	elseif pg == "游龙惊鸿_英女侠旧_普通" then
		pgs[1] = 17
		pgs[2] = 17
		pgs[3] = 19
		pgs[4] = 16
		pgs[6] = 368
		pgs[7] = 18
		pgs[8] = 361
		pgs[9] = 8
		pgs[10] = "战斗模型.wdf"
	elseif pg == "月华_巫蛮儿_普通" then
		pgs[1] = 1792811676
		pgs[2] = 1792811676
		pgs[3] = 4148391824
		pgs[4] = 3636515320
		pgs[6] = 3355609993
		pgs[7] = 4240539050
		pgs[8] = 3498546662
		pgs[9] = 2176161640
		pgs[10] = "战斗模型.wdf"
	elseif pg == "金龙双剪_英女侠_普通" then
		pgs[1] = 2024899093
		pgs[2] = 2024899093
		pgs[3] = 3727381444
		pgs[4] = 2340031682
		pgs[6] = 1687704448
		pgs[7] = 573860286
		pgs[8] = 1396936106
		pgs[9] = 2113820492
		pgs[10] = "战斗模型.wdf"
	elseif pg == "降魔玉杵_骨精灵_普通" then
		pgs[1] = 3334934404
		pgs[2] = 3334934404
		pgs[3] = 3854049791
		pgs[4] = 1672795955
		pgs[6] = 2227811489
		pgs[7] = 2499485952
		pgs[8] = 265141570
		pgs[9] = 1457344498
		pgs[10] = "战斗模型.wdf"
	elseif pg == "青藤玉树_玄彩娥_普通" then
		pgs[1] = 2503627450
		pgs[2] = 2503627450
		pgs[3] = 3110285636
		pgs[4] = 1992978765
		pgs[6] = 3809375891
		pgs[7] = 2547741955
		pgs[8] = 4282993605
		pgs[9] = 462404473
		pgs[10] = "战斗模型.wdf"
	elseif pg == "仙人指路_英女侠_普通" then
		pgs[1] = 1536229276
		pgs[2] = 1536229276
		pgs[3] = 3074198838
		pgs[4] = 781619913
		pgs[6] = 2533848487
		pgs[7] = 4069179535
		pgs[8] = 1975224690
		pgs[9] = 1681443649
		pgs[10] = "战斗模型.wdf"
	elseif pg == "破魄_虎头怪_普通" then
		pgs[1] = 66503730
		pgs[2] = 66503730
		pgs[3] = 2454517146
		pgs[4] = 147936745
		pgs[6] = 915959107
		pgs[7] = 2946347461
		pgs[8] = 1892595080
		pgs[9] = 1320517389
		pgs[10] = "战斗模型.wdf"
	elseif pg == "灵犀神剑_逍遥生_普通" then
		pgs[1] = 4048939390
		pgs[2] = 4048939390
		pgs[3] = 2956972471
		pgs[4] = 91663105
		pgs[6] = 1499210091
		pgs[7] = 3108724735
		pgs[8] = 3464352844
		pgs[9] = 1984805790
		pgs[10] = "战斗模型.wdf"
	elseif pg == "毒牙_骨精灵_普通" then
		pgs[1] = 991315240
		pgs[2] = 991315240
		pgs[3] = 1625283763
		pgs[4] = 2524067340
		pgs[6] = 1149167732
		pgs[7] = 1113746352
		pgs[8] = 590367663
		pgs[9] = 288632015
		pgs[10] = "战斗模型.wdf"
	elseif pg == "秋水落霞_舞天姬_普通" then
		pgs[1] = 1202111998
		pgs[2] = 1202111998
		pgs[3] = 2037655830
		pgs[4] = 3049902097
		pgs[6] = 690602552
		pgs[7] = 1342960347
		pgs[8] = 3838882501
		pgs[9] = 1483726919
		pgs[10] = "战斗模型.wdf"
	elseif pg == "凤翼流珠_羽灵神_普通" then
		pgs[1] = 3353149334
		pgs[2] = 3353149334
		pgs[3] = 1074224727
		pgs[4] = 160508292
		pgs[6] = 3400914167
		pgs[7] = 3537311768
		pgs[8] = 1351147384
		pgs[9] = 279371088
		pgs[10] = "战斗模型.wdf"
	elseif pg == "九瓣莲花_神天兵_普通" then
		pgs[1] = 697482824
		pgs[2] = 697482824
		pgs[3] = 1082828846
		pgs[4] = 1141897393
		pgs[6] = 3748355701
		pgs[7] = 616355012
		pgs[8] = 2187902545
		pgs[9] = 927580732
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙筋_狐美人_普通" then
		pgs[1] = 3760276395
		pgs[2] = 3760276395
		pgs[3] = 53105381
		pgs[4] = 3304310422
		pgs[6] = 1123548549
		pgs[7] = 478714521
		pgs[8] = 3148732170
		pgs[9] = 61804478
		pgs[10] = "战斗模型.wdf"
	elseif pg == "龙筋_英女侠_普通" then
		pgs[1] = 983659718
		pgs[2] = 983659718
		pgs[3] = 4209944243
		pgs[4] = 1910275062
		pgs[6] = 2426563525
		pgs[7] = 3749832411
		pgs[8] = 277618128
		pgs[9] = 1847888299
		pgs[10] = "战斗模型.wdf"
	elseif pg == "灵蛇_英女侠旧_普通" then
		pgs[1] = 262
		pgs[2] = 262
		pgs[3] = 264
		pgs[4] = 261
		pgs[6] = 272
		pgs[7] = 263
		pgs[8] = 265
		pgs[9] = 407
		pgs[10] = "战斗模型.wdf"
	elseif pg == "如意_飞燕女_普通" then
		pgs[1] = 361357102
		pgs[2] = 361357102
		pgs[3] = 1779832361
		pgs[4] = 1983738335
		pgs[6] = 1018400713
		pgs[7] = 3356485876
		pgs[8] = 1369851554
		pgs[9] = 4083603000
		pgs[10] = "战斗模型.wdf"
	elseif pg == "吹雪_狐美人_普通" then
		pgs[1] = 2782365575
		pgs[2] = 2782365575
		pgs[3] = 2863024953
		pgs[4] = 2075646427
		pgs[6] = 1793299889
		pgs[7] = 3492647849
		pgs[8] = 4255111126
		pgs[9] = 3079814036
		pgs[10] = "战斗模型.wdf"
	elseif pg == "阴阳_飞燕女_普通" then
		pgs[1] = 308284096
		pgs[2] = 308284096
		pgs[3] = 1909875299
		pgs[4] = 624581176
		pgs[6] = 2662103332
		pgs[7] = 338180652
		pgs[8] = 2211026380
		pgs[9] = 162524465
		pgs[10] = "战斗模型.wdf"
	elseif pg == "吹雪_英女侠旧_普通" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "战斗模型.wdf"
	elseif pg == "晃金仙绳_玄彩娥_普通" then
		pgs[1] = 2648596978
		pgs[2] = 2648596978
		pgs[3] = 3580927340
		pgs[4] = 2708781818
		pgs[6] = 1007388957
		pgs[7] = 629130124
		pgs[8] = 99182575
		pgs[9] = 359094555
		pgs[10] = "战斗模型.wdf"
	elseif pg == "撕天_狐美人_普通" then
		pgs[1] = 3142217049
		pgs[2] = 3142217049
		pgs[3] = 448133610
		pgs[4] = 3204327512
		pgs[6] = 2232734491
		pgs[7] = 2803578940
		pgs[8] = 1204989569
		pgs[9] = 3697845403
		pgs[10] = "战斗模型.wdf"
	elseif pg == "乾坤_舞天姬_普通" then
		pgs[1] = 266685423
		pgs[2] = 266685423
		pgs[3] = 2851409574
		pgs[4] = 3890863565
		pgs[6] = 1515127869
		pgs[7] = 256273093
		pgs[8] = 2425863420
		pgs[9] = 615875314
		pgs[10] = "战斗模型.wdf"
	-- 新增武器
	elseif pg == "擒龙_剑侠客_普通" then
		pgs[1] = 2066485351
		pgs[2] = 2066485351
		pgs[3] = 3200400983
		pgs[4] = 4074782058
		pgs[6] = 2739156816
		pgs[7] = 2620255839
		pgs[8] = 3164581880
		pgs[9] = 0839277591
		pgs[10] = "战斗模型.wdf"
	elseif pg == "擒龙_逍遥生_普通" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "战斗模型.wdf"
	elseif pg =="大力金刚_普通"then
	    pgs[1] = 0x3E0F197F
		pgs[2] = 0x3E0F197F
		pgs[3] = 0x67C20DC7
		pgs[4] = 0x8C14660A
		pgs[6] = 0xE3587E7B
		pgs[7] = 0x07E7D554
		pgs[8] = 0xC73FB514
		pgs[9] = 0x15BC238B
		pgs[10] ="战斗模型.wdf"
	elseif pg == "大力金刚_饰品_普通" then
		pgs[1] = 0x0EC8D421
		pgs[2] = 0x0EC8D421
		pgs[3] = 0x720E9752
		pgs[4] = 0x7AC6AF48
		pgs[6] = 0x297291AB
		pgs[7] = 0x3190913C
		pgs[8] = 0xD0B45A03
		pgs[9] = 0x32E6398F
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶大力金刚_普通"then
	    pgs[1] = 0x12706211
		pgs[2] = 0xE185B5C8
		pgs[3] = 0x233FC460
		pgs[4] = 0x5B9F487A
		pgs[6] = 0xC875C4BE
		pgs[7] = 0x6B659F88
		pgs[8] = 0x02F7CD64
		pgs[9] = 0x5E86E30F
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x1C562FE4
		pgs[12] = 0x4676514F
		pgs[16] = 0xAB649391
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶大力金刚_饰品_普通" then
		pgs[1] = 0xD126F791
		pgs[2] = 0xE8A2AB2D
		pgs[3] = 0xF43D4685
		pgs[4] = 0xD49AB61F
		pgs[6] = 0x927A5888
		pgs[7] = 0x3B84D325
		pgs[8] = 0x64026916
		pgs[9] = 0x5CA7CBB9
		pgs[10] = "战斗模型.wdf"
	elseif pg =="迭代金刚_普通" or pg =="进阶迭代金刚_普通" then
		   pgs[1] = 0x00000323
		   pgs[2] = 0x00000323
		   pgs[3] = 0x00000329
		   pgs[4] = 0x00000339
		   pgs[6] = 0x00000319
		   pgs[7] = 0x00000326
		   pgs[8] = 0x00000331
		   pgs[9] = 0x00000321
		   pgs[10] = "anhebb.wdf"
		   if pg =="进阶迭代金刚_普通" then
			   	pgs[11] = 0x00002505
				pgs[12] = 0x00002511
				pgs[16] = 0x00002508
				pgs[15] = "anhebb.wdf"
		   end
	elseif pg =="迭代金刚_饰品_普通" or pg =="进阶迭代金刚_饰品_普通" then
		   pgs[1] = 0x00000343--饰品攻击
		   pgs[2] = 0x00000343--饰品攻击二
		   pgs[3] = 0x00000345--饰品死亡
		   pgs[4] = 0x00000350--饰品防御
		   pgs[6] = 0x00000341--饰品待机
		   pgs[7] = 0x00000344--饰品施法
		   pgs[8] = 0x00000346--饰品移动
		   pgs[9] = 0x00000342--饰品挨打
		   pgs[10] = "anhebb.wdf"
	elseif pg == "哮天犬_普通" then
		pgs[1] = 0xAA0683ED
		pgs[2] = 0xEBB6057C
		pgs[3] = 0xFB7E93DE
		pgs[4] = 0x80599206
		pgs[6] = 0xDE1355D4
		pgs[7] = 0xE06F5D8A
		pgs[8] = 0x603FCBF9
		pgs[9] = 0x9856C8FF
		pgs[10] = "战斗模型.wdf"
	elseif pg == "帮派妖兽_普通" then
		pgs[1] = 0x0001957A
		pgs[2] = 0x0001957A
		pgs[3] = 0x00017EBD
		pgs[4] = 0x00018A35
		pgs[6] = 0x0001738D
		pgs[7] = 0x0001C235
		pgs[8] = 0x0001ABEB
		pgs[9] = 0x00016815
		pgs[10] = "战斗模型.wdf"
	-- 普通召唤兽
    elseif pg =="狂豹兽形_普通"then
	    pgs[1] = 0x00185B2F
		pgs[2] = 0x001852BC
		pgs[3] = 0x00184172
		pgs[4] = 0x00184A18
		pgs[6] = 0x00186365
		pgs[7] = 0x00187CA2
		pgs[8] = 0x0018746D
		pgs[9] = 0x0018306E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶狂豹兽形_普通"then
	    pgs[1] = 0x87EA8781
		pgs[2] = 0x598F2E29
		pgs[3] = 0x438491B0
		pgs[4] = 0x47D85C84
		pgs[6] = 0x4C2863D5
		pgs[7] = 0xB83FD89C
		pgs[8] = 0xE4C9CECB
		pgs[9] = 0x0A77DD67
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xF709454A
		pgs[12] = 0xC0021BB9
		pgs[16] = 0xF8B6FF97
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶狂豹兽形_饰品_普通"then
	    pgs[1] = 0x31DA7076
		pgs[2] = 0x514F5FE2
		pgs[3] = 0xC886D0D5
		pgs[4] = 0x54CFFF9A
		pgs[6] = 0x322350DC
		pgs[7] = 0x0EB37F84
		pgs[8] = 0xC905D51B
		pgs[9] = 0xF14E0073
		pgs[10] ="战斗模型.wdf"
    elseif pg =="狂豹人形_普通"then
	    pgs[1] = 0x0017FC84
		pgs[2] = 0x0017F426
		pgs[3] = 0x0017E306
		pgs[4] = 0x0017EB97
		pgs[6] = 0x0017DABD
		pgs[7] = 0x00181DA3
		pgs[8] = 0x00181583
		pgs[9] = 0x0017D22C
		pgs[10] ="战斗模型.wdf"
    elseif pg =="狂豹人形_饰品_普通"then
	    pgs[1] = 0x0017FC84
		pgs[2] = 0x0017F426
		pgs[3] = 0x0017E306
		pgs[4] = 0x0017EB97
		pgs[6] = 0x0017DABD
		pgs[7] = 0x00181DA3
		pgs[8] = 0x00181583
		pgs[9] = 0x0017D22C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶狂豹人形_普通"then
	    pgs[1] = 0x3DC7DB59
		pgs[2] = 0x910E8FDF
		pgs[3] = 0x5D2CDD31
		pgs[4] = 0xA960269A
		pgs[6] = 0xE9E47BF8
		pgs[7] = 0xC04E7031
		pgs[8] = 0xEA42D997
		pgs[9] = 0x4D2FA042
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x2C3F4457
		pgs[12] = 0x4CC37FE1
		pgs[16] = 0x79878052
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶狂豹人形_饰品_普通" then
		pgs[1] = 0xEB29D8FB
		pgs[2] = 0x624283C6
		pgs[3] = 0xE21A32F7
		pgs[4] = 0xF19004F0
		pgs[6] = 0x031727F7
		pgs[7] = 0x7A1779B5
		pgs[8] = 0xF894CD68
		pgs[9] = 0xBD79A6D5
		pgs[10] = "战斗模型.wdf"
	elseif pg == "毗舍童子_普通" then
	    pgs[1] = 0xF449F7B5
		pgs[2] = 0x15A6778D
		pgs[3] = 0x3976A73D
		pgs[4] = 0xFC2044B9
		pgs[6] = 0x60D45B9C
        pgs[7] = 0x371990E9
        pgs[8] = 0x71BFCD9C
        pgs[9] = 0xF63A1857
        pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x9871D7CD
		pgs[12] = 0x13AF98E4
		pgs[16] = 0x725F1DF7
		pgs[15] = "普通模型.wdf"
    elseif pg == "毗舍童子_饰品_普通" then
	    pgs[1] = 0x54297F83
		pgs[2] = 0x3994DA3A
		pgs[3] = 0x616C7807
		pgs[4] = 0x79EC5379
		pgs[6] = 0xB24353BD
        pgs[7] = 0xAC92D991
        pgs[8] = 0x84328085
        pgs[9] = 0x21F96FC4
        pgs[10] = "战斗模型.wdf"
    elseif pg == "进阶毗舍童子_普通" then
		pgs[1] = 0x1A04C90E
		pgs[2] = 0x0AF863CF
		pgs[3] = 0xCCDDD94C
		pgs[4] = 0x42A2E9E0
		pgs[6] = 0x7C15F7DE
        pgs[7] = 0x1CB769CA
        pgs[8] = 0x1C29D8BC
        pgs[9] = 0x40D008F4
        pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xF75396E5
		pgs[12] = 0xED474523
		pgs[15] = "普通模型.wdf"
		pgs[16] = 0x1763975B
    elseif pg == "进阶毗舍童子_饰品_普通" then
		pgs[1] = 0x7617EB84
		pgs[2] = 0x9F573325
		pgs[3] = 0xA052100D
		pgs[4] = 0x704014FD
		pgs[6] = 0xD8889A17
		pgs[7] = 0x820B8C89
		pgs[8] = 0xDA5B6CF9
		pgs[9] = 0xB931B053
		pgs[10] = "战斗模型.wdf"

	elseif pg == "流浪剑客_普通" then
	    pgs[1] = 0xAB3F493A
		pgs[2] = 0xAB3F493A
		pgs[3] = 0x6DED77DA
		pgs[4] = 0x4286FB27
		pgs[6] = 0xA9DD17BC
        pgs[7] = 0x0D6E6F43
        pgs[8] = 0x4BC4A592
        pgs[9] = 0xA1C77A74
        pgs[10] = "战斗模型.wdf"
	elseif pg == "白熊_普通" then
	    pgs[1] = 0x881F5EB3
		pgs[2] = 0x881F5EB3
		pgs[3] = 0x6429E0B5
		pgs[4] = 0x1AEAF718
		pgs[6] = 0x24F343D2
        pgs[7] = 0x3E1A5B78
        pgs[8] = 0x1A43CBEE
        pgs[9] = 0xE08BBB1A
        pgs[10] = "战斗模型.wdf"
    elseif pg == "白熊_饰品_普通" then
	    pgs[1] = 0xE950CCDE
		pgs[2] = 0xE950CCDE
		pgs[3] = 0x86793301
		pgs[4] = 0xE69E56FC
		pgs[6] = 0x308185DC
        pgs[7] = 0x24BEFE0C
        pgs[8] = 0x34814E10
        pgs[9] = 0x7BED95E0
        pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶白熊_普通"then
	    pgs[1] = 0x36221458
		pgs[2] = 0x8F754AB3
		pgs[3] = 0x9D440DE2
		pgs[4] = 0x87074A6D
		pgs[6] = 0x456ED9AE
		pgs[7] = 0x69F0C9F3
		pgs[8] = 0xC2E91BB6
		pgs[9] = 0x67374C54
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x48DB4B22
		pgs[12] = 0xA8EE7F08
		pgs[16] = 0x5EC0E760
		pgs[15] = "普通模型.wdf"
    elseif pg =="进阶白熊_饰品_普通"then
	    pgs[1] = 0xDF7AC4D6
		pgs[2] = 0x16137F88
		pgs[3] = 0xCE8A12A8
		pgs[4] = 0x96524F4A
		pgs[6] = 0x2EEA632F
		pgs[7] = 0xEA437C36
		pgs[8] = 0x043DDF48
		pgs[9] = 0x4CBA461B
		pgs[10] ="战斗模型.wdf"
	elseif pg == "大蝙蝠_普通" then
	    pgs[1] = 0x000A1DC2
		pgs[2] = 0x000A1DC2
		pgs[3] = 0x000A0BC9
		pgs[4] = 0x000A14DF
		pgs[6] = 0x000A02FB
        pgs[7] = 0x000A384F
        pgs[8] = 0x000A2FAA
        pgs[9] = 0x0009F9E5
        pgs[10] = "战斗模型.wdf"
	elseif pg == "大海龟_普通" then
	    pgs[1] = 0x000AC177
		pgs[2] = 0x000AC177
		pgs[3] = 0x000AB118
		pgs[4] = 0x000AB961
		pgs[6] = 0x000AA917
        pgs[7] = 0x000AD99D
        pgs[8] = 0x000AD1C5
        pgs[9] = 0x000AA0CE
        pgs[10] = "战斗模型.wdf"
    elseif pg == "海星_普通" then
		pgs[1] = 2925295348
		pgs[2] = 1438262125
		pgs[3] = 1252052338
		pgs[4] = 2984429886
		pgs[6] = 435482985
		pgs[7] = 821840372
		pgs[8] = 2533401592
		pgs[9] = 1325924528
		pgs[10] = "战斗模型.wdf"
	elseif pg == "浣熊_普通" then
		pgs[1] = 3067845835
		pgs[2] = 3067845835
		pgs[3] = 4280797854
		pgs[4] = 4037864245
		pgs[6] = 2856658178
		pgs[7] = 2306495634
		pgs[8] = 3507827561
		pgs[9] = 554890743
		pgs[10] = "战斗模型.wdf"
	elseif pg == "地狱战神_普通" then
	    pgs[1] = 0x3D5634A3
		pgs[2] = 0x3D5634A3
		pgs[3] = 0xDF5D2760
		pgs[4] = 0x8F487B17
		pgs[6] = 0x12807229
        pgs[7] = 0x1A6B6FFB
        pgs[8] = 0xA4FAC284
        pgs[9] = 0x5B13FA1C
        pgs[10] = "战斗模型.wdf"
    elseif pg == "地狱战神_饰品_普通" then
	    pgs[1] = 0x5AC50CEA
		pgs[2] = 0x5AC50CEA
		pgs[3] = 0x1E9C38EE
		pgs[4] = 0x488F9433
		pgs[6] = 0x03068882
        pgs[7] = 0xCCEDD5F8
        pgs[8] = 0x1F4402B0
        pgs[9] = 0x4489B84F
        pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶地狱战神_普通"then
	    pgs[1] = 0x72A69AC3
		pgs[2] = 0xAF2C4C75
		pgs[3] = 0x602C6BA1
		pgs[4] = 0xC4F27046
		pgs[6] = 0x103A0FFA
		pgs[7] = 0x958AC02C
		pgs[8] = 0x0A0351C4
		pgs[9] = 0x28533A4E
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x5E3D1399
		pgs[12] = 0x37697F1F
		pgs[16] = 0xA91A54B2
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶地狱战神_饰品_普通"then
	    pgs[1] = 0xD3E28906
		pgs[2] = 0x17665192
		pgs[3] = 0xC073FD07
		pgs[4] = 0xA7CACBB3
		pgs[6] = 0x24261D7F
		pgs[7] = 0x32E859EF
		pgs[8] = 0xE70D6D3D
		pgs[9] = 0xA4188017
		pgs[10] ="战斗模型.wdf"
	elseif pg == "赌徒_普通" then
	    pgs[1] = 0x000C9C40
		pgs[2] = 0x000C9C40
		pgs[3] = 0x000C8F27
		pgs[4] = 0x000C95CD
		pgs[6] = 0x000C88C9
        pgs[7] = 0x000CAF7D
        pgs[8] = 0x000CA948
        pgs[9] = 0x000C8223
        pgs[10] = "战斗模型.wdf"
	elseif pg == "风伯_普通" then
	    pgs[1] = 0x9383411F
		pgs[2] = 0x9383411F
		pgs[3] = 0x972CDC33
		pgs[4] = 0xB478D85B
		pgs[6] = 0xF879501E
        pgs[7] = 0x71146663
        pgs[8] = 0xBBEDAA2D
        pgs[9] = 0x129ACE33
        pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶风伯_普通"then
	    pgs[1] = 0xAB730806
		pgs[2] = 0x1C3519F4
		pgs[3] = 0x0B4D5B60
		pgs[4] = 0xDD0ABC12
		pgs[6] = 0xE6944AFD
		pgs[7] = 0x421CDC1C
		pgs[8] = 0x4975EB93
		pgs[9] = 0xE91519F9
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x13E62D29
		pgs[12] = 0x0FE6FD88
		pgs[16] = 0xEA7E19AD
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶风伯_饰品_普通"then
	   pgs[1] = 0x83F444A2
	   pgs[2] = 0x61E56853
	   pgs[3] = 0x6508E3BC
	   pgs[4] = 0xB4986B9B
	   pgs[6] = 0xBAEAA6D1
	   pgs[7] = 0xF32E8EAD
	   pgs[8] = 0xA891F58F
	   pgs[9] = 0x1691550D
	   pgs[10] = "战斗模型.wdf"
	elseif pg == "凤凰_普通" then
	    pgs[1] = 0x6B914BF3
		pgs[2] = 0x6B914BF3
		pgs[3] = 0x0DDF2430
		pgs[4] = 0x22883068
		pgs[6] = 0x2DD87623
        pgs[7] = 0x0B5E6653
        pgs[8] = 0x05E61447
        pgs[9] = 0xA3DA2B3C
        pgs[10] = "战斗模型.wdf"
    elseif pg == "凤凰_饰品_普通" then
		pgs[1] = 0x8A1F82A6
		pgs[2] = 0x8A1F82A6
		pgs[3] = 0xD87111EC
		pgs[4] = 0xB744D6BA
		pgs[6] = 0xBF90783B
		pgs[7] = 0x68260D8D
		pgs[8] = 0xCF8F5168
		pgs[9] = 0x88D490D8
		pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶凤凰_普通"then
	    pgs[1] = 0xB9144194
		pgs[2] = 0x531998EA
		pgs[3] = 0x2FC72F35
		pgs[4] = 0xBED32A52
		pgs[6] = 0x0CC023FE
		pgs[7] = 0x441E6903
		pgs[8] = 0xE441F928
		pgs[9] = 0x0CF889CA
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x84406F3C
		pgs[12] = 0x4F4A5C60
		pgs[16] = 0xA0C0A40E
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶凤凰_饰品_普通"then
	    pgs[1] = 0xFC9CEFAA
		pgs[2] = 0xB2EAFE77
		pgs[3] = 0x005AF99F
		pgs[4] = 0x08FD84B8
		pgs[6] = 0x7D91B644
		pgs[7] = 0xC746F784
		pgs[8] = 0xAF5D7B92
		pgs[9] = 0xC90E04F1
		pgs[10] ="战斗模型.wdf"
	elseif pg == "芙蓉仙子_普通" then
	    pgs[1] = 0x3A696908
		pgs[2] = 0x3A696908
		pgs[3] = 0x0C5137A5
		pgs[4] = 0xDA0F8408
		pgs[6] = 0x5DAD549B
        pgs[7] = 0x8260E356
        pgs[8] = 0xB4028C57
        pgs[9] = 0x14EFDFC9
        pgs[10] = "战斗模型.wdf"
    elseif pg == "芙蓉仙子_饰品_普通" then
	    pgs[1] = 0xE3743FF6
		pgs[2] = 0xE3743FF6
		pgs[3] = 0xB9AE1DBE
		pgs[4] = 0x886383EE
		pgs[6] = 0xB43F2577
        pgs[7] = 0x666E547D
        pgs[8] = 0x5B2A2A3C
        pgs[9] = 0x60EF4DD7
        pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶芙蓉仙子_普通"then
	    pgs[1] = 0x080F22AE
		pgs[2] = 0x71C7FAC0
		pgs[3] = 0x91C59A1F
		pgs[4] = 0x5D9AB3E1
		pgs[6] = 0x5A4AB7D0
		pgs[7] = 0xA0B65C4E
		pgs[8] = 0x96BC94AC
		pgs[9] = 0x4F65A668
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x85B7D239
		pgs[12] = 0x42052A70
		pgs[16] = 0x4FF04ACC
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶芙蓉仙子_饰品_普通"then
	    pgs[1] = 0x4B0B38A2
		pgs[2] = 0xE7527DDE
		pgs[3] = 0xB66F315B
		pgs[4] = 0xFC2C0A43
		pgs[6] = 0xFC93FE17
		pgs[7] = 0xCB6D7FCA
		pgs[8] = 0xB1ABD7F3
		pgs[9] = 0xF46A1607
		pgs[10] ="战斗模型.wdf"
	elseif pg == "蛤蟆精_普通" then
	    pgs[1] = 0x000DE731
		pgs[2] = 0x000DE731
		pgs[3] = 0x000DD6D2
		pgs[4] = 0x000DDF1B
		pgs[6] = 0x000DCED1
        pgs[7] = 0x000DFF57
        pgs[8] = 0x000DF77F
        pgs[9] = 0x000DC688
        pgs[10] = "战斗模型.wdf"
	elseif pg == "九头精怪_普通" then
	    pgs[1] = 0x00165BB8
		pgs[2] = 0x00165BB8
		pgs[3] = 0x001648A9
		pgs[4] = 0x0016524A
		pgs[6] = 0x00163F50
        pgs[7] = 0x00168117
        pgs[8] = 0x001677E7
        pgs[9] = 0x001635AF
        pgs[10] = "战斗模型.wdf"
	elseif pg == "猪八戒_普通" then
	    pgs[1] = 0x00315EE9
		pgs[2] = 0x00315EE9
		pgs[3] = 0x00314E1A
		pgs[4] = 0x0031569B
		pgs[6] = 0x003145E1
        pgs[7] = 0x00317FC8
        pgs[8] = 0x003177B8
        pgs[9] = 0x00313D60
        pgs[10] = "战斗模型.wdf"
	elseif pg == "老虎_普通" then
	    pgs[1] = 0x0018E295
		pgs[2] = 0x0018E295
		pgs[3] = 0x0018D5AC
		pgs[4] = 0x0018DC3A
		pgs[6] = 0x0018CF66
        pgs[7] = 0x0018F58A
        pgs[8] = 0x0018EF6D
        pgs[9] = 0x0018C8D8
        pgs[10] = "战斗模型.wdf"
	elseif pg == "蛟龙_普通" then
	    pgs[1] = 0xC01BC830
		pgs[2] = 0xC01BC830
		pgs[3] = 0x01846532
		pgs[4] = 0x213AE16A
		pgs[6] = 0x034598C3
        pgs[7] = 0x110072C0
        pgs[8] = 0xB157E173
        pgs[9] = 0x5FE3F3C2
        pgs[10] = "战斗模型.wdf"
    elseif pg == "蛟龙_饰品_普通" then
	    pgs[1] = 0xACD1EEF4
		pgs[2] = 0xACD1EEF4
		pgs[3] = 0x5D452A49
		pgs[4] = 0xBE9F2A37
		pgs[6] = 0xA695F1EA
        pgs[7] = 0x48BDE373
        pgs[8] = 0x60E2FE6A
        pgs[9] = 0x1948F4DF
        pgs[10] = "战斗模型.wdf"
    elseif pg =="进阶蛟龙_普通"then
	    pgs[1] = 0xF823CB5B
		pgs[2] = 0xA815AA97
		pgs[3] = 0x79423CC9
		pgs[4] = 0x644C7AD6
		pgs[6] = 0x48915E95
		pgs[7] = 0x77FAB65D
		pgs[8] = 0x768EC51E
		pgs[9] = 0x48971844
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x30C6F4C7
		pgs[12] = 0x15900F1C
		pgs[16] = 0x4D803032
		pgs[15] = "普通模型.wdf"
    elseif pg == "进阶蛟龙_饰品_普通"then
	    pgs[1] = 0xFAC1004A
		pgs[2] = 0x65554FC5
		pgs[3] = 0xFD6B9032
		pgs[4] = 0xBAE033EB
		pgs[6] = 0xA552B800
		pgs[7] = 0xB923763C
		pgs[8] = 0x32361ABC
		pgs[9] = 0x073143DE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="天将_普通"then
	    pgs[1] = 0xE513139F
	    pgs[2] = 0xE513139F
	    pgs[3] = 0x9648321B
	    pgs[4] = 0xC5C3FCC4
	    pgs[6] = 0x04C8C142
	    pgs[7] = 0xB70488BD
	    pgs[8] = 0x9395B542
	    pgs[9] = 0x884B84CA
	    pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶天将_普通"then
	    pgs[1] = 0xAF5E9D11
		pgs[2] = 0xD191238C
		pgs[3] = 0x7AFD84CB
		pgs[4] = 0xF8941B27
		pgs[6] = 0xB90ED478
		pgs[7] = 0x38A3BA7A
		pgs[8] = 0x2F969199
		pgs[9] = 0x666FA5FF
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xBE65728F
		pgs[12] = 0x9B29E8FC
		pgs[16] = 0xB2854590
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶天将_饰品_普通"then
	   pgs[1] = 0x8EC9BD35
	   pgs[2] = 0x355FC178
	   pgs[3] = 0x9FDC474F
	   pgs[4] = 0xA5CEB0A1
	   pgs[6] = 0xBBCC16DF
	   pgs[7] = 0xCA0F2175
	   pgs[8] = 0xAD9C865A
	   pgs[9] = 0xBD1824C4
	   pgs[10] = "战斗模型.wdf"
	elseif pg =="如意仙子_普通"then
		pgs[1] = 0xDD102EC4
		pgs[2] = 0xDD102EC4
		pgs[3] = 0x04EB45F5
		pgs[4] = 0xE436F2B8
		pgs[6] = 0xA2C8444D
		pgs[7] = 0x07FF0EF2
		pgs[8] = 0x9300895F
		pgs[9] = 0x27F8E12A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="如意仙子_饰品_普通"then
		pgs[1] = 0x7E9C3C50
		pgs[2] = 0x7E9C3C50
		pgs[3] = 0x2FBC9E75
		pgs[4] = 0xDC72D73F
		pgs[6] = 0x03E06944
		pgs[7] = 0xC4FFF856
		pgs[8] = 0xF84BA110
		pgs[9] = 0xA0D951B1
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶如意仙子_普通"then
	    pgs[1] = 0x504C8CCA
		pgs[2] = 0x01197058
		pgs[3] = 0x132F1FB6
		pgs[4] = 0xF8B7009E
		pgs[6] = 0xF80DD9AD
		pgs[7] = 0x81042AE4
		pgs[8] = 0x4198CF0C
		pgs[9] = 0x28D1CE66
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xB6EED6FA
		pgs[12] = 0x65F5A965
		pgs[16] = 0x2BF4CCE0
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶如意仙子_饰品_普通"then
	    pgs[1] = 0x17537C8C
		pgs[2] = 0xF4B861D9
		pgs[3] = 0x32CCB8F3
		pgs[4] = 0x9237965D
		pgs[6] = 0xB4323647
		pgs[7] = 0x145BA64B
		pgs[8] = 0x51A5BF1A
		pgs[9] = 0x4EA4E8E0
		pgs[10] ="战斗模型.wdf"
	elseif pg =="牛头_普通"then
		pgs[1] = 1977082861
		pgs[2] = 1977082861
		pgs[3] = 1287383642
		pgs[4] = 86875663
		pgs[6] = 3873955396
		pgs[7] = 1011868006
		pgs[8] = 3412058170
		pgs[9] = 2824767270
		pgs[10] ="战斗模型.wdf"
	elseif pg =="牛头_饰品_普通"then
		pgs[1] = 0x7D011E42
		pgs[2] = 0x7D011E42
		pgs[3] = 0x2233295C
		pgs[4] = 0x8B8273AD
		pgs[6] = 0xEF5E5215
		pgs[7] = 0x239B8456
		pgs[8] = 0x602DCB23
		pgs[9] = 0xF5F422A2
		pgs[10] ="战斗模型.wdf"
	elseif pg =="黑熊_普通"then
		pgs[1] = 0x00105310
		pgs[2] = 0x00105310
		pgs[3] = 0x0010457F
		pgs[4] = 0x0010457F
		pgs[6] = 0x00103EE5
		pgs[7] = 0x00106701
		pgs[8] = 0x00106090
		pgs[9] = 0x00103803
		pgs[10] ="战斗模型.wdf"
	elseif pg =="小龙女_普通"then
		pgs[1] = 0x002851A5
		pgs[2] = 0x002851A5
		pgs[3] = 0x00284156
		pgs[4] = 0x00284997
		pgs[6] = 0x0028395D
		pgs[7] = 0x002869B3
		pgs[8] = 0x002861E3
		pgs[9] = 0x0028311C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="花妖_普通"then
		pgs[1] = 0x0012A79D
		pgs[2] = 0x0012A79D
		pgs[3] = 0x00129A2A
		pgs[4] = 0x0012A0FD
		pgs[6] = 0x0012939F
		pgs[7] = 0x0012BB61
		pgs[8] = 0x0012B4FF
		pgs[9] = 0x00128CCC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="雨师_普通"then
		pgs[1] = 0x408DE185
		pgs[2] = 0x408DE185
		pgs[3] = 0xE8142660
		pgs[4] = 0x113B69E8
		pgs[6] = 0x59B3FCAD
		pgs[7] = 0xA9847201
		pgs[8] = 0x5D111514
		pgs[9] = 0xBC1BD809
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶雨师_普通"then
	    pgs[1] = 0x7E79FDC4
		pgs[2] = 0xADCAF1D3
		pgs[3] = 0xBF6028A3
		pgs[4] = 0xC3C6CB3F
		pgs[6] = 0x18EF6634
		pgs[7] = 0xFC49420C
		pgs[8] = 0x670544A4
		pgs[9] = 0xC1476207
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x95C26E4F
		pgs[12] = 0xA45D4B32
		pgs[16] = 0x64354FE0
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶雨师_饰品_普通"then
	    pgs[1] = 0x0A771A69
		pgs[2] = 0x879B0739
		pgs[3] = 0x7FC8DBDB
		pgs[4] = 0x997CB8C1
		pgs[6] = 0x2DB97952
		pgs[7] = 0x530CFEA0
		pgs[8] = 0xD4758CD0
		pgs[9] = 0x565988A0
		pgs[10] ="战斗模型.wdf"
	elseif pg =="牛妖_普通"then
	    pgs[1] = 0x7FBB3BAC
		pgs[2] = 0x7FBB3BAC
		pgs[3] = 0x5C0510BA
		pgs[4] = 0x1CD638BF
		pgs[6] = 0xF58E06E8
		pgs[7] = 0xB3ED5B24
		pgs[8] = 0x0CBE58B2
		pgs[9] = 0x51A98BB9
		pgs[10] ="战斗模型.wdf"
	elseif pg =="牛幺_普通"then
	    pgs[1] = 0x7FBB3BAC
		pgs[2] = 0x7FBB3BAC
		pgs[3] = 0x5C0510BA
		pgs[4] = 0x1CD638BF
		pgs[6] = 0xF58E06E8
		pgs[7] = 0xB3ED5B24
		pgs[8] = 0x0CBE58B2
		pgs[9] = 0x51A98BB9
		pgs[10] ="战斗模型.wdf"
	elseif pg =="山贼_普通"then
	    pgs[1] = 0x0020CEE2
		pgs[2] = 0x0020CEE2
		pgs[3] = 0x0020C135
		pgs[4] = 0x0020C825
		pgs[6] = 0x0020BA8D
		pgs[7] = 0x0020E2FD
		pgs[8] = 0x0020DC7E
		pgs[9] = 0x0020B39D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="护卫_普通"then
	    pgs[1] = 0x00126ADE
		pgs[2] = 0x00126ADE
		pgs[3] = 0x00125DF3
		pgs[4] = 0x00126482
		pgs[6] = 0x001257AC
		pgs[7] = 0x00127DD6
		pgs[8] = 0x001277B8
		pgs[9] = 0x0012511D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="兔子怪_普通"then
	    pgs[1]=0x0024F9AA
		pgs[2]=0x0024F9AA
		pgs[3]=0x0024E907
		pgs[4]=0x0024F172
		pgs[6]=0x0024E0E4
		pgs[7]=0x00251236
		pgs[8]=0x00250A3C
		pgs[9]=0x0024D879
		pgs[10] ="战斗模型.wdf"
	elseif pg =="沙僧_普通"then
        pgs[1]=0x00208B55
		pgs[2]=0x00208B55
		pgs[3]=0x00207E5E
		pgs[4]=0x002084F3
		pgs[6]=0x00207811
		pgs[7]=0x0020A484
		pgs[8]=0x00209E60
		pgs[9]=0x0020717C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="孙悟空_普通"then
        pgs[1]=0x00235589
		pgs[2]=0x00235589
		pgs[3]=0x0023445C
		pgs[4]=0x00234D0C
		pgs[6]=0x00233BF4
		pgs[7]=0x00237724
		pgs[8]=0x00236EE5
		pgs[9]=0x00233344
		pgs[10] ="战斗模型.wdf"
	elseif pg =="骷髅怪_普通"then
        pgs[1]=0x0017A644
		pgs[2]=0x0017A644
		pgs[3]=0x0017953B
		pgs[4]=0x00179DD9
		pgs[6]=0x00178CE5
		pgs[7]=0x0017BF69
		pgs[8]=0x0017B73C
		pgs[9]=0x00178447
		pgs[10] ="战斗模型.wdf"
	elseif pg =="黑山老妖_普通"then
        pgs[1]=0x388A4093
		pgs[2]=0x388A4093
		pgs[3]=0x5A9BF84E
		pgs[4]=0x28365622
		pgs[6]=0x759DB60F
		pgs[7]=0x1E4B0077
		pgs[8]=0xA75F0C8E
		pgs[9]=0xD0C5FFC8
		pgs[10] ="战斗模型.wdf"
    elseif pg == "黑山老妖_饰品_普通" then
		pgs[1] = 0xBDC9DB09
		pgs[2] = 0xBDC9DB09
		pgs[3] = 0x3887EEDE
		pgs[4] = 0x3A904439
		pgs[6] = 0x266C5FE5
		pgs[7] = 0x7DAC4B6A
		pgs[8] = 0xA75F0C8E
		pgs[9] = 0xE88E7F50
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶黑山老妖_普通"then
	    pgs[1] = 0x5DE2E1D7
		pgs[2] = 0x18B4A333
		pgs[3] = 0xE5768F24
		pgs[4] = 0x3655BA0F
		pgs[6] = 0xFA5075B4
		pgs[7] = 0x20E38EFD
		pgs[8] = 0x94258F07
		pgs[9] = 0x6F9C7D69
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x123E5270
		pgs[12] = 0x7EEDB37D
		pgs[16] = 0x56493E7A
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶黑山老妖_饰品_普通" then
		pgs[1] = 0x14912994
		pgs[2] = 0x02D4F692
		pgs[3] = 0x334042CC
		pgs[4] = 0xD1F403A2
		pgs[6] = 0xC7F4096B
		pgs[7] = 0x62AED9B4
		pgs[8] = 0x01E2F6F9
		pgs[9] = 0x1C2E6B9E
		pgs[10] = "战斗模型.wdf"
	elseif pg =="僵尸_普通"then
        pgs[1]=0x0014B2EB
		pgs[2]=0x0014B2EB
		pgs[3]=0x0014A622
		pgs[4]=0x2FB5322A
		pgs[6]=0x00149FEC
		pgs[7]=0x0014C5B0
		pgs[8]=0x0014BFA3
		pgs[9]=0x0014996E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="马面_普通"then
        pgs[1]=0x001CE7BC
		pgs[2]=0x001CE7BC
		pgs[3]=0x001CD9FB
		pgs[4]=0x001CE0F5
		pgs[6]=0x001CD349
		pgs[7]=0x001CFBF5
		pgs[8]=0x001CF56C
		pgs[9]=0x001CCC4F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="马面_饰品_普通"then
        pgs[1]=0x6DEB11CE
		pgs[2]=0x6DEB11CE
		pgs[3]=0x50B2FE99
		pgs[4]=0x6B9F50F6
		pgs[6]=0x1FBDD393
		pgs[7]=0x2B672E76
		pgs[8]=0x81604323
		pgs[9]=0x6621AC39
		pgs[10] ="战斗模型.wdf"
	elseif pg =="黑熊精_普通"then
        pgs[1]=0x00109873
		pgs[2]=0x00109873
		pgs[3]=0x00108810
		pgs[4]=0x0010905B
		pgs[6]=0x0010800D
		pgs[7]=0x0010B09F
		pgs[8]=0x0010A8C5
		pgs[9]=0x001077C2
		pgs[10] ="战斗模型.wdf"
	elseif pg =="龟丞相_普通"then
        pgs[1]=0x000F0278
		pgs[2]=0x000F0278
		pgs[3]=0x000EF1C1
		pgs[4]=0x000EFA36
		pgs[6]=0x000F0A7D
		pgs[7]=0x000F2327
		pgs[8]=0x000F1B23
		pgs[9]=0x000EE994
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蜘蛛精_普通"then
        pgs[1]=0x00309776
		pgs[2]=0x00309776
		pgs[3]=0x00308713
		pgs[4]=0x00308F5E
		pgs[6]=0x00307F10
		pgs[7]=0x0030AFA2
		pgs[8]=0x0030A7C8
		pgs[9]=0x003076C5
		pgs[10] ="战斗模型.wdf"
	elseif pg =="雷鸟人_普通"then
        pgs[1]=0x001947EE
		pgs[2]=0x001947EE
		pgs[3]=0x0019371F
		pgs[4]=0x00193FA0
		pgs[6]=0x00192EE6
		pgs[7]=0x001960BC
		pgs[8]=0x001958AC
		pgs[9]=0x00192665
		pgs[10] ="战斗模型.wdf"
	elseif pg =="雷鸟人_饰品_普通"then
        pgs[1]=0xF9CFFFED
		pgs[2]=0xF9CFFFED
		pgs[3]=0x0738AAE2
		pgs[4]=0x229D72AE
		pgs[6]=0xD2286C28
		pgs[7]=0x149556A1
		pgs[8]=0xB0F41230
		pgs[9]=0xAFFA205D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶雷鸟人_普通"then
	    pgs[1] = 0x6C7DE28C
		pgs[2] = 0xA4462E00
		pgs[3] = 0x3AA0420A
		pgs[4] = 0xA8E9E56A
		pgs[6] = 0xE3FB3536
		pgs[7] = 0x9F6B6DCE
		pgs[8] = 0x9134A8D8
		pgs[9] = 0x5B455BAB
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x7869DD13
		pgs[12] = 0x66FB57C3
		pgs[16] = 0x840082DF
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶雷鸟人_饰品_普通" then
		pgs[1] = 0x3282FAD7
		pgs[2] = 0x28F477A3
		pgs[3] = 0x82C48D61
		pgs[4] = 0x78F5F786
		pgs[6] = 0x0B696995
		pgs[7] = 0x7A02444F
		pgs[8] = 0xFD61A5D5
		pgs[9] = 0x1D9FFB3A
		pgs[10] = "战斗模型.wdf"
	elseif pg =="巡游天神_普通"then
        pgs[1]=0x1E2DDE33
		pgs[2]=0x1E2DDE33
		pgs[3]=0xF781FFDE
		pgs[4]=0xA8FF07E2
		pgs[6]=0xE3E15EAC
		pgs[7]=0xB2D419B5
		pgs[8]=0xAC61B31B
		pgs[9]=0x678383BC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="巡游天神_饰品_普通"then
        pgs[1]=0xB62B5D4D
		pgs[2]=0xB62B5D4D
		pgs[3]=0x4571340F
		pgs[4]=0xC6A9D45D
		pgs[6]=0x0F12BC80
		pgs[7]=0xE516D9F4
		pgs[8]=0x41890659
		pgs[9]=0x25F95B6C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶巡游天神_普通"then
	    pgs[1] = 0xD019B465
		pgs[2] = 0x61626CF7
		pgs[3] = 0x38DDF499
		pgs[4] = 0xB40DB275
		pgs[6] = 0x0F27607E
		pgs[7] = 0xD8817986
		pgs[8] = 0x447F4F60
		pgs[9] = 0x96C9C11E
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xF1AEBDCD
		pgs[12] = 0xADE34BBC
		pgs[16] = 0x95C4BD51
		pgs[15] = "普通模型.wdf"
    elseif pg =="进阶巡游天神_饰品_普通"then
	    pgs[1] = 0x2BF7C971
		pgs[2] = 0x7E263138
		pgs[3] = 0x89FC46EE
		pgs[4] = 0xDEB3D40A
		pgs[6] = 0x255F30FE
		pgs[7] = 0x861E1C4A
		pgs[8] = 0xDF743588
		pgs[9] = 0xDF1D6AB3
		pgs[10] ="战斗模型.wdf"
	elseif pg =="羊头怪_普通"then
        pgs[1]=0x002C3A48
		pgs[2]=0x002C3A48
		pgs[3]=0x002C298B
		pgs[4]=0x002C3203
		pgs[6]=0x002C215B
		pgs[7]=0x002C52FB
		pgs[8]=0x002C4AF4
		pgs[9]=0x002C18E3
		pgs[10] ="战斗模型.wdf"
	elseif pg =="虾兵_普通"then
        pgs[1]=0x00278343
		pgs[2]=0x00278343
		pgs[3]=0x002775CE
		pgs[4]=0x00277CA2
		pgs[6]=0x00276F42
		pgs[7]=0x0027970A
		pgs[8]=0x002790A7
		pgs[9]=0x0027686E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="巨蛙_普通"then
        pgs[1]=0x0017244B
		pgs[2]=0x0017244B
		pgs[3]=0x001716B0
		pgs[4]=0x00171D97
		pgs[6]=0x00171011
		pgs[7]=0x0017384B
		pgs[8]=0x001731D5
		pgs[9]=0x0017092A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="树怪_普通"then
        pgs[1]=0x00226192
		pgs[2]=0x00226192
		pgs[3]=0x002253E1
		pgs[4]=0x00225AD3
		pgs[6]=0x00224D37
		pgs[7]=0x002275B3
		pgs[8]=0x00226F32
		pgs[9]=0x00224645
		pgs[10] ="战斗模型.wdf"
	elseif pg =="星灵仙子_普通"then
        pgs[1]=0x9CCED9F3
		pgs[2]=0x9CCED9F3
		pgs[3]=0xD949630E
		pgs[4]=0x3E4A6073
		pgs[6]=0x265B5E90
		pgs[7]=0xF7545337
		pgs[8]=0x38B89F32
		pgs[9]=0x420A8983
		pgs[10] ="战斗模型.wdf"
	elseif pg =="星灵仙子_饰品_普通"then
        pgs[1]=0x352C795F
		pgs[2]=0x352C795F
		pgs[3]=0x8F7A3B54
		pgs[4]=0x4EEF5E37
		pgs[6]=0x39ADB536
		pgs[7]=0x9F443300
		pgs[8]=0x067611C4
		pgs[9]=0x0A0DD41A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶星灵仙子_普通"then
	    pgs[1] = 0xB2A69A57
		pgs[2] = 0xE160F4FD
		pgs[3] = 0xC50D683C
		pgs[4] = 0x68B373FD
		pgs[6] = 0x75E24AAD
		pgs[7] = 0xCD464FE7
		pgs[8] = 0x243B09A1
		pgs[9] = 0x2D167267
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x9A88F10F
		pgs[12] = 0xEE51C201
		pgs[16] = 0x2F83B341
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶星灵仙子_饰品_普通"then
	    pgs[1] = 0x8814CBF4
		pgs[2] = 0x6575B5A0
		pgs[3] = 0x1077BD08
		pgs[4] = 0xC5187EB9
		pgs[6] = 0xC847F079
		pgs[7] = 0xE70CC6CB
		pgs[8] = 0x9DA5A2C7
		pgs[9] = 0xADA8FF44
		pgs[10] ="战斗模型.wdf"
	elseif pg =="海毛虫_普通"then
        pgs[1]=0x000FA542
		pgs[2]=0x000FA542
		pgs[3]=0x000F9569
		pgs[4]=0x000F9D6F
		pgs[6]=0x000F8DAB
		pgs[7]=0x000FBC9F
		pgs[8]=0x000FB50A
		pgs[9]=0x000F85A5
		pgs[10] ="战斗模型.wdf"
	elseif pg == "章鱼_普通" then
		pgs[1] = 282213114
		pgs[2] = 282213114
		pgs[3] = 401761475
		pgs[4] = 234560788
		pgs[6] = 840147070
		pgs[7] = 3714181760
		pgs[8] = 3714181760
		pgs[9] = 3317165969
		pgs[10] = "战斗模型.wdf"
	elseif pg == "章鱼_饰品_普通" then
		pgs[1] = 0x599CD8B9
		pgs[2] = 0x599CD8B9
		pgs[3] = 0x88BF6138
		pgs[4] = 0xBA7F6112
		pgs[6] = 0x755DEDBC
		pgs[7] = 0x101CA1CB
		pgs[8] = 0xA33259ED
		pgs[9] = 0xCC5BF54D
		pgs[10] = "战斗模型.wdf"
	elseif pg =="野鬼_普通"then
        pgs[1]=0x002C9F78
		pgs[2]=0x002C9F78
		pgs[3]=0x002C9217
		pgs[4]=0x002C98E1
		pgs[6]=0x002C8B95
		pgs[7]=0x002CB321
		pgs[8]=0x002CACC8
		pgs[9]=0x002C84CB
		pgs[10] ="战斗模型.wdf"
	elseif pg =="天兵_普通"then
        pgs[1]=0xC5676415
		pgs[2]=0xC5676415
		pgs[3]=0xFF7C5F7C
		pgs[4]=0xB9448E01
		pgs[6]=0x2CC4FE10
		pgs[7]=0x46AB1AA0
		pgs[8]=0xCB876EC4
		pgs[9]=0x768E814C
		pgs[10] ="战斗模型.wdf"
	elseif pg == "天兵_饰品_普通" then
		pgs[1] = 0xD5ED0DF6
		pgs[2] = 0xD5ED0DF6
		pgs[3] = 0xA6DC5D44
		pgs[4] = 0x5551FC0E
		pgs[6] = 0xEEBB6DE7
		pgs[7] = 0x89B38274
		pgs[8] = 0x0F9596C7
		pgs[9] = 0xD5DE240A
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶天兵_普通"then
	    pgs[1] = 0xE8E36824
		pgs[2] = 0x35D94E14
		pgs[3] = 0xAF1B4B61
		pgs[4] = 0x1F48EF9F
		pgs[6] = 0x263409F7
		pgs[7] = 0x941C1119
		pgs[8] = 0xCF9C6012
		pgs[9] = 0xCF984CBD
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x7528DFD0
		pgs[12] = 0x1FBD9899
		pgs[16] = 0x763FEFE7
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶天兵_饰品_普通"then
	   pgs[1] = 0xAD7A902A
	   pgs[2] = 0x658DFAD7
	   pgs[3] = 0x8728E103
	   pgs[4] = 0xA6ED255E
	   pgs[6] = 0xDD00D038
	   pgs[7] = 0xA51E6D05
	   pgs[8] = 0xC87D7F43
	   pgs[9] = 0x96FE55C2
	   pgs[10] = "战斗模型.wdf"
	elseif pg =="蝴蝶仙子_普通"then
        pgs[1]=0x0012208B
		pgs[2]=0x0012208B
		pgs[3]=0x00120C2C
		pgs[4]=0x00121675
		pgs[6]=0x0012022B
		pgs[7]=0x00123EB1
		pgs[8]=0x001234D9
		pgs[9]=0x0011F7E2
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蝴蝶仙子_普通"then
	    pgs[1] = 0x1E9603F8
		pgs[2] = 0x1EA96EB3
		pgs[3] = 0x924D044A
		pgs[4] = 0xB092EA64
		pgs[6] = 0x763FC6A0
		pgs[7] = 0x61AC2D26
		pgs[8] = 0xC3FF9F5A
		pgs[9] = 0x067A5102
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x7D9E57FC
		pgs[12] = 0xBB5DDE0E
		pgs[16] = 0x00130A0F
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶蝴蝶仙子_饰品_普通"then
	    pgs[1] = 0x756C092F
		pgs[2] = 0x2960E331
		pgs[3] = 0xB7D63C57
		pgs[4] = 0x40042FC0
		pgs[6] = 0xE8C34CF6
		pgs[7] = 0xB800C204
		pgs[8] = 0x4E74E508
		pgs[9] = 0xA83F8BE3
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蟹将_普通"then
        pgs[1]=0x002A7F12
		pgs[2]=0x002A7F12
		pgs[3]=0x002A7223
		pgs[4]=0x002A78B4
		pgs[6]=0x002A6BDA
		pgs[7]=0x002A9210
		pgs[8]=0x002A8BF0
		pgs[9]=0x002A6549
		pgs[10] ="战斗模型.wdf"
	elseif pg =="狐狸精_普通"then
        pgs[1]=0x001162B2
		pgs[2]=0x001162B2
		pgs[3]=0x0011520F
		pgs[4]=0x00115A7A
		pgs[6]=0x001149EC
		pgs[7]=0x00117B3E
		pgs[8]=0x00116B0E
		pgs[9]=0x00114181
		pgs[10] ="战斗模型.wdf"
	elseif pg =="古代瑞兽_普通"then
        pgs[1]=0x000E3B9F
		pgs[2]=0x000E3B9F
		pgs[3]=0x000E2776
		pgs[4]=0x000E31A4
		pgs[6]=0x000E1D90
		pgs[7]=0x000E5974
		pgs[8]=0x000E4FB7
		pgs[9]=0x000E1362
		pgs[10] ="战斗模型.wdf"
	elseif pg =="古代瑞兽_饰品_普通"then
        pgs[1]=0x3F236395
		pgs[2]=0x3F236395
		pgs[3]=0xDCE5D149
		pgs[4]=0x000E31A4
		pgs[6]=0x1F671C28
		pgs[7]=0x79B54409
		pgs[8]=0x6BD99577
		pgs[9]=0x6F641ACC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶古代瑞兽_普通"then
	    pgs[1] = 0x7291F291
		pgs[2] = 0x1FE9B187
		pgs[3] = 0xE04C80B3
		pgs[4] = 0xB4613104
		pgs[6] = 0x1798EA00
		pgs[7] = 0xC658307A
		pgs[8] = 0x2C2FA1CA
		pgs[9] = 0xCC7353FA
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xECA68574
		pgs[12] = 0xF4DE90D7
		pgs[16] = 0xF7543FD0
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶古代瑞兽_饰品_普通"then
	    pgs[1] = 0xBB273790
		pgs[2] = 0x81759ED1
		pgs[3] = 0xB19A5E7A
		pgs[4] = 0xCC6FFADD
		pgs[6] = 0xC9B014AF
		pgs[7] = 0xB2F424B6
		pgs[8] = 0x3DD12FDA
		pgs[9] = 0xAC661546
		pgs[10] ="战斗模型.wdf"
	elseif pg =="泡泡_普通"then
        pgs[1]=0x001EAD7B
		pgs[2]=0x001EAD7B
		pgs[3]=0x001E9FE2
		pgs[4]=0x001EA6C8
		pgs[6]=0x001E9944
		pgs[7]=0x001EC178
		pgs[8]=0x001EBB03
		pgs[9]=0x001E925E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="泡泡_饰品_普通"then
        pgs[1]=0x74880C0F
		pgs[2]=0x74880C0F
		pgs[3]=0xD0F1C46A
		pgs[4]=0x85B9593B
		pgs[6]=0xD98F0E8D
		pgs[7]=0xB7A81712
		pgs[8]=0x2EE1F9EB
		pgs[9]=0xD1A1B1D9
		pgs[10] ="战斗模型.wdf"
	elseif pg =="强盗_普通"then
        pgs[1]=0x001FC6A4
		pgs[2]=0x001FC6A4
		pgs[3]=0x001FB99B
		pgs[4]=0x001FC039
		pgs[6]=0x001FB345
		pgs[7]=0x001FD9C9
		pgs[8]=0x001FD39C
		pgs[9]=0x001FACA7
		pgs[10] ="战斗模型.wdf"
	elseif pg =="野猪_普通"then
        pgs[1]=0x002CDD87
		pgs[2]=0x002CDD87
		pgs[3]=0x002CCFEC
		pgs[4]=0x002CD6D3
		pgs[6]=0x002CC94D
		pgs[7]=0x002CF187
		pgs[8]=0x002CEB11
		pgs[9]=0x002CC266
		pgs[10] ="战斗模型.wdf"
	elseif pg =="野猪_饰品_普通"then
        pgs[1]=0xD53C5B82
		pgs[2]=0xD53C5B82
		pgs[3]=0x77FA9DC1
		pgs[4]=0xBE265EC9
		pgs[6]=0x935A0CD1
		pgs[7]=0x0FD9040B
		pgs[8]=0x0884EBEE
		pgs[9]=0x39D2948C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="狼_普通"then
        pgs[1]=0x0018ACC7
		pgs[2]=0x0018ACC7
		pgs[3]=0x0018A2A8
		pgs[4]=0x0018A7D1
		pgs[6]=0x00189DC7
		pgs[7]=0x0018BB8D
		pgs[8]=0x0018B6D5
		pgs[9]=0x0018989E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="小魔头_普通"then
        pgs[1]=0x477AE7F5
		pgs[2]=0x6FBBEC96
		pgs[3]=0x4D890708
		pgs[4]=0x261BE802
		pgs[6]=0xF02CE935
		pgs[7]=0xDF69159F
		pgs[8]=0x0AEEFE57
		pgs[9]=0x28AB1501
		pgs[10] ="战斗模型.wdf"
    elseif pg == "进阶小魔头_普通" then
		pgs[1] = 0x7C411FCA
		pgs[2] = 0xD1752391
		pgs[3] = 0xB61BC442
		pgs[4] = 0x9CA9CC05
		pgs[6] = 0x693F2882
		pgs[7] = 0xCA79F666
		pgs[8] = 0x8C23A9AB
		pgs[9] = 0x40692DE5
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x7D766A65
		pgs[12] = 0xC1810C1D
		pgs[16] = 0x5E1E29CB
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶小魔头_饰品_普通" then
		pgs[1] = 0x1D464575
		pgs[2] = 0x5453848F
		pgs[3] = 0x21AAF2A3
		pgs[4] = 0x08DC8A25
		pgs[6] = 0x11113770
		pgs[7] = 0x79AA1E39
		pgs[8] = 0x3444DBDA
		pgs[9] = 0x40692DE5
		pgs[10] = "战斗模型.wdf"
	elseif pg =="小精灵_普通"then
        pgs[1]=0x8EDF0F05
		pgs[2]=0xB1B0CBDC
		pgs[3]=0x28E70334
		pgs[4]=0x391B9B0B
		pgs[6]=0xB26BBE81
		pgs[7]=0x021740E8
		pgs[8]=0x5DBD0746
		pgs[9]=0xE88A3B51
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶小精灵_普通" then
		pgs[1] = 0xADBDE6A5
		pgs[2] = 0xC602DD6E
		pgs[3] = 0xE40BFB88
		pgs[4] = 0x93DBF135
		pgs[6] = 0xA94F9594
		pgs[7] = 0x8F4F2B6B
		pgs[8] = 0xFBCF854F
		pgs[9] = 0x9AF85413
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xA87F72D7
		pgs[12] = 0xF623FEBC
		pgs[16] = 0x9D79F43F
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶小精灵_饰品_普通" then
		pgs[1] = 0x060D13FD
		pgs[2] = 0x0D1346DF
		pgs[3] = 0x71D4557F
		pgs[4] = 0x40A6BE6B
		pgs[6] = 0x4B8CE846
		pgs[7] = 0x98007EC0
		pgs[8] = 0x50550532
		pgs[9] = 0xD086777C
		pgs[10] = "战斗模型.wdf"
	elseif pg =="小丫丫_普通"then
        pgs[1]=0xAEACCC79
		pgs[2]=0x0821CCDD
		pgs[3]=0x683EFFF8
		pgs[4]=0x86F8E7AF
		pgs[6]=0xE61E56B9
		pgs[7]=0x7F7D306F
		pgs[8]=0x3CDCC94D
		pgs[9]=0xA79C1C83
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶小丫丫_普通" then
		pgs[1] = 0xA686A863
		pgs[2] = 0x8E7357AE
		pgs[3] = 0x7F3C5535
		pgs[4] = 0x801B7A23
		pgs[6] = 0x839F0DE9
		pgs[7] = 0xE4D974DF
		pgs[8] = 0xDCCF6072
		pgs[9] = 0xA44F7347
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xE135CC7C
		pgs[12] = 0x06F77D45
		pgs[16] = 0xE6B82194
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶小丫丫_饰品_普通" then
		pgs[1] = 0xBB3CC792
		pgs[2] = 0x721CE3C9
		pgs[3] = 0x7F3C5535
		pgs[4] = 0x5597075C
		pgs[6] = 0x951CD72B
		pgs[7] = 0xB56A2CD8
		pgs[8] = 0xF5307E80
		pgs[9] = 0x6A70226D
		pgs[10] = "战斗模型.wdf"
	elseif pg =="小仙女_普通"then
        pgs[1]=0xA46E3F3E
		pgs[2]=0xC185E1DB
		pgs[3]=0x5DE5A635
		pgs[4]=0xBA65BBDC
		pgs[6]=0x4D70F380
		pgs[7]=0xFEAB5548
		pgs[8]=0x1B6A54AB
		pgs[9]=0x55C2E4C1
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶小仙女_普通" then
        pgs[1]=0x67B7A7F9
		pgs[2]=0xB9CF8B4E
		pgs[3]=0x4B3F6928
		pgs[4]=0xA1A21E0E
		pgs[6]=0x1D02CCE3
		pgs[7]=0x6A2C2397
		pgs[8]=0xF0156D8A
		pgs[9]=0x2404289A
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x9AC5F9DB
		pgs[12] = 0x7E6FED4B
		pgs[16] = 0x955E84DD
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶小仙女_饰品_普通" then
		pgs[1] = 0x51898BBF
		pgs[2] = 0x4C01CB1B
		pgs[3] = 0x5F4847E3
		pgs[4] = 0x4F98768C
		pgs[6] = 0x5A14512D
		pgs[7] = 0x02B7BB4C
		pgs[8] = 0x2D394A55
		pgs[9] = 0x9964C666
		pgs[10] = "战斗模型.wdf"
	elseif pg =="小仙灵_普通"then
        pgs[1]=0xABC5A285
		pgs[2]=0xEE884391
		pgs[3]=0x5068A83F
		pgs[4]=0x7DE1B54E
		pgs[6]=0x92F244E3
		pgs[7]=0x841825A2
		pgs[8]=0x8B140C1B
		pgs[9]=0x2EB316D9
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶小仙灵_普通" then
		pgs[1] = 0xD25127EA
		pgs[2] = 0x68324ABA
		pgs[3] = 0xC590E982
		pgs[4] = 0x2116F79D
		pgs[6] = 0xC8954999
		pgs[7] = 0xB1D44AAC
		pgs[8] = 0x5CF3E07A
		pgs[9] = 0x24073589
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x438FEA2A
		pgs[12] = 0x5DBB1568
		pgs[16] = 0xFEDF20AC
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶小仙灵_饰品_普通" then
		pgs[1] = 0x0F5BBE09
		pgs[2] = 0xB2FDB64B
		pgs[3] = 0x96D1364B
		pgs[4] = 0x1C3D7D36
		pgs[6] = 0x24438A29
		pgs[7] = 0xA53ECE97
		pgs[8] = 0xE212E1CE
		pgs[9] = 0xE0884E5C
		pgs[10] = "战斗模型.wdf"
	elseif pg =="小神灵_普通"then
        pgs[1]=0x00293624
		pgs[2]=0x00293624
		pgs[3]=0x00291CE6
		pgs[4]=0x00292DAF
		pgs[6]=0x0029466F
		pgs[7]=0x00292538
		pgs[8]=0x00295719
		pgs[9]=0x002914B7
		pgs[10] ="战斗模型.wdf"
	elseif pg =="小毛头_普通"then
        pgs[1]=0x47E10EB2
		pgs[2]=0x671116E2
		pgs[3]=0xCF782790
		pgs[4]=0xD22B41DE
		pgs[6]=0xC55222A4
		pgs[7]=0xFF09569A
		pgs[8]=0x5E36834F
		pgs[9]=0x20CE167B
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶小毛头_普通" then
		pgs[1] = 0x0AAEB409
		pgs[2] = 0x653CE672
		pgs[3] = 0x1C119390
		pgs[4] = 0x7225C822
		pgs[6] = 0x39E7E9E0
		pgs[7] = 0x2E04284C
		pgs[8] = 0x4871E647
		pgs[9] = 0xC367584D
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xD7562254
		pgs[12] = 0x88C50DE5
		pgs[16] = 0x934FAB88
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶小毛头_饰品_普通" then
		pgs[1] = 0xE387DAC9
		pgs[2] = 0x6B18D3EB
		pgs[3] = 0xDD44C8A1
		pgs[4] = 0x213A2794
		pgs[6] = 0xF1593E02
		pgs[7] = 0x2F2EAC38
		pgs[8] = 0x7563243D
		pgs[9] = 0x35BF2568
		pgs[10] = "战斗模型.wdf"
	elseif pg =="幽灵_普通"then
        pgs[1]=0x035A0A13
		pgs[2]=0xB0202D02
		pgs[3]=0xF959E09C
		pgs[4]=0x59925669
		pgs[6]=0xB3084DB8
		pgs[7]=0xBDA45060
		pgs[8]=0x1D63E822
		pgs[9]=0x61FC976E
		pgs[10] ="战斗模型.wdf"
	elseif pg == "幽灵_饰品_普通" then
		pgs[1] = 0x0E840F22
		pgs[2] = 0xE216ABA8
		pgs[3] = 0xF233781D
		pgs[4] = 0x383B59A9
		pgs[6] = 0x0D3666CE
		pgs[7] = 0xD77B2B80
		pgs[8] = 0xAFF30D5A
		pgs[9] = 0x60668D07
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶幽灵_普通"then
	    pgs[1] = 0x4C3A025E
		pgs[2] = 0xEC458690
		pgs[3] = 0x5DD590DF
		pgs[4] = 0x46F3A9D8
		pgs[6] = 0x7F878E9F
		pgs[7] = 0x2039517D
		pgs[8] = 0x3D0C212C
		pgs[9] = 0x7406D186
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xCE0B75AF
		pgs[12] = 0x704E7698
		pgs[16] = 0x40E93AA4
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶幽灵_饰品_普通"then
	    pgs[1] = 0xD23214A7
		pgs[2] = 0xE517E5FA
		pgs[3] = 0xC6683731
		pgs[4] = 0x4821CD36
		pgs[6] = 0x86E57BA3
		pgs[7] = 0xF8CA728E
		pgs[8] = 0x794960BC
		pgs[9] = 0x08880976
		pgs[10] ="战斗模型.wdf"
	elseif pg =="龙龟_普通"then
        pgs[1]=0xB53C6620
		pgs[2]=0xBC7A1CFE
		pgs[3]=0xE1E529BC
		pgs[4]=0x0369B033
		pgs[6]=0x6CEAFF1E
		pgs[7]=0x7D57961D
		pgs[8]=0xC567B951
		pgs[9]=0xE4FB6A85
		pgs[10] ="战斗模型.wdf"
	elseif pg == "龙龟_饰品_普通" then
		pgs[1] = 0xFC7CDE80
		pgs[2] = 0x5D943CF7
		pgs[3] = 0xFA5D6246
		pgs[4] = 0x86E86CE1
		pgs[6] = 0xCD3B36BB
		pgs[7] = 0xA5B6937F
		pgs[8] = 0xF519CF79
		pgs[9] = 0xE9458DBB
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶龙龟_普通"then
	    pgs[1] = 0xA120218F
		pgs[2] = 0xDCA6D558
		pgs[3] = 0xD82E5536
		pgs[4] = 0x02DC061B
		pgs[6] = 0x2933FC41
		pgs[7] = 0x0707FAF0
		pgs[8] = 0x06C0B25B
		pgs[9] = 0xDE2011E4
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x731B65CD
		pgs[12] = 0xCC34C56C
		pgs[16] = 0x2320B6F5
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶龙龟_饰品_普通"then
	    pgs[1] = 0x341A1652
		pgs[2] = 0xDBD74492
		pgs[3] = 0x41C11874
		pgs[4] = 0x028D8B27
		pgs[6] = 0x55A49A1D
		pgs[7] = 0xE5F8FFDE
		pgs[8] = 0x93DABA9C
		pgs[9] = 0xBEA6CF04
		pgs[10] ="战斗模型.wdf"
	elseif pg =="灵符女娲_普通"then
	    pgs[1] = 0x98D77093
		pgs[2] = 0x04FC365D
		pgs[3] = 0xA37FA080
		pgs[4] = 0x1BE201F8
		pgs[6] = 0x1108DE67
		pgs[7] = 0x6D780273
		pgs[8] = 0xFF96E442
		pgs[9] = 0x2C707784
		pgs[10] ="战斗模型.wdf"
	elseif pg == "灵符女娲_饰品_普通" then
		pgs[1] = 0x002F299E
		pgs[2] = 0xE35272F5
		pgs[3] = 0x091FC4BB
		pgs[4] = 0xB5922D2B
		pgs[6] = 0x47667B41
		pgs[7] = 0xFF83343D
		pgs[8] = 0x958666EF
		pgs[9] = 0x75C58990
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶灵符女娲_普通"then
	    pgs[1] = 0xD6E49319
		pgs[2] = 0x7BAD3CB7
		pgs[3] = 0x35642349
		pgs[4] = 0x6E281AD5
		pgs[6] = 0x1F56240E
		pgs[7] = 0x545C89D4
		pgs[8] = 0xB0A1E3E5
		pgs[9] = 0x07454B56
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xFCEE38C1
		pgs[12] = 0xE3FD7084
		pgs[16] = 0x33C79A93
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶灵符女娲_饰品_普通" then
		pgs[1] = 0x602E6A71
		pgs[2] = 0x2DD22E8B
		pgs[3] = 0x03995EAB
		pgs[4] = 0x1DA88A39
		pgs[6] = 0xF1DB39D7
		pgs[7] = 0x2CE5F575
		pgs[8] = 0x9E6B9F72
		pgs[9] = 0x423B2698
		pgs[10] = "战斗模型.wdf"
	elseif pg =="净瓶女娲_普通"then
	    pgs[1] = 0xEC6F79F4
		pgs[2] = 0xFE35FA3C
		pgs[3] = 0x05AE6D51
		pgs[4] = 0x7B9277F9
		pgs[6] = 0x3F6E1130
		pgs[7] = 0x799965C4
		pgs[8] = 0xC7F51159
		pgs[9] = 0x54C4481A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="净瓶女娲_饰品_普通"then
	    pgs[1] = 0xA4E1AB81
		pgs[2] = 0x83667587
		pgs[3] = 0x7D5E7924
		pgs[4] = 0xF2B8FE7E
		pgs[6] = 0x340AE6C3
		pgs[7] = 0x9D771342
		pgs[8] = 0x1A931B54
		pgs[9] = 0x91097C06
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶净瓶女娲_普通"then
	    pgs[1] = 0x1EF2E640
		pgs[2] = 0x677663D1
		pgs[3] = 0xFECD9387
		pgs[4] = 0xCD97E37C
		pgs[6] = 0x1B5425E6
		pgs[7] = 0x2856C7A1
		pgs[8] = 0xE6E208F4
		pgs[9] = 0x658ECFB8
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x41C451D9
		pgs[12] = 0xDD92CFED
		pgs[16] = 0x6FACB0B1
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶净瓶女娲_饰品_普通"then
	    pgs[1] = 0xDE802E9E
		pgs[2] = 0xD40473AA
		pgs[3] = 0xAC1F8F8C
		pgs[4] = 0xA4304300
		pgs[6] = 0x79F863A9
		pgs[7] = 0x91616888
		pgs[8] = 0x66DFEB44
		pgs[9] = 0xE70A1E04
		pgs[10] ="战斗模型.wdf"
	elseif pg =="鬼将_普通"then
	    pgs[1] = 0x097183AC
		pgs[2] = 0x2E013607
		pgs[3] = 0x4D08C336
		pgs[4] = 0x3C35328F
		pgs[6] = 0xBEAED63A
		pgs[7] = 0xA62F51EA
		pgs[8] = 0x41669A49
		pgs[9] = 0x3E11F5D1
		pgs[10] ="战斗模型.wdf"
	elseif pg == "鬼将_饰品_普通" then
		pgs[1] = 0x475C0DFD
		pgs[2] = 0x24B8DE46
		pgs[3] = 0x96CB1D39
		pgs[4] = 0x18F49463
		pgs[6] = 0xDA85C9A1
		pgs[7] = 0x08D5A386
		pgs[8] = 0xDE9481C1
		pgs[9] = 0xC5F4E924
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶鬼将_普通"then
	    pgs[1] = 0xE16C41AF
		pgs[2] = 0xC19D1009
		pgs[3] = 0x890EFD9F
		pgs[4] = 0xE7E5E555
		pgs[6] = 0x6ED55801
		pgs[7] = 0xFAB026B1
		pgs[8] = 0xBD7075E0
		pgs[9] = 0x8609FB4C
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x9B8D3851
		pgs[12] = 0x1A1BC07F
		pgs[16] = 0xA7228FD9
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶鬼将_饰品_普通"then
	    pgs[1] = 0x600B8E33
		pgs[2] = 0x6F4CDCDA
		pgs[3] = 0xEFA9096A
		pgs[4] = 0xF590C5D7
		pgs[6] = 0xB0F76191
		pgs[7] = 0x819CF008
		pgs[8] = 0xE7F3C5A3
		pgs[9] = 0x4C897EEA
		pgs[10] ="战斗模型.wdf"
	elseif pg =="迭代鬼将_普通" or pg =="进阶迭代鬼将_普通" then
		pgs[1] = 0x00005157
		pgs[2] = 0x00005160
		pgs[3] = 0x00005166
		pgs[4] = 0x00005176
		pgs[6] = 0x00005153
		pgs[7] = 0x00005163
		pgs[8] = 0x00005168
		pgs[9] = 0x00005155
		pgs[10] = "anhebb.wdf"
		if pg =="进阶迭代鬼将_普通" then
			pgs[11] = 0x00005159
			pgs[12] = 0x00005165
			pgs[16] = 0x00005162
			pgs[15] = "anhebb.wdf"

		end
	elseif pg =="迭代鬼将_饰品_普通" or pg =="进阶迭代鬼将_饰品_普通" then
	   pgs[1] = 0x00005180--饰品攻击
	   pgs[2] = 0x00005181--饰品攻击二
	   pgs[3] = 0x00005183--饰品死亡
	   pgs[4] = 0x00005188--饰品防御
	   pgs[6] = 0x00005178--饰品待机
	   pgs[7] = 0x00005182--饰品施法
	   pgs[8] = 0x00005184--饰品移动
	   pgs[9] = 0x00005179--饰品挨打
	   pgs[10] = "anhebb.wdf"
	elseif pg =="律法女娲_普通"then
	    pgs[1] = 0xD163F10A
		pgs[2] = 0x09B2BF29
		pgs[3] = 0x42D246FE
		pgs[4] = 0x4D6C7DA4
		pgs[6] = 0x82A55C83
		pgs[7] = 0x749ADF96
		pgs[8] = 0x48D6EF3F
		pgs[9] = 0x96C1B363
		pgs[10] ="战斗模型.wdf"
	elseif pg =="律法女娲_饰品_普通"then
	    pgs[1] = 0x8A8204C5
		pgs[2] = 0x37C3B528
		pgs[3] = 0xA0C89C6D
		pgs[4] = 0x937F1557
		pgs[6] = 0x93AF956A
		pgs[7] = 0xCF851323
		pgs[8] = 0x5B85C52C
		pgs[9] = 0x3EF42F82
		pgs[10] ="战斗模型.wdf"
    elseif pg == "进阶律法女娲_普通" then
		pgs[1] = 0x63A7D355
		pgs[2] = 0xC0FBA16A
		pgs[3] = 0x790FEFD1
		pgs[4] = 0x8FC7C545
		pgs[6] = 0xCFFC5B11
		pgs[7] = 0x19BBEFC4
		pgs[8] = 0x1CB46D32
		pgs[9] = 0x1B8CD1D4
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0xBBE99333
		pgs[12] = 0x3D2A8762
		pgs[16] = 0xFFAAE034
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶律法女娲_饰品_普通" then
		pgs[1] = 0x94E88DA5
		pgs[2] = 0xBEA4CEE1
		pgs[3] = 0xA03BFE61
		pgs[4] = 0xB9030661
		pgs[6] = 0xA8BBA5AF
		pgs[7] = 0xF34B0717
		pgs[8] = 0x04228ACE
		pgs[9] = 0x93B5B64F
		pgs[10] = "战斗模型.wdf"
	elseif pg =="蚩尤_普通"then
	    pgs[1] = 0x001D2E08
		pgs[2] = 0x001D2E08
		pgs[3] = 0x001D1923
		pgs[4] = 0x001D201B
		pgs[6] = 0x001D1273
		pgs[7] = 0x001D48C3
		pgs[8] = 0x001D423C
		pgs[9] = 0x001D0B7B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蚩尤_普通" or pg =="蚩尤魔影_普通" then
	    pgs[1] = 0x37CC913E
		pgs[2] = 0x9938240A
		pgs[3] = 0xCF27623F
		pgs[4] = 0xA96AF127
		pgs[6] = 0xB547D6C5
		pgs[7] = 0xB95AC7D1
		pgs[8] = 0x84E89BDB
		pgs[9] = 0x0C53745F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="吸血鬼_普通"then
	    pgs[1] = 0x57EDEA8E
		pgs[2] = 0xD58C431F
		pgs[3] = 0xBFD770E7
		pgs[4] = 0x249719A0
		pgs[6] = 0xA9B78CF6
		pgs[7] = 0x3C9B8403
		pgs[8] = 0xA32D6CF3
		pgs[9] = 0x9E9C0CEA
		pgs[10] ="战斗模型.wdf"
	elseif pg == "吸血鬼_饰品_普通" then
		pgs[1] = 0xD6031BB0
		pgs[2] = 0xBD096363
		pgs[3] = 0x1E92C127
		pgs[4] = 0x249719A0
		pgs[6] = 0xDE22B5AC
		pgs[7] = 0x3C9B8403
		pgs[8] = 0x176BFBC0
		pgs[9] = 0xD7BC9A02
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶吸血鬼_普通"then
	    pgs[1] = 0x267C5264
		pgs[2] = 0x6A6AA6B2
		pgs[3] = 0xAA1D0068
		pgs[4] = 0xFA455F90
		pgs[6] = 0xCE0F146C
		pgs[7] = 0xAB400A93
		pgs[8] = 0xCE5EB1D9
		pgs[9] = 0x73C8493D
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x2285828C
		pgs[12] = 0xE5305297
		pgs[16] = 0xBFC6C6E2
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶吸血鬼_饰品_普通" then
		pgs[1] = 0xD7AE33AA
		pgs[2] = 0x9011564E
		pgs[3] = 0x9F746920
		pgs[4] = 0x5E04729B
		pgs[6] = 0x9AF63F59
		pgs[7] = 0x5305EC86
		pgs[8] = 0x532B44D3
		pgs[9] = 0x0641BB9C
		pgs[10] = "战斗模型.wdf"
	elseif pg =="雾中仙_普通"then
	    pgs[1] = 0xF8A2C37A
		pgs[2] = 0xF8A2C37A
		pgs[3] = 0x0402FE3E
		pgs[4] = 0xFD266883
		pgs[6] = 0x77338BEE
		pgs[7] = 0xA9B9E763
		pgs[8] = 0x88920353
		pgs[9] = 0xFBC04019
		pgs[10] ="战斗模型.wdf"
	elseif pg == "雾中仙_饰品_普通" then
		pgs[1] = 0xF7FBF315
		pgs[2] = 0xF7FBF315
		pgs[3] = 0x2E7BCAFF
		pgs[4] = 0xDC47CD72
		pgs[6] = 0xC8ED6E7E
		pgs[7] = 0xC45BDCE4
		pgs[8] = 0xFB118871
		pgs[9] = 0xDA15135C
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶雾中仙_普通"then
	    pgs[1] = 0xBCD4820C
		pgs[2] = 0x8F04916C
		pgs[3] = 0x0CC89F7F
		pgs[4] = 0x064F72E1
		pgs[6] = 0x2D88FD84
		pgs[7] = 0xACD59062
		pgs[8] = 0x83538E76
		pgs[9] = 0xAAD6F9F0
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xA2467825
		pgs[12] = 0x8AD0EFCB
		pgs[16] = 0x70F5ED80
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶雾中仙_饰品_普通"then
	    pgs[1] = 0x7E903BF4
		pgs[2] = 0x77BFE81B
		pgs[3] = 0x2AAB7C03
		pgs[4] = 0x11E8BFA5
		pgs[6] = 0x8D47A766
		pgs[7] = 0xD10262FB
		pgs[8] = 0x73B59DB0
		pgs[9] = 0x3F4F2417
		pgs[10] ="战斗模型.wdf"
	elseif pg =="炎魔神_普通"then
	    pgs[1] = 0xF26C7F04
		pgs[2] = 0xF26C7F04
		pgs[3] = 0x3C4585B9
		pgs[4] = 0xE65C789C
		pgs[6] = 0xE41E0CE2
		pgs[7] = 0x53542E8E
		pgs[8] = 0x32425E55
		pgs[9] = 0x6C28FDAE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="炎魔神_饰品_普通"then
	    pgs[1] = 0xA17BA606
		pgs[2] = 0xA17BA606
		pgs[3] = 0xEE8F4DD9
		pgs[4] = 0xD12893EF
		pgs[6] = 0xAD793A2C
		pgs[7] = 0xF62A21D5
		pgs[8] = 0x6CBCB59E
		pgs[9] = 0x55E9D89B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶炎魔神_普通"then
	    pgs[1] = 0x895C18AB
		pgs[2] = 0x1CEFC73C
		pgs[3] = 0xF6C02A88
		pgs[4] = 0x79E11A39
		pgs[6] = 0xEA21D521
		pgs[7] = 0x8983AA04
		pgs[8] = 0x47CD2810
		pgs[9] = 0x4EAC2194
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xE941964F
		pgs[12] = 0xEAE5E3F4
		pgs[16] = 0x3ED806B0
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶炎魔神_饰品_普通"then
	    pgs[1] = 0x7B0B3810
		pgs[2] = 0xA90307F3
		pgs[3] = 0x55227EC5
		pgs[4] = 0x3AA4D2D4
		pgs[6] = 0xD0EF4613
		pgs[7] = 0x02649602
		pgs[8] = 0xAB879488
		pgs[9] = 0xBA7DF8C4
		pgs[10] ="战斗模型.wdf"
	elseif pg =="夜罗刹_普通"then
	    pgs[1] = 0x0F828F02
		pgs[2] = 0x0F828F02
		pgs[3] = 0xABDB5874
		pgs[4] = 0xE7CD4487
		pgs[6] = 0x9CE06363
		pgs[7] = 0xBA44D9F1
		pgs[8] = 0x343886A2
		pgs[9] = 0xBE6B93F3
		pgs[10] ="战斗模型.wdf"
	elseif pg == "夜罗刹_饰品_普通" then
		pgs[1] = 0xAA489C53
		pgs[2] = 0xAA489C53
		pgs[3] = 0x052E4576
		pgs[4] = 0xF5B12CF7
		pgs[6] = 0xD990BF34
		pgs[7] = 0x8F98250F
		pgs[8] = 0x107A023E
		pgs[9] = 0x14EF9AAF
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶夜罗刹_普通"then
	    pgs[1] = 0x5355C202
		pgs[2] = 0xF8E3BC67
		pgs[3] = 0x64EDA875
		pgs[4] = 0xB4575348
		pgs[6] = 0xF42A579E
		pgs[7] = 0x3B1B850E
		pgs[8] = 0x04F157F1
		pgs[9] = 0xF8BEAF49
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xA36D6A7C
		pgs[12] = 0x35EDC3DD
		pgs[16] = 0xD16718C6
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶夜罗刹_饰品_普通"then
	    pgs[1] = 0xB5BC63C9
		pgs[2] = 0x6CAC86AB
		pgs[3] = 0x981108DC
		pgs[4] = 0xA742208D
		pgs[6] = 0xADC1F64D
		pgs[7] = 0x3F407A0D
		pgs[8] = 0x46E3D588
		pgs[9] = 0x321B51FE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="灵鹤_普通"then
	    pgs[1] = 0x96C4B1C9
		pgs[2] = 0x96C4B1C9
		pgs[3] = 0xC46C607E
		pgs[4] = 0x69C24857
		pgs[6] = 0x31288244
		pgs[7] = 0x111982BE
		pgs[8] = 0x7CC8F05D
		pgs[9] = 0x691C0877
		pgs[10] ="战斗模型.wdf"
	elseif pg == "灵鹤_饰品_普通" then
		pgs[1] = 0x86E25522
		pgs[2] = 0x86E25522
		pgs[3] = 0xFA80332B
		pgs[4] = 0x86E86CE1
		pgs[6] = 0x0F78511B
		pgs[7] = 0x441A3452
		pgs[8] = 0x4FE203F4
		pgs[9] = 0xCA329530
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶灵鹤_普通"then
	    pgs[1] = 0x73AAF3C5
		pgs[2] = 0x172D80CC
		pgs[3] = 0x009DC258
		pgs[4] = 0xE6A9C9B1
		pgs[6] = 0xB15E456E
		pgs[7] = 0x812AE416
		pgs[8] = 0xDE8086CE
		pgs[9] = 0x0E98BCB1
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xE80AB0DB
		pgs[12] = 0x788DBF99
		pgs[16] = 0xE212E9C3
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶灵鹤_饰品_普通" then
		pgs[1] = 0x42EBD4F6
		pgs[2] = 0x6B161494
		pgs[3] = 0xAABC1DC8
		pgs[4] = 0xEEF4081E
		pgs[6] = 0xDE7444FE
		pgs[7] = 0xBA5F8264
		pgs[8] = 0xE1E2C862
		pgs[9] = 0x76E6E34E
		pgs[10] = "战斗模型.wdf"
	elseif pg =="噬天虎_普通"then
	    pgs[1] = 0xB2C9C2C1
		pgs[2] = 0xB2C9C2C1
		pgs[3] = 0x9F90B311
		pgs[4] = 0x39F636C7
		pgs[6] = 0xAC1EE358
		pgs[7] = 0x85305C40
		pgs[8] = 0xA63AA400
		pgs[9] = 0x59C6F27E
		pgs[10] ="战斗模型.wdf"
	elseif pg == "噬天虎_饰品_普通" then
		pgs[1] = 0xCD60CB7C
		pgs[2] = 0xCD60CB7C
		pgs[3] = 0x384E1C4F
		pgs[4] = 0x6F3CBF51
		pgs[6] = 0x1B07AA53
		pgs[7] = 0xF57C2F84
		pgs[8] = 0x3449865D
		pgs[9] = 0xAD6F908F
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶噬天虎_普通"then
	    pgs[1] = 0xBD29FB7A
		pgs[2] = 0x43D13A6E
		pgs[3] = 0x934DB2E8
		pgs[4] = 0x8605C3B4
		pgs[6] = 0x4B31B9DB
		pgs[7] = 0x5AE86B6D
		pgs[8] = 0x88628ABC
		pgs[9] = 0x21F41A63
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x476FAFA7
		pgs[12] = 0x5E882E5A
		pgs[16] = 0x6C9ECA36
		pgs[15] = "普通模型.wdf"

    elseif pg == "进阶噬天虎_饰品_普通" then
		pgs[1] = 0xC4E76188
		pgs[2] = 0xE46F9305
		pgs[3] = 0xB5783A03
		pgs[4] = 0x80F7C4D6
		pgs[6] = 0x09742776
		pgs[7] = 0xABCBC705
		pgs[8] = 0xC0B6CA6A
		pgs[9] = 0x8967F12E
		pgs[10] = "战斗模型.wdf"
	elseif pg =="狸_普通"then
	    pgs[1] = 0xB6DB9CCB
		pgs[2] = 0xB6DB9CCB
		pgs[3] = 0xFF27CA9E
		pgs[4] = 0xF0ACEB35
		pgs[6] = 0x3CDBAFB2
		pgs[7] = 0x897A5492
		pgs[8] = 0x0E6210D6
		pgs[9] = 0x2112F5F7
		pgs[10] ="战斗模型.wdf"
	elseif pg =="狸_饰品_普通"then
		pgs[1] = 0xC76FBB00
		pgs[2] = 0xC76FBB00
		pgs[3] = 0x8A931E88
		pgs[4] = 0xCA669286
		pgs[6] = 0x4ABA3E1D
		pgs[7] = 0xF4EBB0E4
		pgs[8] = 0x42D6AE71
		pgs[9] = 0xCB40BEC3
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蜃气妖_普通"then
	    pgs[1] = 0x00C49F8D
		pgs[2] = 0xCC95E5AB
		pgs[3] = 0xC3968B7E
		pgs[4] = 0x2BBB9C11
		pgs[6] = 0xA3F8CD7E
		pgs[7] = 0x1C793841
		pgs[8] = 0x684F4026
		pgs[9] = 0xC110AF0A
		pgs[10] ="战斗模型.wdf"
	elseif pg == "蜃气妖_饰品_普通" then
		pgs[1] = 0x32E923D4
		pgs[2] = 0xD275BEF7
		pgs[3] = 0x6CC05E1B
		pgs[4] = 0x4DC302C0
		pgs[6] = 0x9C209C27
		pgs[7] = 0x6C150CCC
		pgs[8] = 0xA8D0419D
		pgs[9] = 0x417C8CEA
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶蜃气妖_普通"then
	    pgs[1] = 0x9D9B1084
		pgs[2] = 0x481691FA
		pgs[3] = 0x92234C89
		pgs[4] = 0x887522C9
		pgs[6] = 0x304CE44C
		pgs[7] = 0x244C4F16
		pgs[8] = 0x49DD3B77
		pgs[9] = 0x61A67852
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蜃气妖_饰品_普通"then
	    pgs[1] = 0xE1D5B5D7
		pgs[2] = 0x64538440
		pgs[3] = 0x37CF49EC
		pgs[4] = 0x39A7EFDE
		pgs[6] = 0xB926F635
		pgs[7] = 0xBD3BDD2A
		pgs[8] = 0xA513CA4F
		pgs[9] = 0xC1E4932D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蔓藤妖花_普通"then
	    pgs[1] = 0xC5D94B46
		pgs[2] = 0xC1611D6D
		pgs[3] = 0x17B4A850
		pgs[4] = 0xE2B2445B
		pgs[6] = 0xC970B8D0
		pgs[7] = 0xAB486FA3
		pgs[8] = 0x07F93745
		pgs[9] = 0x0983D50D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蔓藤妖花_普通"then
	    pgs[1] = 0xBD71D80C
		pgs[2] = 0xC7954921
		pgs[3] = 0x21C0D609
		pgs[4] = 0x7DCFA008
		pgs[6] = 0x7118D645
		pgs[7] = 0x170A3BB0
		pgs[8] = 0xDC43CAD3
		pgs[9] = 0xDE1E53D4
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x63503FE9
		pgs[12] = 0x0D2DDA7A
		pgs[16] = 0x75FC6569
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶蔓藤妖花_饰品_普通"then
	    pgs[1] = 0x6F23CB20
		pgs[2] = 0x6A1ECB48
		pgs[3] = 0xBE647FBF
		pgs[4] = 0x19FFD049
		pgs[6] = 0x223BBD1A
		pgs[7] = 0x67E29EFB
		pgs[8] = 0x28AC29E4
		pgs[9] = 0xDC307B8A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="曼珠沙华_普通"then
	    pgs[1] = 0x9798EC46
		pgs[2] = 0xDCCF7313
		pgs[3] = 0xBD77FD79
		pgs[4] = 0xE8EF1966
		pgs[6] = 0x45ACDEDF
		pgs[7] = 0x1036684B
		pgs[8] = 0x727FCE05
		pgs[9] = 0x3BDD0DBF
		pgs[10] ="战斗模型.wdf"
	elseif pg == "曼珠沙华_饰品_普通" then
		pgs[1] = 0x8A1C124A
		pgs[2] = 0x32A77033
		pgs[3] = 0x9D2A42ED
		pgs[4] = 0xD8916BD6
		pgs[6] = 0x86A626ED
		pgs[7] = 0x99D3C540
		pgs[8] = 0xAA7B8B16
		pgs[9] = 0xEBF703E7
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶曼珠沙华_普通"then
	    pgs[1] = 0x25240D95
		pgs[2] = 0x4697E1B3
		pgs[3] = 0x09B3229A
		pgs[4] = 0xD759BDC3
		pgs[6] = 0x886801BB
		pgs[7] = 0x72B459C4
		pgs[8] = 0xD8E30A74
		pgs[9] = 0x8EBF1E45
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xB7FF1E5A
		pgs[12] = 0xEA292149
		pgs[16] = 0x3B8ECB7D
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶曼珠沙华_饰品_普通" then
		pgs[1] = 0xC669E354
		pgs[2] = 0xDAE12A06
		pgs[3] = 0x5CF179D4
		pgs[4] = 0x8021033D
		pgs[6] = 0x9155E9F8
		pgs[7] = 0x67AD1BAD
		pgs[8] = 0xDBD4E18D
		pgs[9] = 0x35DDA6FD
		pgs[10] = "战斗模型.wdf"
	elseif pg =="修罗傀儡鬼_普通"then
	    pgs[1] = 0x2D8299C3
		pgs[2] = 0xF1A954D7
		pgs[3] = 0x73729299
		pgs[4] = 0x28E437E2
		pgs[6] = 0x3090F808
		pgs[7] = 0x13910678
		pgs[8] = 0x4C5B945B
		pgs[9] = 0xBAEBEAEA
		pgs[10] ="战斗模型.wdf"
	elseif pg == "修罗傀儡鬼_饰品_普通" then
		pgs[1] = 0x91FF9026
		pgs[2] = 0xF797BADE
		pgs[3] = 0xA1CD1366
		pgs[4] = 0xADD0D660
		pgs[6] = 0x7A997853
		pgs[7] = 0x6F20622A
		pgs[8] = 0xBCFAAF4B
		pgs[9] = 0x02C428F0
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶修罗傀儡鬼_普通"then
	    pgs[1] = 0x9B7DF1FC
		pgs[2] = 0x73A017D3
		pgs[3] = 0xC9CE3035
		pgs[4] = 0x20E37E1A
		pgs[6] = 0x554EBB15
		pgs[7] = 0x9224DF59
		pgs[8] = 0xA49270BA
		pgs[9] = 0xE2700BF7
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x78DDAF3A
		pgs[12] = 0xD87018BE
		pgs[16] = 0xB85132AF
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶修罗傀儡鬼_饰品_普通"then
	    pgs[1] = 0xCA4D305D
		pgs[2] = 0xA07CCF46
		pgs[3] = 0x39AD557F
		pgs[4] = 0xA5C4C839
		pgs[6] = 0x895B9F2A
		pgs[7] = 0x3AE7FB97
		pgs[8] = 0x28D77EED
		pgs[9] = 0x223C5F00
		pgs[10] ="战斗模型.wdf"
	elseif pg =="金身罗汉_普通"then
	    pgs[1] = 0x9C711EDD
		pgs[2] = 0xC028769E
		pgs[3] = 0x15FBF580
		pgs[4] = 0x784F490F
		pgs[6] = 0x37955920
		pgs[7] = 0xD49CA003
		pgs[8] = 0xD2B03C99
		pgs[9] = 0xEC96354B
		pgs[10] ="战斗模型.wdf"
	elseif pg == "金身罗汉_饰品_普通" then
		pgs[1] = 0x28C3863E
		pgs[2] = 0xE4F58375
		pgs[3] = 0x6F486F5F
		pgs[4] = 0xD9BD4C2E
		pgs[6] = 0x732E0F1D
		pgs[7] = 0x2C4131C8
		pgs[8] = 0x116F3ABE
		pgs[9] = 0x7A0641C6
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶金身罗汉_普通"then
	    pgs[1] = 0x704A7CEC
		pgs[2] = 0x0F176911
		pgs[3] = 0x1CE650E4
		pgs[4] = 0xD6CD3ADC
		pgs[6] = 0x2D9806FA
		pgs[7] = 0xB0D90BEA
		pgs[8] = 0x73625A2A
		pgs[9] = 0x61C5BCE3
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xBE8A540E
		pgs[12] = 0xC9C5C1A7
		pgs[16] = 0xA74E47D4
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶金身罗汉_饰品_普通" then
		pgs[1] = 0xF42354A0
		pgs[2] = 0xAEA12116
		pgs[3] = 0x90BF1DCA
		pgs[4] = 0x729DA8B5
		pgs[6] = 0x9FAD6A2E
		pgs[7] = 0x474252D5
		pgs[8] = 0x51A6BC9D
		pgs[9] = 0xBD8610DF
		pgs[10] = "战斗模型.wdf"
	elseif pg =="修罗傀儡妖_普通"then
	    pgs[1] = 0x33C182E9
		pgs[2] = 0x55B54077
		pgs[3] = 0xB9A4F860
		pgs[4] = 0x22CAE42D
		pgs[6] = 0x32FC3B00
		pgs[7] = 0x4C07FFA1
		pgs[8] = 0x658404D2
		pgs[9] = 0xF712F34F
		pgs[10] ="战斗模型.wdf"
	elseif pg == "修罗傀儡妖_饰品_普通" then
		pgs[1] = 0x190C9114
		pgs[2] = 0x14716C76
		pgs[3] = 0x81C8BEE1
		pgs[4] = 0x6C778517
		pgs[6] = 0x5942C648
		pgs[7] = 0x87BD3F23
		pgs[8] = 0xEB155B54
		pgs[9] = 0x9829749E
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶修罗傀儡妖_普通"then
	    pgs[1] = 0xEADFBA86
		pgs[2] = 0x577EEC90
		pgs[3] = 0xEC3103E4
		pgs[4] = 0xB87C4198
		pgs[6] = 0xE3884664
		pgs[7] = 0x0BA257CC
		pgs[8] = 0x6783BDA7
		pgs[9] = 0xF361F1D2
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x59A2D761
		pgs[12] = 0xA419DBA6
		pgs[16] = 0x9488874F
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶修罗傀儡妖_饰品_普通"then
	    pgs[1] = 0x3401A187
		pgs[2] = 0xCBD9CBE2
		pgs[3] = 0xED249538
		pgs[4] = 0xD1DB1510
		pgs[6] = 0xD565D8ED
		pgs[7] = 0x6D63DDF0
		pgs[8] = 0x24CE0BB8
		pgs[9] = 0x20F20B5A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="巴蛇_普通"then
	    pgs[1] = 0x00003A8F
		pgs[2] = 0x000033FB
		pgs[3] = 0x0000266F
		pgs[4] = 0x00002D36
		pgs[6] = 0x000040E6
		pgs[7] = 0x00005486
		pgs[8] = 0x00004E30
		pgs[9] = 0x00001FF0
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶巴蛇_普通"then
	    pgs[1] = 0xB5421C20
		pgs[2] = 0xB5F77ED3
		pgs[3] = 0x6E6B0CD6
		pgs[4] = 0x048A0E39
		pgs[6] = 0x7A7EF4C7
		pgs[7] = 0x08939F8B
		pgs[8] = 0x6E93E040
		pgs[9] = 0x42A25B91
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xF90E825A
		pgs[12] = 0xF7901BA1
		pgs[16] = 0x9B5B839B
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶巴蛇_饰品_普通"then
	    pgs[1] = 0x4BA5FF1A
		pgs[2] = 0xD7990680
		pgs[3] = 0x543F3110
		pgs[4] = 0x0AFA82C0
		pgs[6] = 0xB73A2598
		pgs[7] = 0x6DC1B4DF
		pgs[8] = 0xE7E4A2D2
		pgs[9] = 0x0C9239DA
		pgs[10] ="战斗模型.wdf"
	elseif pg =="百足将军_普通"then
	    pgs[1] = 0xF46A3BD3
		pgs[2] = 0xF46A3BD3
		pgs[3] = 0x6A3BECB3
		pgs[4] = 0xB8218F5C
		pgs[6] = 0xD06B21E5
		pgs[7] = 0xE158DF15
		pgs[8] = 0xFB85C851
		pgs[9] = 0x19ABD8D8
		pgs[10] ="战斗模型.wdf"
	elseif pg =="百足将军_饰品_普通"then
	    pgs[1] = 0x705C2C61
		pgs[2] = 0x705C2C61
		pgs[3] = 0x9F2B2398
		pgs[4] = 0x7D64C952
		pgs[6] = 0x659E004B
		pgs[7] = 0x4A4E11B8
		pgs[8] = 0xD798EE17
		pgs[9] = 0x3FA41F9D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶百足将军_普通"then
	    pgs[1] = 0xA2159882
		pgs[2] = 0xE5365183
		pgs[3] = 0x40C65332
		pgs[4] = 0x7E435160
		pgs[6] = 0xAB6204D0
		pgs[7] = 0x23087F63
		pgs[8] = 0x6F6B53A9
		pgs[9] = 0x78DC8F28
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x097E838C
		pgs[12] = 0x00DE2347
		pgs[16] = 0x9F8C999C
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶百足将军_饰品_普通"then
	    pgs[1] = 0x6053E629
		pgs[2] = 0x4C30BDF1
		pgs[3] = 0x90A7C6B8
		pgs[4] = 0xBC6E1317
		pgs[6] = 0x5E86A3C9
		pgs[7] = 0x01CD4680
		pgs[8] = 0x18A40FC8
		pgs[9] = 0xCD43714F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蚌精_普通"then
	    pgs[1] = 0x4EE2B9DC
		pgs[2] = 0xFD08B18D
		pgs[3] = 0x07570236
		pgs[4] = 0xCE125302
		pgs[6] = 0x24FE9D58
		pgs[7] = 0xD2A54E5B
		pgs[8] = 0x56B29D6B
		pgs[9] = 0xF5FE9E40
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蚌精_普通"then
	    pgs[1] = 0x8CFE363B
		pgs[2] = 0x34E9C79F
		pgs[3] = 0x42900F8B
		pgs[4] = 0x0A8B52DB
		pgs[6] = 0xA96DF03A
		pgs[7] = 0xF0677AD8
		pgs[8] = 0x50DB2F65
		pgs[9] = 0x7A78E890
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x5DA14093
		pgs[12] = 0x1A5BCF97
		pgs[16] = 0x87A988A6
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶蚌精_饰品_普通"then
	    pgs[1] = 0x3F121C87
		pgs[2] = 0xD2238B8A
		pgs[3] = 0x2A69F4E4
		pgs[4] = 0xC20C9884
		pgs[6] = 0xEE7EE57F
		pgs[7] = 0x9DFE0B66
		pgs[8] = 0x1FAF4B1B
		pgs[9] = 0xF3E3E636
		pgs[10] ="战斗模型.wdf"
	elseif pg =="碧水夜叉_普通"then
	    pgs[1] = 0x735A4452
		pgs[2] = 0xF2102877
		pgs[3] = 0xC487753D
		pgs[4] = 0x94037442
		pgs[6] = 0x2CC27C0E
		pgs[7] = 0x27DD9BD6
		pgs[8] = 0xF81B9F3D
		pgs[9] = 0x6B988A83
		pgs[10] ="战斗模型.wdf"
	elseif pg =="碧水夜叉_饰品_普通"then
	    pgs[1] = 0x4C4AF499
		pgs[2] = 0xB9CEAC45
		pgs[3] = 0x02F57258
		pgs[4] = 0xB6B2A0D3
		pgs[6] = 0x63EF7648
		pgs[7] = 0x50E526FB
		pgs[8] = 0xE41CD597
		pgs[9] = 0xA455BFA1
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶碧水夜叉_普通"then
	    pgs[1] = 0x41B0D9DE
		pgs[2] = 0xAAB58620
		pgs[3] = 0x1B8CB1C7
		pgs[4] = 0x240C4935
		pgs[6] = 0x7996D4FD
		pgs[7] = 0x185A3FA7
		pgs[8] = 0xC2B09D04
		pgs[9] = 0xC7080258
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xD161263B
		pgs[12] = 0x283B0731
		pgs[16] = 0x20739B2F
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶碧水夜叉_饰品_普通"then
	    pgs[1] = 0x8C5CA69A
		pgs[2] = 0xAB3E1CA6
		pgs[3] = 0x69761652
		pgs[4] = 0x48F2CE34
		pgs[6] = 0xC6633DC8
		pgs[7] = 0xE6881018
		pgs[8] = 0x0728D23A
		pgs[9] = 0xB142DBE7
		pgs[10] ="战斗模型.wdf"
	elseif pg =="长眉灵猴_普通"then
	    pgs[1] = 0x44E17604
		pgs[2] = 0x44E17604
		pgs[3] = 0x54DD9B88
		pgs[4] = 0x84A834AA
		pgs[6] = 0xDD227A4C
		pgs[7] = 0x812A0527
		pgs[8] = 0x4C43D1FD
		pgs[9] = 0x9ACB32D6
		pgs[10] ="战斗模型.wdf"
	elseif pg == "长眉灵猴_饰品_普通" then
		pgs[1] = 0x1F374744
		pgs[2] = 0x1F374744
		pgs[3] = 0x664CB9DF
		pgs[4] = 0x146ABA49
		pgs[6] = 0x80F714F5
		pgs[7] = 0xBEE70945
		pgs[8] = 0x76437D38
		pgs[9] = 0xCE8FA4C7
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶长眉灵猴_普通"then
	    pgs[1] = 0xCC76F2F8
		pgs[2] = 0x0CE73800
		pgs[3] = 0x2BD4447D
		pgs[4] = 0xD7CC08FF
		pgs[6] = 0x4D9B1187
		pgs[7] = 0xF74A6D83
		pgs[8] = 0xC14B977D
		pgs[9] = 0xA7EF454A
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x8866E34A
		pgs[12] = 0x3D697D14
		pgs[16] = 0xF58576FB
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶长眉灵猴_饰品_普通"then
	    pgs[1] = 0x1970FA1D
		pgs[2] = 0x3A3687F2
		pgs[3] = 0x1DE75941
		pgs[4] = 0x512D7DD2
		pgs[6] = 0xB1A037C7
		pgs[7] = 0xD7FFAFA2
		pgs[8] = 0x1A5D4986
		pgs[9] = 0x8031118C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="红萼仙子_普通"then
	    pgs[1] = 0x329EAA42
		pgs[2] = 0x91B22697
		pgs[3] = 0x43B54C2F
		pgs[4] = 0x091F0978
		pgs[6] = 0xE1B0D0A5
		pgs[7] = 0x805E0A09
		pgs[8] = 0x2686C3FB
		pgs[9] = 0xD55C7155
		pgs[10] ="战斗模型.wdf"
	elseif pg == "红萼仙子_饰品_普通" then
		pgs[1] = 0xBBDF5342
		pgs[2] = 0x47574289
		pgs[3] = 0xC3A84CA6
		pgs[4] = 0x682964C5
		pgs[6] = 0x7B0A1F4E
		pgs[7] = 0x2204F904
		pgs[8] = 0xF138AA84
		pgs[9] = 0x90BA74AC
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶红萼仙子_普通"then
	    pgs[1] = 0x6E9BCD5C
		pgs[2] = 0xA125C0D9
		pgs[3] = 0xF0DCFC91
		pgs[4] = 0x7D0DD03D
		pgs[6] = 0x21EC36BA
		pgs[7] = 0xEED1B474
		pgs[8] = 0xC5891CD4
		pgs[9] = 0xBC4D1C53
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xB7FD0CC5
		pgs[12] = 0x6E719AB2
		pgs[16] = 0x4F211B8E
		pgs[15] = "普通模型.wdf"

	elseif pg =="葫芦宝贝_普通"then
	    pgs[1] = 0x0011BDB4
		pgs[2] = 0x0011B469
		pgs[3] = 0x0011A16F
		pgs[4] = 0x0011AAED
		pgs[6] = 0x00119839
		pgs[7] = 0x0011E287
		pgs[8] = 0x0011D97A
		pgs[9] = 0x00118EBB
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶葫芦宝贝_普通"then
	    pgs[1] = 0x78C89358
		pgs[2] = 0xA7F1FBD6
		pgs[3] = 0x6D8A1791
		pgs[4] = 0x3C255AE9
		pgs[6] = 0xCFE3DEDF
		pgs[7] = 0x3B330253
		pgs[8] = 0x36A02292
		pgs[9] = 0xB06E3A58
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xD0D575AC
		pgs[12] = 0x74252756
		pgs[16] = 0x5B5CBDE0
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶葫芦宝贝_饰品_普通"then
	    pgs[1] = 0x8BDF4DD0
		pgs[2] = 0x3C4DA2B6
		pgs[3] = 0xC2BEE775
		pgs[4] = 0xB1C85DFD
		pgs[6] = 0x6DB73E8B
		pgs[7] = 0x75235EB5
		pgs[8] = 0xEB58968D
		pgs[9] = 0x0CDC5E4A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="画魂_普通"then
	    pgs[1] = 0x14257647
		pgs[2] = 0xCA851961
		pgs[3] = 0x8E0167B2
		pgs[4] = 0xB48CAEA6
		pgs[6] = 0x947BA25A
		pgs[7] = 0x984B7989
		pgs[8] = 0x9358CF65
		pgs[9] = 0x0AA5F60F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="画魂_饰品_普通"then
	    pgs[1] = 0xF9812ADB
		pgs[2] = 0xA4D613ED
		pgs[3] = 0x44E16B54
		pgs[4] = 0xAB82D9CD
		pgs[6] = 0xEBCB6424
		pgs[7] = 0x698F0258
		pgs[8] = 0x25A1C181
		pgs[9] = 0xA0199A08
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶画魂_普通"then
	    pgs[1] = 0x20CA6389
		pgs[2] = 0xCAA9C35B
		pgs[3] = 0x9C793FC3
		pgs[4] = 0x710D687A
		pgs[6] = 0xD32574C5
		pgs[7] = 0x0F2B0078
		pgs[8] = 0x42260944
		pgs[9] = 0x9E3606F9
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x9FDBFC64
		pgs[12] = 0xC0F17B1B
		pgs[16] = 0xA017274E
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶画魂_饰品_普通" then
		pgs[1] = 0xB0766B67
		pgs[2] = 0x1688D53E
		pgs[3] = 0x81B6D4D2
		pgs[4] = 0x1ABA2BA8
		pgs[6] = 0x987932C9
		pgs[7] = 0x42B6F092
		pgs[8] = 0x549EAE57
		pgs[9] = 0x7476CDF0
		pgs[10] = "战斗模型.wdf"
	elseif pg =="知了王_普通"then
	    pgs[1] = 0x00132DB4
		pgs[2] = 0x00132DB4
		pgs[3] = 0x00133D69
		pgs[4] = 0x001325B6
		pgs[6] = 0x00131598
		pgs[7] = 0x00135547
		pgs[8] = 0x00134D87
		pgs[9] = 0x00130D67
		pgs[10] ="战斗模型.wdf"
	elseif pg =="混沌兽_普通"then
	    pgs[1] = 0x0F49DDA2
		pgs[2] = 0x0F49DDA2
		pgs[3] = 0x5E30118C
		pgs[4] = 0xA0B2A4C0
		pgs[6] = 0x21380C46
		pgs[7] = 0xDBD75951
		pgs[8] = 0x4CBC3FD7
		pgs[9] = 0x92BF8A49
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶混沌兽_普通"then
	    pgs[1] = 0x4C5B3EE1
		pgs[2] = 0x9749DC26
		pgs[3] = 0x11D32EF5
		pgs[4] = 0x44EC58A8
		pgs[6] = 0x87E78098
		pgs[7] = 0x9F328A5A
		pgs[8] = 0x2E8D1286
		pgs[9] = 0xCEA78367
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x0DF86B03
		pgs[12] = 0xA6EDA0A1
		pgs[16] = 0x3EA4065A
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶混沌兽_饰品_普通"then
	    pgs[1] = 0x85702C4A
		pgs[2] = 0x847933E3
		pgs[3] = 0x492F9AA1
		pgs[4] = 0x6D48043D
		pgs[6] = 0x86C42A1E
		pgs[7] = 0xDC88B49F
		pgs[8] = 0xAB7B4719
		pgs[9] = 0x1E8FDE56
		pgs[10] ="战斗模型.wdf"
	elseif pg =="机关鸟_普通"then
	    pgs[1] = 0x0013F238
		pgs[2] = 0x00140B5A
		pgs[3] = 0x0013D896
		pgs[4] = 0x0013E133
		pgs[6] = 0x0013D041
		pgs[7] = 0x0013E9CE
		pgs[8] = 0x0014032E
		pgs[9] = 0x0013C7A4
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶机关鸟_普通"then
	    pgs[1] = 0x3D0B6105
		pgs[2] = 0x3030BC6E
		pgs[3] = 0xFFB5760E
		pgs[4] = 0x32AC0E25
		pgs[6] = 0x1C2392B6
		pgs[7] = 0xAEACFDEF
		pgs[8] = 0xDA6ACD74
		pgs[9] = 0x444DC98A
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x6346E4D2
		pgs[12] = 0xB8E00D09
		pgs[16] = 0x6346E4D2
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶机关鸟_饰品_普通"then
	    pgs[1] = 0xDF08379C
		pgs[2] = 0x4F1DCEEB
		pgs[3] = 0xF050C69A
		pgs[4] = 0x987C0D8F
		pgs[6] = 0xC01ED510
		pgs[7] = 0xE5C7D18C
		pgs[8] = 0x5C7A882C
		pgs[9] = 0x11CDFE55
		pgs[10] ="战斗模型.wdf"
	elseif pg =="机关兽_普通"then
	    pgs[1] = 0x0014486E
		pgs[2] = 0x00144011
		pgs[3] = 0x00142EF3
		pgs[4] = 0x00143783
		pgs[6] = 0x001426AB
		pgs[7] = 0x00146169
		pgs[8] = 0x0014594A
		pgs[9] = 0x00141E1B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶机关兽_普通"then
	    pgs[1] = 0xF16E2546
		pgs[2] = 0xFE2F0DCE
		pgs[3] = 0x3076BA30
		pgs[4] = 0xF65B08C3
		pgs[6] = 0xB8678BB6
		pgs[7] = 0x92117A35
		pgs[8] = 0x729B428B
		pgs[9] = 0x414CCFB2
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x2B134D98
		pgs[12] = 0x3BE331A5
		pgs[16] = 0x2B134D98
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶机关兽_饰品_普通"then
	    pgs[1] = 0x2D9F0E3B
		pgs[2] = 0xE2FF8FCD
		pgs[3] = 0x45C599AD
		pgs[4] = 0x0C7B1194
		pgs[6] = 0x66E097D4
		pgs[7] = 0x5E8E0238
		pgs[8] = 0xC50FDA15
		pgs[9] = 0x35719C69
		pgs[10] ="战斗模型.wdf"
	elseif pg =="鲛人_普通"then
	    pgs[1] = 0xE4697EB6
		pgs[2] = 0xB2C6B54B
		pgs[3] = 0xF0F01E69
		pgs[4] = 0xC6153D40
		pgs[6] = 0xE2807954
		pgs[7] = 0x3625263A
		pgs[8] = 0xDE138F5E
		pgs[9] = 0x6B3EF2B9
		pgs[10] ="战斗模型.wdf"
	elseif pg =="鲛人_饰品_普通"then
	    pgs[1] = 0xF0EB1315
		pgs[2] = 0x4050ADB1
		pgs[3] = 0xB17A0D7A
		pgs[4] = 0x1257756D
		pgs[6] = 0x427A9519
		pgs[7] = 0x2BAE353F
		pgs[8] = 0x1E2540EF
		pgs[9] = 0x9633A1FF
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶鲛人_普通"then
	    pgs[1] = 0x640F12DD
		pgs[2] = 0x4DD6DDDA
		pgs[3] = 0x8FE89A5D
		pgs[4] = 0x3692E598
		pgs[6] = 0x964D1EF1
		pgs[7] = 0x55462CFE
		pgs[8] = 0x01D4B3DC
		pgs[9] = 0x7A35C54B
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x04697234
		pgs[12] = 0x22A67114
		pgs[16] = 0xD4CE6708
		pgs[15] = "普通模型.wdf"
	elseif pg == "进阶鲛人_饰品_普通"then
	    pgs[1] = 0xBBF0D5E5
		pgs[2] = 0x233E123F
		pgs[3] = 0xA7E04BA3
		pgs[4] = 0x51E67BF4
		pgs[6] = 0xC30E9C64
		pgs[7] = 0xD171ED1C
		pgs[8] = 0xD0DF8ED8
		pgs[9] = 0x0E3002E6
		pgs[10] ="战斗模型.wdf"
	elseif pg =="锦毛貂精_普通"then
	    pgs[1] = 0x5320BA18
		pgs[2] = 0xE0755693
		pgs[3] = 0x8D7FF839
		pgs[4] = 0x359676E1
		pgs[6] = 0xC768A820
		pgs[7] = 0x260AE8F1
		pgs[8] = 0xC02E6F3B
		pgs[9] = 0x12A9E525
		pgs[10] ="战斗模型.wdf"
	elseif pg =="锦毛貂精_饰品_普通"then
	    pgs[1] = 0x9DD6164F
		pgs[2] = 0xC36121D8
		pgs[3] = 0xE671B4B0
		pgs[4] = 0xCB9493F3
		pgs[6] = 0xB18C9EE6
		pgs[7] = 0x47B24D87
		pgs[8] = 0xAA708449
		pgs[9] = 0x6B4F63A6
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶锦毛貂精_普通"then
	    pgs[1] = 0xEC43AC2B
		pgs[2] = 0x5AC32BC4
		pgs[3] = 0xADEAB1FE
		pgs[4] = 0x75E66AF1
		pgs[6] = 0xD34BE63C
		pgs[7] = 0x8ABFBDBB
		pgs[8] = 0xFC3D1D87
		pgs[9] = 0x4DC8DCA5
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x460B1EB7
		pgs[12] = 0xB390A1FD
		pgs[16] = 0xBD210400
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶锦毛貂精_饰品_普通"then
	    pgs[1] = 0x4AB6FE65
		pgs[2] = 0xAA3530C1
		pgs[3] = 0x7FA538F2
		pgs[4] = 0xD780D9F0
		pgs[6] = 0x00D8BA03
		pgs[7] = 0xAF8A8AF0
		pgs[8] = 0x324F2BF5
		pgs[9] = 0x49FE65F2
		pgs[10] ="战斗模型.wdf"
	elseif pg =="巨力神猿_普通"then
	    pgs[1] = 0x09A070E7
		pgs[2] = 0x09A070E7
		pgs[3] = 0x473EAB27
		pgs[4] = 0x4BE0E734
		pgs[6] = 0xD920BF09
		pgs[7] = 0xB26FBCC9
		pgs[8] = 0x015EB5F0
		pgs[9] = 0x1711C384
		pgs[10] ="战斗模型.wdf"
	elseif pg == "巨力神猿_饰品_普通" then
		pgs[1] = 0xB51551E5
		pgs[2] = 0xB51551E5
		pgs[3] = 0xF5BE6DE3
		pgs[4] = 0x319D2CC8
		pgs[6] = 0xE4D66B65
		pgs[7] = 0x396F1FF2
		pgs[8] = 0x1BDCBE4A
		pgs[9] = 0x7C671298
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶巨力神猿_普通"then
	    pgs[1] = 0x3F197B49
		pgs[2] = 0xA8CBBA47
		pgs[3] = 0x71C43236
		pgs[4] = 0xCD453A51
		pgs[6] = 0xE03B4CB5
		pgs[7] = 0x1CCCD4F9
		pgs[8] = 0x039BDA0E
		pgs[9] = 0x6CF30E59
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xB4CBFD3F
		pgs[12] = 0x0E11D3D6
		pgs[16] = 0x061C6FA0
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶巨力神猿_饰品_普通"then
	    pgs[1] = 0x27CD2802
		pgs[2] = 0xF969D00B
		pgs[3] = 0xB637EF96
		pgs[4] = 0x751597BB
		pgs[6] = 0x2326D947
		pgs[7] = 0x20997909
		pgs[8] = 0x1680DEA0
		pgs[9] = 0xD4C85679
		pgs[10] ="战斗模型.wdf"
	elseif pg =="连弩车_普通"then
	    pgs[1] = 0x0019E725
		pgs[2] = 0x0019EF41
		pgs[3] = 0x0019D689
		pgs[4] = 0x0019DED8
		pgs[6] = 0x0019CE82
		pgs[7] = 0x001A0F58
		pgs[8] = 0x9F0EA2F8
		pgs[9] = 0x0019C633
		pgs[10] ="战斗模型.wdf"
	elseif pg == "进阶连弩车_普通" then
		pgs[1] = 0x1E0A19F3
		pgs[2] = 0xB63376EE
		pgs[3] = 0x82ABE37B
	    pgs[4] = 0xE15EDC19
		pgs[6] = 0xEDE79D1B
	    pgs[7] = 0xC8B21F9A
	    pgs[8] = 0x92AC68E8
		pgs[9] = 0xC3CFDBBF
		pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x8C3F954D
		pgs[12] = 0xB0848BFB
		pgs[16] = 0x1DECDCB0
		pgs[15] = "普通模型.wdf"

	elseif pg == "进阶连弩车_饰品_普通" then
		pgs[1] = 0x23F9A218
		pgs[2] = 0x6064D57C
		pgs[3] = 0xFB24EDA7
	    pgs[4] = 0x44FCF5F0
		pgs[6] = 0x05B30C39
	    pgs[7] = 0xA4ED552F
	    pgs[8] = 0xFD977902
		pgs[9] = 0xA6CEF28B
		pgs[10] = "战斗模型.wdf"
	elseif pg =="猫灵人形_普通"then
	    pgs[1] = 0x001AEEE9
		pgs[2] = 0x001AE681
		pgs[3] = 0x001AD54D
		pgs[4] = 0x001ADDE8
		pgs[6] = 0x001ACCFA
		pgs[7] = 0x001B1030
		pgs[8] = 0x001B0806
		pgs[9] = 0x001AC45F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶猫灵人形_普通"then
	    pgs[1] = 0xB6A0F272
		pgs[2] = 0xE2244B5C
		pgs[3] = 0xAC426AF0
		pgs[4] = 0xC42F5315
		pgs[6] = 0x78256C28
		pgs[7] = 0xD7ADADFC
		pgs[8] = 0xCAD8AE33
		pgs[9] = 0x1610F435
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xAD5A8508
		pgs[12] = 0xDA3A2696
		pgs[16] = 0x1A0E8CEB
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶猫灵人形_饰品_普通"then
	    pgs[1] = 0xD339585F
		pgs[2] = 0x702BAF11
		pgs[3] = 0x9EC6702C
		pgs[4] = 0xC5471B0A
		pgs[6] = 0xEC9B0AEA
		pgs[7] = 0xA12B4BDC
		pgs[8] = 0x852B6490
		pgs[9] = 0x16211A4F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="猫灵兽形_普通"then
	    pgs[1] = 0x001B4585
		pgs[2] = 0x001B4E02
		pgs[3] = 0x001B3427
		pgs[4] = 0x001B3CD7
		pgs[6] = 0x001B2BBF
		pgs[7] = 0x001B6F9D
		pgs[8] = 0x001B675E
		pgs[9] = 0x001B230F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶猫灵兽形_普通"then
	    pgs[1] = 0x99BBA06B
		pgs[2] = 0xAAC73D6E
		pgs[3] = 0x78FECA83
		pgs[4] = 0xFD1349E1
		pgs[6] = 0x5D711007
		pgs[7] = 0xD497ABF5
		pgs[8] = 0x0580F3FE
		pgs[9] = 0x44AA7C09
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xD9219E61
		pgs[12] = 0xC1F5FE1E
		pgs[16] = 0xD622C86A
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶猫灵兽形_饰品_普通"then
	    pgs[1] = 0xBF1E5A84
		pgs[2] = 0x641B4F74
		pgs[3] = 0x075363C6
		pgs[4] = 0x330947B0
		pgs[6] = 0x0B3A5C39
		pgs[7] = 0x3994517B
		pgs[8] = 0x8EE3E528
		pgs[9] = 0x52563893
		pgs[10] ="战斗模型.wdf"
	elseif pg =="千年蛇魅_普通"then
	    pgs[1] = 0x8D034242
		pgs[2] = 0x8D034242
		pgs[3] = 0x9829C1EE
		pgs[4] = 0x312D4B23
		pgs[6] = 0x511FF3AD
		pgs[7] = 0x38206D0D
		pgs[8] = 0xDB3ABB96
		pgs[9] = 0xBCEE8584
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶千年蛇魅_普通"then
	    pgs[1] = 0xE5E4A1F8
		pgs[2] = 0xC0B4DE3E
		pgs[3] = 0x7AC3FD14
		pgs[4] = 0x8C0E8FD0
		pgs[6] = 0xA14F4A62
		pgs[7] = 0xB4F3EE56
		pgs[8] = 0xA4AC72C1
		pgs[9] = 0x6E54D4E3
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xED9F3561
		pgs[12] = 0xC2746881
		pgs[16] = 0x4B65B5D9
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶千年蛇魅_饰品_普通"then
	    pgs[1] = 0x39629D8B
		pgs[2] = 0xE8A88379
		pgs[3] = 0xB20D06E2
		pgs[4] = 0xDC63F7E0
		pgs[6] = 0x6269EE72
		pgs[7] = 0x27882B73
		pgs[8] = 0xE75B86A1
		pgs[9] = 0x5AE4D413
		pgs[10] ="战斗模型.wdf"
	elseif pg =="远古神魔_普通"then
	    pgs[1] = 0x002130BB
		pgs[2] = 0x002130BB
		pgs[3] = 0x00211CDF
		pgs[4] = 0x002126CE
		pgs[6] = 0x00211338
		pgs[7] = 0x002143F5
		pgs[8] = 0x00213A77
		pgs[9] = 0x00210949
		pgs[10] ="战斗模型.wdf"
	elseif pg =="鼠先锋_普通"then
	    pgs[1] = 0x92A345BC
		pgs[2] = 0x92A345BC
		pgs[3] = 0x6A620EE1
		pgs[4] = 0x8B6B0959
		pgs[6] = 0xA9634C86
		pgs[7] = 0x89F2C157
		pgs[8] = 0xDCD0D49B
		pgs[9] = 0xF18EA112
		pgs[10] ="战斗模型.wdf"
	elseif pg =="鼠先锋_饰品_普通"then
	    pgs[1] = 0x159DAC6E
		pgs[2] = 0x159DAC6E
		pgs[3] = 0xDDE6D3C3
		pgs[4] = 0xE3CD5F8B
		pgs[6] = 0x8C74B098
		pgs[7] = 0x6E9B6833
		pgs[8] = 0xE2A1511A
		pgs[9] = 0x8FCCF76B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶鼠先锋_普通"then
	    pgs[1] = 0x078A8E44
		pgs[2] = 0x98A18E75
		pgs[3] = 0x95ECB854
		pgs[4] = 0x0B818F11
		pgs[6] = 0x89A1831C
		pgs[7] = 0x3CDD35E9
		pgs[8] = 0xE0DFA185
		pgs[9] = 0x88D3286C
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xA1239E33
		pgs[12] = 0x149316B4
		pgs[16] = 0xB3EA50AA
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶鼠先锋_饰品_普通"then
	    pgs[1] = 0x9D2A7E57
		pgs[2] = 0xEAF59E67
		pgs[3] = 0xFE54D0DC
		pgs[4] = 0x8E05C9C3
		pgs[6] = 0x85505628
		pgs[7] = 0xD18BA7E2
		pgs[8] = 0xEF854675
		pgs[9] = 0xA3A77DEA
		pgs[10] ="战斗模型.wdf"
	elseif pg =="踏云兽_普通"then
	    pgs[1] = 0x516D204C
		pgs[2] = 0xF467075C
		pgs[3] = 0x156E6008
		pgs[4] = 0x7B8F63CF
		pgs[6] = 0x33724BBA
		pgs[7] = 0x5E583382
		pgs[8] = 0x23E1528D
		pgs[9] = 0xA9F3D17A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶踏云兽_普通"then
	    pgs[1] = 0xC6E67E4F
		pgs[2] = 0xD04BFDC1
		pgs[3] = 0xB01111D9
		pgs[4] = 0xFA3ED116
		pgs[6] = 0x4B1AAA96
		pgs[7] = 0xB73151F2
		pgs[8] = 0x7E3F0677
		pgs[9] = 0xD00BAF62
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x46702722
		pgs[12] = 0x01B2151D
		pgs[16] = 0x4614738E
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶踏云兽_饰品_普通"then
	    pgs[1] = 0xE8B8F7CB
		pgs[2] = 0x5145536E
		pgs[3] = 0xD88ACCAE
		pgs[4] = 0x5A09ABF2
		pgs[6] = 0x683CA512
		pgs[7] = 0x46F38E3C
		pgs[8] = 0x17F712C3
		pgs[9] = 0xB0D7EB0B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="犀牛将军人形_普通"then
	    pgs[1] = 0x5D6B20D2
		pgs[2] = 0x4A38AD27
		pgs[3] = 0xA5D5C808
		pgs[4] = 0x36D92EF0
		pgs[6] = 0xF4714CEA
		pgs[7] = 0x7F17A414
		pgs[8] = 0xEEBB57B4
		pgs[9] = 0x35539450
		pgs[10] ="战斗模型.wdf"
	elseif pg =="犀牛将军人形_饰品_普通"then
	    pgs[1] = 0x5458DCB5
		pgs[2] = 0xCE13C203
		pgs[3] = 0xF900EE6C
		pgs[4] = 0x6EC38C62
		pgs[6] = 0xA86A8F7F
		pgs[7] = 0x0F7B3DF2
		pgs[8] = 0x67406E9B
		pgs[9] = 0xAC0C8A3D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶犀牛将军人形_普通"then
	    pgs[1] = 0xC2F24E06
		pgs[2] = 0xFEE95AAF
		pgs[3] = 0xB56C293E
		pgs[4] = 0x968FE790
		pgs[6] = 0xCDF6AC47
		pgs[7] = 0x9D7F2AD0
		pgs[8] = 0xCFFE9FB9
		pgs[9] = 0xCE559EB3
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x88A585B9
		pgs[12] = 0x6F29FDF0
		pgs[16] = 0x201657B3
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶犀牛将军人形_饰品_普通"then
	    pgs[1] = 0xD7869449
		pgs[2] = 0xED814C74
		pgs[3] = 0xF9125935
		pgs[4] = 0x84CE041D
		pgs[6] = 0x0B467805
		pgs[7] = 0x6B90DA5D
		pgs[8] = 0x04CADE02
		pgs[9] = 0xDE7C806E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="犀牛将军兽形_普通"then
	    pgs[1] = 0x124F43E7
		pgs[2] = 0x5D7AC9A2
		pgs[3] = 0xCB6D3B5F
		pgs[4] = 0xD7A458DD
		pgs[6] = 0xC7DEA5CC
		pgs[7] = 0x3A9902F8
		pgs[8] = 0x4C22E015
		pgs[9] = 0xE27709A8
		pgs[10] ="战斗模型.wdf"
	elseif pg =="犀牛将军兽形_饰品_普通"then
	    pgs[1] = 0x2802C64B
		pgs[2] = 0x78A35328
		pgs[3] = 0x1F6DFA52
		pgs[4] = 0xC8D6682A
		pgs[6] = 0x7A718D3D
		pgs[7] = 0x80827189
		pgs[8] = 0x8441340B
		pgs[9] = 0x7DE55BEC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶犀牛将军兽形_普通"then
	    pgs[1] = 0xF3B7CF02
		pgs[2] = 0xD9A93462
		pgs[3] = 0x162C35E1
		pgs[4] = 0xE43DCAE8
		pgs[6] = 0x48D01363
		pgs[7] = 0x14B17887
		pgs[8] = 0x605E3B33
		pgs[9] = 0xD5D87FC7
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x9870F7A2
		pgs[12] = 0x93324EFF
		pgs[16] = 0xB8DC68BA
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶犀牛将军兽形_饰品_普通"then
	    pgs[1] = 0x08DB608F
		pgs[2] = 0x5F269463
		pgs[3] = 0x9D54C470
		pgs[4] = 0x3B79CA55
		pgs[6] = 0x2625CDBF
		pgs[7] = 0x66DAD328
		pgs[8] = 0x3086BBC0
		pgs[9] = 0x74110487
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蝎子精_普通"then
	    pgs[1] = 0x002A2D5C
		pgs[2] = 0x002A3559
		pgs[3] = 0x002A1CFE
		pgs[4] = 0x002A252E
		pgs[6] = 0x002A1516
		pgs[7] = 0x002A54F4
		pgs[8] = 0x002A4D35
		pgs[9] = 0x002A0CE6
		pgs[10] ="战斗模型.wdf"
	elseif pg =="蝎子精_饰品_普通"then
	    pgs[1] = 0x4CD923B6
		pgs[2] = 0x257BB6CD
		pgs[3] = 0x26777BCC
		pgs[4] = 0x695F02C3
		pgs[6] = 0x021AFA79
		pgs[7] = 0x301FABAA
		pgs[8] = 0xB8937FD7
		pgs[9] = 0xA830561E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶蝎子精_普通"then
	    pgs[1] = 0xBB5D5C67
		pgs[2] = 0xD5FDDCC6
		pgs[3] = 0x80535B44
		pgs[4] = 0x8007428F
		pgs[6] = 0x95FBDCDD
		pgs[7] = 0xC9EAA7FD
		pgs[8] = 0x3295E9E7
		pgs[9] = 0x33DE7412
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x76FDB3C1
		pgs[12] = 0xDE8FEB67
		pgs[16] = 0x99DE926C
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶蝎子精_饰品_普通"then
	    pgs[1] = 0x8F463BC3
		pgs[2] = 0x9D66E6B1
		pgs[3] = 0xAC4626EE
		pgs[4] = 0xBDF99F86
		pgs[6] = 0xAB7F802C
		pgs[7] = 0x16141572
		pgs[8] = 0xAB796DF9
		pgs[9] = 0xC05C6A43
		pgs[10] ="战斗模型.wdf"
	elseif pg =="野猪精_普通"then
	    pgs[1] = 0x7D2E2675
		pgs[2] = 0x7D2E2675
		pgs[3] = 0xC58184A3
		pgs[4] = 0xBAD48A9F
		pgs[6] = 0xB6CE5945
		pgs[7] = 0x88FA74F5
		pgs[8] = 0x98AEB8E6
		pgs[9] = 0x44EED87A
		pgs[10] ="战斗模型.wdf"
    elseif pg =="野猪精_饰品_普通"then
	    pgs[1] = 0xC6E17937
		pgs[2] = 0xC6E17937
		pgs[3] = 0xAAA3BDB2
		pgs[4] = 0x604CEAF5
		pgs[6] = 0x15274EAE
		pgs[7] = 0xDF0B08E7
		pgs[8] = 0xDF5C8BC7
		pgs[9] = 0x885D699C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶野猪精_普通"then
	    pgs[1] = 0xFAE66519
		pgs[2] = 0x1FAF1415
		pgs[3] = 0x17A99AF2
		pgs[4] = 0x2CC0C44E
		pgs[6] = 0x27AE027B
		pgs[7] = 0x14835218
		pgs[8] = 0x977F1043
		pgs[9] = 0x69308A69
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x0DAC8410
		pgs[12] = 0x9676F109
		pgs[16] = 0x0B0890CB
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶野猪精_饰品_普通"then
	    pgs[1] = 0x37250FD4
		pgs[2] = 0xA0F63C4F
		pgs[3] = 0x4B153D00
		pgs[4] = 0xEFB41A2C
		pgs[6] = 0x80A1DB6F
		pgs[7] = 0xF473E6A2
		pgs[8] = 0x7643F690
		pgs[9] = 0x02074FCD
		pgs[10] ="战斗模型.wdf"
	elseif pg =="阴阳伞_普通"then
	    pgs[1] = 0x430F60E2
		pgs[2] = 0xA6C14C68
		pgs[3] = 0xA52AB815
		pgs[4] = 0x39ECEBFD
		pgs[6] = 0x6037DEBD
		pgs[7] = 0xBE1F3734
		pgs[8] = 0xBF06CDDA
		pgs[9] = 0x176BA0DE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="阴阳伞_饰品_普通"then
	    pgs[1] = 0x330A8E5E
		pgs[2] = 0x962E6989
		pgs[3] = 0xF86ED999
		pgs[4] = 0xA0D65E72
		pgs[6] = 0x02C87FEC
		pgs[7] = 0x9B051B28
		pgs[8] = 0x19840C7F
		pgs[9] = 0xF4DA81F4
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶阴阳伞_普通"then
	    pgs[2] = 0x84312A1F
		pgs[1] = 0x90C5A543
		pgs[3] = 0xE27750EF
		pgs[4] = 0x38396F6C
		pgs[6] = 0x5AF2702C
		pgs[7] = 0xDED79EF9
		pgs[8] = 0xA2E4424F
		pgs[9] = 0x57DF88DF
		pgs[10] ="战斗模型.wdf"
		pgs[16] = 0x9AE21560
		pgs[12] = 0xC883C02F
		pgs[11] = 0x079D1EE6
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶阴阳伞_饰品_普通"then
	    pgs[2] = 0xC655D248
		pgs[1] = 0x869D47B6
		pgs[3] = 0xFBE7F244
		pgs[4] = 0x8C95DEFC
		pgs[6] = 0xC0594A8A
		pgs[7] = 0x0711C9BC
		pgs[8] = 0x44725BE1
		pgs[9] = 0xC71F9600
		pgs[10] ="战斗模型.wdf"
	elseif pg =="幽萤娃娃_普通"then
	    pgs[1] = 0x92A04679
		pgs[2] = 0xF3AB0463
		pgs[3] = 0xF37D30C4
		pgs[4] = 0x3288E292
		pgs[6] = 0xE4992631
		pgs[7] = 0x440F8F46
		pgs[8] = 0x5A9478EF
		pgs[9] = 0x199C1663
		pgs[10] ="战斗模型.wdf"
	elseif pg == "幽萤娃娃_饰品_普通" then
		pgs[1] = 0xB8CDD6FC
		pgs[2] = 0x886E00E2
		pgs[3] = 0x04B2E753
		pgs[4] = 0x1FD55467
		pgs[6] = 0x115CA397
		pgs[7] = 0x9C38A07B
		pgs[8] = 0xED326C67
		pgs[9] = 0x865C4912
		pgs[10] = "战斗模型.wdf"
	elseif pg =="进阶幽萤娃娃_普通"then
	    pgs[1] = 0x7554F1D9
		pgs[2] = 0xDEE2BA96
		pgs[3] = 0xAA744C4F
		pgs[4] = 0xDEEF16AF
		pgs[6] = 0x70E6A2AE
		pgs[7] = 0x2D71552F
		pgs[8] = 0x95212E44
		pgs[9] = 0x307C8AB4
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xE9581101
		pgs[12] = 0x2314C566
		pgs[16] = 0xA71DFBA1
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶幽萤娃娃_饰品_普通"then
	    pgs[1] = 0x302B3BFF
		pgs[2] = 0xF03EE259
		pgs[3] = 0x83DE3D7A
		pgs[4] = 0x242717E2
		pgs[6] = 0xC87600B8
		pgs[7] = 0xDEA47D67
		pgs[8] = 0x52621DA0
		pgs[9] = 0xBE6CE314
		pgs[10] ="战斗模型.wdf"
	elseif pg =="机关人_普通"then
	    pgs[1] = 0x523AD9CB
		pgs[2] = 0x523AD9CB
		pgs[3] = 0x08280268
		pgs[4] = 0xF1F94BD5
		pgs[6] = 0xC27A35D2
		pgs[7] = 0xA77320BF
		pgs[8] = 0x92173C08
		pgs[9] = 0x5049497C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="机关人_饰品_普通"then
	    pgs[1] = 0x516A9751
		pgs[2] = 0x516A9751
		pgs[3] = 0x3DF10CB9
		pgs[4] = 0xF347E911
		pgs[6] = 0xB1108478
		pgs[7] = 0x738AD6CE
		pgs[8] = 0xF788602C
		pgs[9] = 0xB224E4D4
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶机关人_普通"then
	    pgs[1] = 0x14DE8746
		pgs[2] = 0x9864B2F1
		pgs[3] = 0xDB2916BF
		pgs[4] = 0x5026BD9F
		pgs[6] = 0xC7EDA495
		pgs[7] = 0x95EAFF9B
		pgs[8] = 0xE3E7268D
		pgs[9] = 0xD3EAE52F
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xC4C0E792
		pgs[12] = 0xD2C4DEF2
		pgs[16] = 0x2374B0F8
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶机关人_饰品_普通"then
	    pgs[1] = 0x82BBA616
		pgs[2] = 0x395380C6
		pgs[3] = 0xF1BBB49D
		pgs[4] = 0x688C0F73
		pgs[6] = 0x567B4519
		pgs[7] = 0x959AC4B3
		pgs[8] = 0x00E3DB78
		pgs[9] = 0x51570829
		pgs[10] ="战斗模型.wdf"
	elseif pg =="真陀护法_普通"then
	    pgs[1] = 0xD433484F
		pgs[2] = 0xC48F78A0
		pgs[3] = 0x439AD1EF
		pgs[4] = 0x281836EE
		pgs[6] = 0x6C19FF7F
		pgs[7] = 0x5AB8D8B7
		pgs[8] = 0xF227C233
		pgs[9] = 0x83B1AB72
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xEC025A5E
		pgs[12] = 0x0C453A2F
		pgs[16] = 0xF9F0399D
		pgs[15] = "普通模型.wdf"
	elseif pg == "真陀护法_饰品_普通" then
		pgs[1] = 0x38A10DBC
		pgs[2] = 0xD232A413
		pgs[3] = 0x85358EF6
		pgs[4] = 0x546B6920
		pgs[6] = 0x119A18A5
		pgs[7] = 0xEDCDDD44
		pgs[8] = 0xE2DD0587
		pgs[9] = 0xD62BA99E
		pgs[10] = "战斗模型.wdf"
	elseif pg == "进阶真陀护法_普通" then
		pgs[1] = 0xA20D1FB9
		pgs[2] = 0x2DDCB61A
		pgs[3] = 0x2070E3B1
		pgs[4] = 0x8F0BE3CC
		pgs[6] = 0x56F4A8CE
        pgs[7] = 0xE9AAD573
        pgs[8] = 0x2D2984EB
        pgs[9] = 0x31ABF075
        pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x1ECF6D90
		pgs[12] = 0xDE773AC7
		pgs[16] = 0x9816F95D
		pgs[15] = "普通模型.wdf"
     elseif pg == "进阶真陀护法_饰品_普通" then
		pgs[1] = 0x399934F0
		pgs[2] = 0xF656CE7D
		pgs[3] = 0xB76C8B0B
		pgs[4] = 0x0367F80B
		pgs[6] = 0x0D94451F
        pgs[7] = 0x37D65A3E
        pgs[8] = 0xA6273DC4
        pgs[9] = 0x2DDC9C00
        pgs[10] = "战斗模型.wdf"
	elseif pg =="龙马_普通"then
	    pgs[1]=0x4EC9F85A
		pgs[2]=0xBB661D15
		pgs[3]=0xF549E418
		pgs[4]=0xD9326464
		pgs[6]=0x0D8CE56B
		pgs[7]=0xF7BAB56F
		pgs[8]=0x6A27A943
		pgs[9]=0x7515DFAA
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x7CAE7545
		pgs[12] = 0xDB361AE8
		pgs[16] = 0x6641AFE4
		pgs[15] = "普通模型.wdf"

	elseif pg =="牛虱_普通"then
	    pgs[1] = 0xC6E67E4F
		pgs[2] = 0xD04BFDC1
		pgs[3] = 0xB01111D9
		pgs[4] = 0xFA3ED116
		pgs[6] = 0x4B1AAA96
		pgs[7] = 0xB73151F2
		pgs[8] = 0x7E3F0677
		pgs[9] = 0xD00BAF62
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x46702722
		pgs[12] = 0x01B2151D
		pgs[16] = 0x4614738E
		pgs[15] = "普通模型.wdf"
	elseif pg == "牛虱_饰品_普通"then
	    pgs[1] = 0xE8B8F7CB
		pgs[2] = 0x5145536E
		pgs[3] = 0xD88ACCAE
		pgs[4] = 0x5A09ABF2
		pgs[6] = 0x683CA512
		pgs[7] = 0x46F38E3C
		pgs[8] = 0x17F712C3
		pgs[9] = 0xB0D7EB0B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="镜妖_普通"then
	    pgs[1] = 0x14E37A84
		pgs[2] = 0x65510E4C
		pgs[3] = 0xDC463BAE
		pgs[4] = 0x17FED580
		pgs[6] = 0x5D14FA93
		pgs[7] = 0x864E1613
		pgs[8] = 0x7183CD86
		pgs[9] = 0x90E88043
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xC02F26A5
		pgs[12] = 0x6BB76CCE
		pgs[16] = 0x48F1FE02
		pgs[15] = "普通模型.wdf"
	elseif pg =="镜妖_饰品_普通"then
	    pgs[1] = 0xEAD30AFB
		pgs[2] = 0xD3D6D3A2
		pgs[3] = 0xD1B3F222
		pgs[4] = 0x337F7E24
		pgs[6] = 0xF2D1F2C1
		pgs[7] = 0xA25CA982
		pgs[8] = 0x40D79821
		pgs[9] = 0xAEAB9F92
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶镜妖_普通"then
	    pgs[1] = 0x5213F252
		pgs[2] = 0xC808B1C7
		pgs[3] = 0xF7A9EE96
		pgs[4] = 0x7246C3FB
		pgs[6] = 0xF0689F72
		pgs[7] = 0x8E0A91B0
		pgs[8] = 0xDF0787C3
		pgs[9] = 0xE98705C8
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x526FAE9C
		pgs[12] = 0xC645150E
		pgs[16] = 0xBA30964E
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶镜妖_饰品_普通"then
	    pgs[1] = 0x4B99ED2E
		pgs[2] = 0x42655C4E
		pgs[3] = 0xC84F54D4
		pgs[4] = 0xF9E36067
		pgs[6] = 0xAE54547A
		pgs[7] = 0x8D38A262
		pgs[8] = 0x62B9CC72
		pgs[9] = 0x4D652CDE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="金铙僧_普通"then
	    pgs[1] = 0x38E014D7
		pgs[2] = 0x7B2B6FC3
		pgs[3] = 0x48AD22ED
		pgs[4] = 0x15A79F28
		pgs[6] = 0x8631C2B1
		pgs[7] = 0x2248AA45
		pgs[8] = 0x9B3CF0EA
		pgs[9] = 0x62CD189A
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xE46674A2
		pgs[12] = 0x46384746
		pgs[16] = 0xD7ED2BC6
		pgs[15] = "普通模型.wdf"
	elseif pg =="金铙僧_饰品_普通"then
	    pgs[1] = 0x35FEE816
		pgs[2] = 0xF93DF26F
		pgs[3] = 0x09C6BE0C
		pgs[4] = 0x90861F82
		pgs[6] = 0xAEA6C98A
		pgs[7] = 0x10EC72AD
		pgs[8] = 0xC1E4DE67
		pgs[9] = 0x16136B55
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶金铙僧_普通"then
	    pgs[1] = 0x1AD25609
		pgs[2] = 0x443B7EBE
		pgs[3] = 0x76CF52C3
		pgs[4] = 0xCDBE73B1
		pgs[6] = 0x8D076633
		pgs[7] = 0x4E6467C0
		pgs[8] = 0x3418E55B
		pgs[9] = 0xFA5D3745
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x18014E24
		pgs[12] = 0x41E3BFF9
		pgs[16] = 0xBE826521
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶金铙僧_饰品_普通"then
	    pgs[1] = 0x7F58C138
		pgs[2] = 0xFA0B0A8A
		pgs[3] = 0xCF1D1CFA
		pgs[4] = 0x3C180653
		pgs[6] = 0xEDA4EA2C
		pgs[7] = 0x018C11D6
		pgs[8] = 0x3EA1B740
		pgs[9] = 0x359D7B4D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="泪妖_普通"then
	    pgs[1] = 0xCC9AAEE5
		pgs[2] = 0x6F0B153D
		pgs[3] = 0xBB6C68EB
		pgs[4] = 0x17ACFC2C
		pgs[6] = 0xB3660D3A
		pgs[7] = 0x9E599B6C
		pgs[8] = 0x147F84A6
		pgs[9] = 0x6D93F6D8
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xF6807D96
		pgs[12] = 0x774F7A03
		pgs[16] = 0xE8923A84
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶泪妖_普通"then
	    pgs[1] = 0x88212DAB
		pgs[2] = 0x52E785F1
		pgs[3] = 0x70C439E3
		pgs[4] = 0xEF70986D
		pgs[6] = 0x97779A94
		pgs[7] = 0x840F0720
		pgs[8] = 0x6272607D
		pgs[9] = 0x01C7595D
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x62649885
		pgs[12] = 0x6A570A79
		pgs[16] = 0x7FDC1D43
		pgs[15] = "普通模型.wdf"

	elseif pg =="增长巡守_普通"then
	    pgs[1] = 0x26B97F1B
		pgs[2] = 0x5788E61F
		pgs[3] = 0xA9905F03
		pgs[4] = 0xE28991E5
		pgs[6] = 0x5886EC62
		pgs[7] = 0x34FBC7D6
		pgs[8] = 0x1E9C2F0A
		pgs[9] = 0x2606001E
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x2DE97337
		pgs[12] = 0x4AAEB519
		pgs[16] = 0x57980622
		pgs[15] = "普通模型.wdf"

	elseif pg =="增长巡守_饰品_普通"then
	    pgs[1] = 0x49C2ED93
		pgs[2] = 0x06A7E497
		pgs[3] = 0xB8510C56
		pgs[4] = 0x5A1E5397
		pgs[6] = 0xCCA8469A
		pgs[7] = 0x95DF7280
		pgs[8] = 0xB97D4400
		pgs[9] = 0xCF8C43EC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶增长巡守_普通"then
	    pgs[1] = 0x030573CE
		pgs[2] = 0x7BF37A7D
		pgs[3] = 0x2642269B
		pgs[4] = 0xF62FE03D
		pgs[6] = 0x1E06D7E8
		pgs[7] = 0x6876B5D2
		pgs[8] = 0xC0FCC4AE
		pgs[9] = 0x70884304
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x4AA9D4DD
		pgs[12] = 0xEF92F600
		pgs[16] = 0xBC3EAA3A
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶增长巡守_饰品_普通"then
	    pgs[1] = 0x11F84A37
		pgs[2] = 0xE725832B
		pgs[3] = 0x7DDBCF4B
		pgs[4] = 0xADCF35E9
		pgs[6] = 0xF9BD51D7
		pgs[7] = 0x0CBAF08F
		pgs[8] = 0x3FC324D8
		pgs[9] = 0x0D9B0E34
		pgs[10] ="战斗模型.wdf"
	elseif pg =="持国巡守_普通"then
	    pgs[1] = 0x84CB0E62
		pgs[2] = 0x8EEFF02C
		pgs[3] = 0xB367E3EE
		pgs[4] = 0xBA687362
		pgs[6] = 0x784101C7
		pgs[7] = 0x917EAD51
		pgs[8] = 0x86FB90B6
		pgs[9] = 0xC73246A6
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xEA995304
		pgs[12] = 0xA1041D6D
		pgs[16] = 0xF2662308
		pgs[15] = "普通模型.wdf"
	elseif pg == "持国巡守_饰品_普通" then
		pgs[1] = 0x1D16D5B6
		pgs[2] = 0xAF59E387
		pgs[3] = 0xD4BC4D3F
		pgs[4] = 0xD3805DD8
		pgs[6] = 0x28F2180E
		pgs[7] = 0xA0B1F1DF
		pgs[8] = 0x65CFF2A5
		pgs[9] = 0x25B3888E
		pgs[10] = "战斗模型.wdf"
	elseif pg == "进阶持国巡守_普通" then
		pgs[2] = 0xACCB92CC
		pgs[1] = 0x1FD31FF6
		pgs[3] = 0x5AC5EAC2
		pgs[4] = 0xCF762FBB
		pgs[6] = 0x45763667
        pgs[7] = 0x5CFD0CC0
        pgs[8] = 0xCCC693A8
        pgs[9] = 0x6F97964A
        pgs[10] = "战斗模型.wdf"
		pgs[16] = 0xFA30944C
		pgs[12] = 0xB2045A0A
		pgs[11] = 0xDDC3E82D
		pgs[15] = "普通模型.wdf"
    elseif pg == "进阶持国巡守_饰品_普通" then
		pgs[2] = 0x6FDB5ACC
		pgs[1] = 0x9F3C7E23
		pgs[3] = 0x15D11B5C
		pgs[4] = 0x49031A87
		pgs[6] = 0x7DB786D9
        pgs[7] = 0x56916F3B
        pgs[8] = 0xC1032970
        pgs[9] = 0x12945E04
        pgs[10] = "战斗模型.wdf"
	elseif pg =="般若天女_普通"then
	    pgs[1] = 0x6210876B
		pgs[2] = 0x5FCBF9E2
		pgs[3] = 0xF0E1008C
		pgs[4] = 0x08C0F8A8
		pgs[6] = 0x9707F281
		pgs[7] = 0x04149886
		pgs[8] = 0xF1B7DFED
		pgs[9] = 0xE86E0AA8
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x813C3438
		pgs[12] = 0x1FEB2910
		pgs[16] = 0x63A1780C
		pgs[15] = "普通模型.wdf"

    elseif pg =="般若天女_饰品_普通"then
	    pgs[1] = 0xE3E4E818
		pgs[2] = 0x6FEFC800
		pgs[3] = 0xF98F1407
		pgs[4] = 0x1FE0AB7C
		pgs[6] = 0xC4B644BF
		pgs[7] = 0x54612375
		pgs[8] = 0xD03B6B45
		pgs[9] = 0xC0F359DB
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶般若天女_普通"then
	    pgs[1] = 0x16371442
		pgs[2] = 0xE87E7C3F
		pgs[3] = 0x0C8B30E8
		pgs[4] = 0xF04C4E62
		pgs[6] = 0x802F930D
		pgs[7] = 0x6C341850
		pgs[8] = 0x6A0FF793
		pgs[9] = 0x184A6609
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xE59C493A
		pgs[12] = 0x4A5C90BE
		pgs[16] = 0x5E9C020A
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶般若天女_饰品_普通"then
	    pgs[1] = 0x517971B2
		pgs[2] = 0x164B3BE8
		pgs[3] = 0x20D854D0
		pgs[4] = 0xD7C8F51F
		pgs[6] = 0xD7B7AC58
		pgs[7] = 0x7230CF8D
		pgs[8] = 0x7469309E
		pgs[9] = 0x929C1D3E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="灵灯侍者_普通"then
	    pgs[1] = 0x2A897C32
		pgs[2] = 0xC33D25CB
		pgs[3] = 0x32E364CF
		pgs[4] = 0xD97F5424
		pgs[6] = 0x5723E136
		pgs[7] = 0xACEAD4A9
		pgs[8] = 0xD06B232C
		pgs[9] = 0x23FFF355
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xAA40DC28
		pgs[12] = 0x6E200F7B
		pgs[16] = 0x7966374D
		pgs[15] = "普通模型.wdf"
	elseif pg =="灵灯侍者_饰品_普通"then
	    pgs[1] = 0xEA295B97
		pgs[2] = 0x05AD1F37
		pgs[3] = 0x0875104B
		pgs[4] = 0x3548EE75
		pgs[6] = 0xEB2DA1C8
		pgs[7] = 0xA8642381
		pgs[8] = 0x5CF2B095
		pgs[9] = 0xF4774111
		pgs[10] ="战斗模型.wdf"
	elseif pg =="进阶灵灯侍者_普通"then
	    pgs[1] = 0x19FAE659
		pgs[2] = 0xC49F0CDC
		pgs[3] = 0x72BD4045
		pgs[4] = 0x368BCC8A
		pgs[6] = 0xDEF50717
		pgs[7] = 0x2E4DDED0
		pgs[8] = 0xF0590BB0
		pgs[9] = 0x490DAC93
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x65F3D51E
		pgs[12] = 0xF3CA9B9D
		pgs[16] = 0x20C26B09
		pgs[15] = "普通模型.wdf"

	elseif pg =="进阶灵灯侍者_饰品_普通"then
	    pgs[1] = 0x4BF2B9B5
		pgs[2] = 0x21AEC840
		pgs[3] = 0xF33BC3D5
		pgs[4] = 0x12FF1991
		pgs[6] = 0xEC6AEBC4
		pgs[7] = 0xB70A5FD7
		pgs[8] = 0x5EE1A3C5
		pgs[9] = 0xD006C2F3
		pgs[10] ="战斗模型.wdf"
	elseif pg =="琴仙_普通"then
	    pgs[1] = 0xBAA0035A
		pgs[2] = 0x3262C63D
		pgs[3] = 0xC4E0425C
		pgs[4] = 0x595067A7
		pgs[6] = 0x6E6567D4
		pgs[7] = 0x42270A8F
		pgs[8] = 0x0C1E363C
		pgs[9] = 0xFB047799
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xFEDDE864
		pgs[12] = 0x62A2596C
		pgs[16] = 0xA68FD1F7
		pgs[15] = "普通模型.wdf"
	elseif pg =="进阶琴仙_普通"then
	    pgs[1] = 0xA7374E9F
		pgs[2] = 0x89FB39DD
		pgs[3] = 0x48248008
		pgs[4] = 0x7E11E45C
		pgs[6] = 0x77839D70
		pgs[7] = 0x7316DC16
		pgs[8] = 0x5E0B0694
		pgs[9] = 0xB1343D2A
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x27091438
		pgs[12] = 0xE261700C
		pgs[16] = 0x54FC3258
		pgs[15] = "普通模型.wdf"
		-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	elseif pg =="蜈蚣精_普通"then
	    pgs[1] = 0x1279E93F
		pgs[2] = 0x10E66935
		pgs[3] = 0x6BA99908
		pgs[4] = 0x9C39B91D
		pgs[6] = 0x2B59854C
		pgs[7] = 0x93EB5E15
		pgs[8] = 0x2B59854C
		pgs[9] = 0x18CC3124
		pgs[10] ="护盾括号.wdf"
	--神兽
	elseif pg == "善财童子鼓_普通" then
	    pgs[1] = 0x5AAB889E
		pgs[2] = 0xCE5B2F27
		pgs[3] = 0x8B2C16D3
		pgs[4] = 0xC963B17E
		pgs[6] = 0x7E685F11
        pgs[7] = 0x1BBE6789
        pgs[8] = 0x60340C5F
        pgs[9] = 0x243409A9
        pgs[10] = "战斗模型.wdf"
    elseif pg == "善财童子鼓_饰品_普通" then
	    pgs[1] = 0xD7F7FE2A
		pgs[2] = 0x54B2D695
		pgs[3] = 0xF58BC412
		pgs[4] = 0x98CDFC94
		pgs[6] = 0xDC1788E0
        pgs[7] = 0x5738D3AD
        pgs[8] = 0x480CA071
        pgs[9] = 0xBC5E6DDC
        pgs[10] = "战斗模型.wdf"
    elseif pg == "善财童子玉_普通" then
	    pgs[1] = 0x5AAB889E
		pgs[2] = 0xCE5B2F27
		pgs[3] = 0x8B2C16D3
		pgs[4] = 0xC963B17E
		pgs[6] = 0x7E685F11
        pgs[7] = 0x1BBE6789
        pgs[8] = 0x60340C5F
        pgs[9] = 0x243409A9
        pgs[10] = "战斗模型.wdf"
    elseif pg == "善财童子玉_饰品_普通" then
	    pgs[1] = 0x282ED175
		pgs[2] = 0x043E38E2
		pgs[3] = 0x58ED1802
		pgs[4] = 0x1419AF93
		pgs[6] = 0xCA6E3D77
        pgs[7] = 0xCC03DCF5
        pgs[8] = 0xDC083E9E
        pgs[9] = 0x84482BD8
        pgs[10] = "战斗模型.wdf"
	elseif pg == "超级腾蛇_普通" or pg =="进阶超级腾蛇_普通" then
	    pgs[1] = 0x2D55C711
		pgs[2] = 0x212B61B8
		pgs[3] = 0x194B0A66
		pgs[4] = 0xF4DDF4C7
		pgs[6] = 0x277A9966
        pgs[7] = 0x1BF0086B
        pgs[8] = 0x8CFB271D
        pgs[9] = 0x0ADF554C
        pgs[10] = "战斗模型.wdf"
	elseif pg =="超级赤焰兽_普通" or pg =="进阶超级赤焰兽_普通" then
	    pgs[1] = 0xD24D54AC
		pgs[2] = 0x4B1D77C0
		pgs[3] = 0x8F5C9F7A
		pgs[4] = 0xB4A07130
		pgs[6] = 0x183AB443
		pgs[7] = 0xD4C96E33
		pgs[8] = 0xBF41F3FE
		pgs[9] = 0xADDB702B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神鸡_普通" or pg =="进阶超级神鸡_普通" then
	    pgs[1] = 0xB048C29D
		pgs[2] = 0xCE582DDA
		pgs[3] = 0xF918866B
		pgs[4] = 0x0F38B4D9
		pgs[6] = 0x3291C30D
		pgs[7] = 0x6F5CB76C
		pgs[8] = 0x82EEF8AD
		pgs[9] = 0x070CB2A1
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xB0373051
		pgs[12] = 0x7077369A
		pgs[16] = 0x4058C44B
		pgs[15] = "普通模型.wdf"
	elseif pg =="超级人参娃娃_普通" or pg =="进阶超级人参娃娃_普通" then
	    pgs[1] = 0x0C42D1D8
		pgs[2] = 0x000D9783
		pgs[3] = 0xE7A003F1
		pgs[4] = 0x4CDC6BB6
		pgs[6] = 0xB3BE1374
		pgs[7] = 0x48684A76
		pgs[8] = 0xD146D0B8
		pgs[9] = 0x8AF9964F
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级土地公公_普通" or pg =="进阶超级土地公公_普通" then
	    pgs[1] = 0x3E6A97CB
		pgs[2] = 0xE7ABE39C
		pgs[3] = 0xFD2CD3F2
		pgs[4] = 0xEB64BD4C
		pgs[6] = 0xDB917557
		pgs[7] = 0x44DB09D1
		pgs[8] = 0x1871EC74
		pgs[9] = 0x6B53A718
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x6BE5F454
		pgs[12] = 0x09D4B696
		pgs[16] = 0xF48458BD
		pgs[15] ="普通模型.wdf"
	elseif pg =="超级土地公公_饰品_普通" or pg =="进阶超级土地公公_饰品_普通" then
	    pgs[1] = 0x125C9DE3
	    pgs[2] = 0x11F5334B
		pgs[3] = 0x2D07DD15
		pgs[4] = 0x5C383950
		pgs[6] = 0xC41A7327
		pgs[7] = 0xCB6197D9
		pgs[8] = 0x29576B3D
		pgs[9] = 0xC9D33E5D
		pgs[10] ="战斗模型.wdf"
		--1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	elseif pg =="超级筋斗云_普通" or pg =="进阶超级筋斗云_普通" then
	    pgs[1] = 0x24251EFC
		pgs[2] = 0x8B2F2F9B
		pgs[3] = 0x7A8436FD
		pgs[4] = 0x818FF438
		pgs[6] = 0x02379071
		pgs[7] = 0xF509F1E1
		pgs[8] = 0x256F1AF4
		pgs[9] = 0x9862F314
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级大鹏_普通" or pg =="进阶超级大鹏_普通" then
	    pgs[1] = 0x0459D0C9
		pgs[2] = 0x1CE13606
		pgs[3] = 0x250ACC97
		pgs[4] = 0x57388E49
		pgs[6] = 0x3AF99E76
		pgs[7] = 0xBE426A11
		pgs[8] = 0x8A6EB7CC
		pgs[9] = 0xF320C91E
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级麒麟_普通" or pg =="进阶超级麒麟_普通" then
	    pgs[1] = 0x8B975642
		pgs[2] = 0x9CEBC627
		pgs[3] = 0x6CF41D88
		pgs[4] = 0xFE90C7E8
		pgs[6] = 0x481CF06B
		pgs[7] = 0x51E4D7C2
		pgs[8] = 0x3F2F2665
		pgs[9] = 0x04B94943
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级孔雀_普通" or pg =="进阶超级孔雀_普通" then
	    pgs[1] = 0xF3C41015
		pgs[2] = 0x0504A51B
		pgs[3] = 0x8378F293
		pgs[4] = 0xB553702F
		pgs[6] = 0xC5BD436C
		pgs[7] = 0xD05DC9EB
		pgs[8] = 0xDD1B6B4A
		pgs[9] = 0x6B62E486
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级灵狐_普通" or pg =="进阶超级灵狐_普通" then
	    pgs[1] = 0xAC07EE00
		pgs[2] = 0x9D3B0167
		pgs[3] = 0xE66363B4
		pgs[4] = 0x12B7F915
		pgs[6] = 0x83B6301C
		pgs[7] = 0xD11C3E29
		pgs[8] = 0x7E850C9B
		pgs[9] = 0x094B19E8
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级大熊猫_普通" or pg =="进阶超级大熊猫_普通" then
	    pgs[1] = 0x6D7D1072
		pgs[2] = 0xEEA8BA73
		pgs[3] = 0x28F2D85A
		pgs[4] = 0x4517E097
		pgs[6] = 0x4FF2EBAB
		pgs[7] = 0x479EB55A
		pgs[8] = 0xD1BDA75F
		pgs[9] = 0x3380E107
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神马_普通" or pg =="进阶超级神马_普通" then
	    pgs[1] = 0xFAE30A85
		pgs[2] = 0x54E2C4FC
		pgs[3] = 0x815821B5
		pgs[4] = 0xCDEE504D
		pgs[6] = 0x0B9AC09C
		pgs[7] = 0xBB81A407
		pgs[8] = 0xC198AE91
		pgs[9] = 0x2803B38C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级六耳猕猴_普通" or pg =="进阶超级六耳猕猴_普通" then
	    pgs[1] = 0x658531AB
		pgs[2] = 0xBFB3306A
		pgs[3] = 0xF45D1F93
		pgs[4] = 0xDE8FCD95
		pgs[6] = 0x5AE939F4
		pgs[7] = 0x68108E38
		pgs[8] = 0xDE8F6E5A
		pgs[9] = 0xE93C3E81
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x21D839A3
		pgs[12] = 0xE762A017
		pgs[16] = 0x296BD86B
		pgs[15] = "普通模型.wdf"
	elseif pg =="超级神龙_普通" or pg =="进阶超级神龙_普通" then
	    pgs[1] = 0x6F1EE22E
		pgs[2] = 0x83D92AE3
		pgs[3] = 0x0E167636
		pgs[4] = 0x97AD4D51
		pgs[6] = 0x5949EC31
		pgs[7] = 0xF49E974E
		pgs[8] = 0x3B42F8B4
		pgs[9] = 0x4A238044
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级大象_普通" or pg =="进阶超级大象_普通" then
	    pgs[1] = 0x1752A15D
		pgs[2] = 0x6EE899E7
		pgs[3] = 0x6B012F02
		pgs[4] = 0x73C54B13
		pgs[6] = 0x8E5B6E48
		pgs[7] = 0xBE5CDC49
		pgs[8] = 0xD26F85A4
		pgs[9] = 0x0EB91A8D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级金猴_普通" or pg =="进阶超级金猴_普通" then
	    pgs[1] = 0xB26E14F5
		pgs[2] = 0x12BF6FC0
		pgs[3] = 0x2E6F465E
		pgs[4] = 0xBAF219BA
		pgs[6] = 0x5CFB35A4
		pgs[7] = 0x3F2F6B47
		pgs[8] = 0x2A76AF8E
		pgs[9] = 0x818B17F7
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级泡泡_普通" or pg =="进阶超级泡泡_普通" then
	    pgs[1] = 0x578E4E20
		pgs[2] = 0xEA07D23E
		pgs[3] = 0xC1F40330
		pgs[4] = 0x1025669C
		pgs[6] = 0xE2D684A7
		pgs[7] = 0x31FE8589
		pgs[8] = 0x5A488708
		pgs[9] = 0x3413F529
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神羊_普通" or pg =="进阶超级神羊_普通" then
	    pgs[1] = 0x116605E1
		pgs[2] = 0x7E60BB6C
		pgs[3] = 0xC162B3F3
		pgs[4] = 0x4312B448
		pgs[6] = 0x68BC67E8
		pgs[7] = 0x26A9EF1F
		pgs[8] = 0xBF961C95
		pgs[9] = 0x139C8FF3
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x63D5219A
		pgs[12] = 0x35DD725B
		pgs[16] = 0x5FB77EDF
		pgs[15] = "普通模型.wdf"
	elseif pg =="超级神虎_普通" or pg =="进阶超级神虎_普通" then
	    pgs[1] = 0xC812DE4B
		pgs[2] = 0x8452D27F
		pgs[3] = 0x16F9A3E7
		pgs[4] = 0x9B50048D
		pgs[6] = 0x1174DEC2
		pgs[7] = 0x24F80534
		pgs[8] = 0xCDBFE2DC
		pgs[9] = 0xEAFEAE18
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级青鸾_普通" or pg == "进阶超级青鸾_普通" then
	    pgs[1] = 0x4E372650
		pgs[2] = 0xD2494FBC
		pgs[3] = 0x136F530A
		pgs[4] = 0x99A6AED4
		pgs[6] = 0x22ADF5E1
		pgs[7] = 0x3CA1C679
		pgs[8] = 0xC369D5F9
		pgs[9] = 0x7013F056
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级赤焰兽_普通" or pg == "进阶超级赤焰兽_普通" then
	    pgs[1] = 0xD24D54AC
		pgs[2] = 0xD24D54AC
		pgs[3] = 0x8F5C9F7A
		pgs[4] = 0xB4A07130
		pgs[6] = 0x183AB443
		pgs[7] = 0xD4C96E33
		pgs[8] = 0x2B9DCF67
		pgs[9] = 0xADDB702B
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级白泽_普通" or pg == "进阶超级白泽_普通" then
	    pgs[1] = 0x46229E6F
		pgs[2] = 0x660C3935
		pgs[3] = 0x8786565C
		pgs[4] = 0x920B8D0E
		pgs[6] = 0xAA27D3BB
		pgs[7] = 0xCC60A0B4
		pgs[8] = 0xA45E50B2
		pgs[9] = 0xB56BA2DF
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神蛇_普通" or pg == "进阶超级神蛇_普通"  then
	    pgs[1] = 0x7AD386DF
		pgs[2] = 0xA6BA684D
		pgs[3] = 0x7BBEC060
		pgs[4] = 0x6CDDC04D
		pgs[6] = 0x6EA5597F
		pgs[7] = 0xB255F50B
		pgs[8] = 0x9911DED2
		pgs[9] = 0x55E342FC
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级海豚_普通" or pg == "进阶超级海豚_普通" then
	    pgs[1] = 0x52AB750A
		pgs[2] = 0x7CAC9222
		pgs[3] = 0xD03C19EF
		pgs[4] = 0x65BCDD9F
		pgs[6] = 0x4B592393
		pgs[7] = 0x66B6EDAD
		pgs[8] = 0x84D2F6B7
		pgs[9] = 0xF2142000
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神兔_普通" or pg == "进阶超级神兔_普通" then
	    pgs[1] = 0x97F8F299
		pgs[2] = 0xF5A92C68
		pgs[3] = 0x487C29A2
		pgs[4] = 0x3A52E796
		pgs[6] = 0x77845235
		pgs[7] = 0x53ECC589
		pgs[8] = 0x54370885
		pgs[9] = 0xAEF12C9A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级灵鹿_普通" or pg == "进阶超级灵鹿_普通" then
	    pgs[1] = 0x40E44F30
		pgs[2] = 0x8C15E636
		pgs[3] = 0x5419AFEC
		pgs[4] = 0xF776BF6E
		pgs[6] = 0x49578F89
		pgs[7] = 0xCD20A9E1
		pgs[8] = 0xCAC235C1
		pgs[9] = 0x5D0BA7D9
		pgs[10] ="战斗模型.wdf"
	elseif pg =="超级神牛_普通" or pg == "进阶超级神牛_普通" then
	    pgs[1] = 0x875D93FE
		pgs[2] = 0xB97EBFC0
		pgs[3] = 0x64043116
		pgs[4] = 0x7F00FDBB
		pgs[6] = 0xA9C5802F
		pgs[7] = 0xC9B03C6C
		pgs[8] = 0xB068D594
		pgs[9] = 0x70327CC1
		pgs[10] ="战斗模型.wdf"
	elseif pg == "超级神猴_普通" or pg == "进阶超级神猴_普通" then
	    pgs[1] = 0x562127B8
		pgs[2] = 0xF9233E94
		pgs[3] = 0x28339EC5
		pgs[4] = 0x12BDF324
		pgs[6] = 0x5BA0B69C
        pgs[7] = 0xA69436FF
        pgs[8] = 0x29017C5B
        pgs[9] = 0x70925992
        pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x876E0CB3
		pgs[12] = 0x225228B2
		pgs[16] = 0xDB0BF35A
		pgs[15] = "普通模型.wdf"
    elseif pg == "超级腾蛇_普通" or pg == "进阶超级腾蛇_普通" then
	    pgs[1] = 0x2D55C711
		pgs[2] = 0x2D55C711
		pgs[3] = 0x194B0A66
		pgs[4] = 0xF4DDF4C7
		pgs[6] = 0x277A9966
        pgs[7] = 0x1BF0086B
        pgs[8] = 0x8CFB271D
        pgs[9] = 0x0ADF554C
        pgs[10] = "战斗模型.wdf"
	elseif pg == "超级玉兔_普通" or pg == "进阶超级玉兔_普通" then
	    pgs[1] = 0x5A396A2E
		pgs[2] = 0x5A396A34
		pgs[3] = 0x5A396A2C
		pgs[4] = 0x5A396A2D
		pgs[6] = 0x5A396A2B
        pgs[7] = 0x5A396A33
        pgs[8] = 0x5A396A32
        pgs[9] = 0x5A396A2A
        pgs[10] = "战斗模型.wdf"
		pgs[11] = 0x54AB99C8
		pgs[12] = 0x5F8D0A1F
		pgs[16] = 0x1ED288F4
		pgs[15] = "普通模型.wdf"
    ----------新增新宠物-------------------------
    elseif pg =="地涌夫人_普通"then
        pgs[1]=0x3AE7A8F2
		pgs[2]=0x78F227D8
		pgs[3]=0xD4124C46
		pgs[4]=0x5E0EFF3A
		pgs[6]=0x2EDEAF19
		pgs[7]=0x65192B88
		pgs[8]=0xA69241A0
		pgs[9]=0xC4FD3D4D
		pgs[10] ="战斗模型.wdf"
	elseif pg =="二郎神_普通"then
        pgs[1]=0x3C04B467
		pgs[2]=0x0AF3DDAD
		pgs[3]=0x506FB295
		pgs[4]=0xFDEB3130
		pgs[6]=0x894CBF63
		pgs[7]=0x3304B122
		pgs[8]=0x829CFEA0
		pgs[9]=0xCFD07D68
		pgs[10] ="战斗模型.wdf"
	elseif pg =="巫奎虎_普通"then
        pgs[1]=0xAB3F493A
		pgs[2]=0x3D7718F1
		pgs[3]=0x6DED77DA
		pgs[4]=0x4286FB27
		pgs[6]=0xA9DD17BC
		pgs[7]=0x0D6E6F43
		pgs[8]=0x4BC4A592
		pgs[9]=0xA1C77A74
		pgs[10] ="战斗模型.wdf"
	elseif pg =="程咬金_普通"then
        pgs[1]=0xEE96905A
		pgs[2]=0xD3E3A473
		pgs[3]=0xB41DCF3F
		pgs[4]=0x87EF3814
		pgs[6]=0xE1A120FF
		pgs[7]=0x15125FC7
		pgs[8]=0xD99529D8
		pgs[9]=0x5868EDBE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="东海龙王_普通"then
        pgs[1]=0x12062DFD
		pgs[2]=0xA730EB06
		pgs[3]=0xA9135905
		pgs[4]=0x0623BF6C
		pgs[6]=0x263C28F5
		pgs[7]=0xD8AC6ADA
		pgs[8]=0xEA1FB934
		pgs[9]=0xB45AC1CB
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x6C5CBB68
		pgs[12] = 0x9CA707D3
		pgs[16] = 0xE75DAEAA
		pgs[15] = "普通模型.wdf"
	elseif pg =="孙婆婆_普通"then
        pgs[1]=0x44EE03AD
		pgs[2]=0x8ACDDCAE
		pgs[3]=0x06F4EEC5
		pgs[4]=0x60F5A1CF
		pgs[6]=0xFBB05C33
		pgs[7]=0x7E2E23A0
		pgs[8]=0x6F41C860
		pgs[9]=0xEED0BF37
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x0F201592
		pgs[12] = 0x73B1558F
		pgs[16] = 0x6F515E25
		pgs[15] = "普通模型.wdf"

	elseif pg =="牛魔王_普通"then
        pgs[1]=0xC18A0B9F
		pgs[2]=0xDFAB4445
		pgs[3]=0x113CB79E
		pgs[4]=0xC096C013
		pgs[6]=0x0B69B44D
		pgs[7]=0x65EB0501
		pgs[8]=0xD8CFAC15
		pgs[9]=0x90BB1A9E
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x09C029A9
		pgs[12] = 0x72C110E5
		pgs[16] = 0xB1F577AB
		pgs[15] = "普通模型.wdf"

	elseif pg =="牛魔王_饰品_普通"then
        pgs[1]=0x2046CB95
		pgs[2]=0x7EB345C1
		pgs[3]=0x96B0A572
		pgs[4]=0xEA2D469F
		pgs[6]=0x64E51B02
		pgs[7]=0x703CE097
		pgs[8]=0x393490E0
		pgs[9]=0x7DC329CE
		pgs[10] ="战斗模型.wdf"
	elseif pg =="镇元大仙_普通"then
        pgs[1]=0x9E9D4886
		pgs[2]=0x9F64FB32
		pgs[3]=0x054F4C87
		pgs[4]=0xAE592351
		pgs[6]=0x75CDF97C
		pgs[7]=0x16385B4D
		pgs[8]=0x578BA3B5
		pgs[9]=0x5AD58D24
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x0A927EB1
		pgs[12] = 0x8C59AB3B
		pgs[16] = 0xDE4223A6
		pgs[15] = "普通模型.wdf"
	elseif pg =="菩提祖师_普通"then
        pgs[1]=0xBF5273C3
		pgs[2]=0x0A0ED7C6
		pgs[3]=0xEF5514E5
		pgs[4]=0x0ACD5800
		pgs[6]=0x2073F650
		pgs[7]=0xFC7EAE69
		pgs[8]=0x88BE1E61
		pgs[9]=0xE84C322A
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0x451D6B7D
		pgs[12] = 0xB8D766B2
		pgs[16] = 0xCD093578
		pgs[15] = "普通模型.wdf"

	elseif pg =="白晶晶_普通"then
        pgs[1]=0x7963E3C2
		pgs[2]=0xE1D303C3
		pgs[3]=0xE702BDC7
		pgs[4]=0xEF4D4EBB
		pgs[6]=0xF5D47E2E
		pgs[7]=0x0D45D160
		pgs[8]=0x2B6371A2
		pgs[9]=0x7FE8694C
		pgs[10] ="战斗模型.wdf"
	elseif pg =="李靖_普通"then
        pgs[2]=0x6A0DEC0F
		pgs[1]=0x90682983
		pgs[3]=0xBDA4348A
		pgs[4]=0xA14063D6
		pgs[6]=0xB760B5CC
		pgs[7]=0x14867FC2
		pgs[8]=0x67AA2B8A
		pgs[9]=0x8996BF86
		pgs[10] ="战斗模型.wdf"
		pgs[16] = 0x9F8DF0B8
		pgs[12] = 0x3388FFA2
		pgs[11] = 0x8ABCC311
		pgs[15] = "普通模型.wdf"
	elseif pg =="李靖_饰品_普通"then
        pgs[2]=0x704B4C72
		pgs[1]=0x79763AD1
		pgs[3]=0xD7FDDE24
		pgs[4]=0xFD2C04F1
		pgs[6]=0x492EEF88
		pgs[7]=0x960983B8
		pgs[8]=0xDAB186E4
		pgs[9]=0x16504675
		pgs[10] ="战斗模型.wdf"
	elseif pg =="地藏王_普通"then
        pgs[2]=0xD572D8E4
		pgs[1]=0xDBC25AB2
		pgs[3]=0x7AD0002B
		pgs[4]=0x4E4C9223
		pgs[6]=0x3A11C300
		pgs[7]=0x1A7C6CAC
		pgs[8]=0xD13E1FFF
		pgs[9]=0xA8312FDB
		pgs[10] ="战斗模型.wdf"
		pgs[16] = 0x1EA7DE85
		pgs[12] = 0xDDBA60F9
		pgs[11] = 0x7A8C772C
		pgs[15] = "普通模型.wdf"
	elseif pg =="大大王_普通"then
        pgs[1]=0xBD490B9E
		pgs[2]=0x99871326
		pgs[3]=0xD9B62122
		pgs[4]=0xF8EE8A5D
		pgs[6]=0xCE62A786
		pgs[7]=0xD5A6A3B1
		pgs[8]=0xBE283FFC
		pgs[9]=0x5E8396A5
		pgs[10] ="战斗模型.wdf"
		pgs[16] = 0xC2855F45
		pgs[12] = 0x2AF1F828
		pgs[11] = 0x23094A8C
		pgs[15] = "普通模型.wdf"
	elseif pg =="观音姐姐_普通"then
        pgs[1]=0x93DC0379
		pgs[2]=0xABC48778
		pgs[3]=0x471104A5
		pgs[4]=0xD503EE2F
		pgs[6]=0x0405C585
		pgs[7]=0x2ECAAEEF
		pgs[8]=0xF45349EA
		pgs[9]=0x5D49F27C
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xFFEDEDB5
		pgs[12] = 0x94596B0C
		pgs[16] = 0xC0BAA3A6
		pgs[15] = "普通模型.wdf"
	elseif pg =="空度禅师_普通"then
        pgs[1]=0x3674178B
		pgs[2]=0xD5F72B15
		pgs[3]=0xAC761E66
		pgs[4]=0xBD41CBB0
		pgs[6]=0xB73531B1
		pgs[7]=0x5B721A00
		pgs[8]=0x987B611D
		pgs[9]=0x4308F507
		pgs[10] ="战斗模型.wdf"
		pgs[11] = 0xCA02D49E
		pgs[12] = 0xB2458366
		pgs[16] = 0xACB80E59
		pgs[15] = "普通模型.wdf"
	elseif pg =="周杰伦_普通"then
        pgs[1]=0xAA5313BB
		pgs[2]=0x7B6CA3D6
		pgs[3]=0xB9C13DAB
		pgs[4]=0xB67D1163
		pgs[6]=0xA81EA7D2
		pgs[7]=0xAD73D867
		pgs[8]=0x3EBB092D
		pgs[9]=0x31B65A0A
		pgs[10] ="战斗模型.wdf"
	elseif pg =="木桩_普通"then
    	pgs[1]=0x69007849
		pgs[2]=0x69007849
		pgs[3]=0x69007850
		pgs[4]=0x69007851
		pgs[6]=0x00000002 --
		pgs[7]=0x69007852
		pgs[8]=0x69007853
		pgs[9]=0x00000001
		pgs[10] ="xcwsc.wdf"
	elseif pg == "偃无师_剑" then
		pgs[1] = 0xC8FDA315
		pgs[2] = 0xC8FDA315
		pgs[3] = 0xC8FDA179
		pgs[4] = 0x00C8FDA5
		pgs[6] = 0x0C8FDA90
		pgs[7] = 0x0C8FDA55
		pgs[8] = 0x0C8FDA63
		pgs[9] = 0xC8FDA371
		pgs[10] = "audio/1222.mp3"
		pgs[11] = 0xD84C88CC
		pgs[12] = 0xC56B969C
		pgs[15] = "audio/1115.mp3"
	elseif pg == "青铜短剑_偃无师_普通" then
		pgs[1] = 0xF8DD37CB
		pgs[2] = 0xF8DD37CB
		pgs[3] = 0xA2A6256E
		pgs[4] = 0x998F0F9A
		pgs[6] = 0x46DB51E2
		pgs[7] = 0x54507E29
		pgs[8] = 0xF264F47A
		pgs[9] = 0xDFAF8493
		pgs[10] = "audio/1222.mp3"
	elseif pg == "青锋剑_偃无师_普通" then
		pgs[1] = 0xAEE8BD71
		pgs[2] = 0xAEE8BD71
		pgs[3] = 0x63E57F9D
		pgs[4] = 0xD7C8F9E8
		pgs[6] = 0xB02A17DE
		pgs[7] = 0x257F48FB
		pgs[8] = 0xA803878F
		pgs[9] = 0x7BD1465C
		pgs[10] = "audio/1222.mp3"
	elseif pg == "游龙剑_偃无师_普通" then
		pgs[1] = 0x8275E104
		pgs[2] = 0x8275E104
		pgs[3] = 0x02261634
		pgs[4] = 0xFA873366
		pgs[6] = 0x3357F4CE
		pgs[7] = 0xA4F1C098
		pgs[8] = 0x76797182
		pgs[9] = 0x099B2418
		pgs[10] = "audio/1222.mp3"
	elseif pg == "鱼肠_偃无师_普通" then
		pgs[1] = 0x1F507E66
		pgs[2] = 0x1F507E66
		pgs[3] = 0x07AB885F
		pgs[4] = 0x796299C5
		pgs[6] = 0x097F5E71
		pgs[7] = 0xCE9CADF3
		pgs[8] = 0x19D6BB89
		pgs[9] = 0xE167D72D
		pgs[10] = "audio/1222.mp3"
	elseif pg == "倚天_偃无师_普通" then
		pgs[1] = 0x9A54CF2E
		pgs[2] = 0x9A54CF2E
		pgs[3] = 0xE33E1D20
		pgs[4] = 0x3632D870
		pgs[6] = 0x7F8DB9C8
		pgs[7] = 0xFEBBBC14
		pgs[8] = 0x18CB12EA
		pgs[9] = 0xBA3E2AD9
		pgs[10] = "audio/1222.mp3"
	elseif pg == "湛卢_偃无师_普通" then
		pgs[1] = 0xD9A821CC
		pgs[2] = 0xD9A821CC
		pgs[3] = 0x7AB82EA7
		pgs[4] = 0x52ADE316
		pgs[6] = 0xB1DF0E1B
		pgs[7] = 0x17DAFFD2
		pgs[8] = 0xD501AFBB
		pgs[9] = 0x5D681D5C
		pgs[10] = "audio/1222.mp3"
	elseif pg == "魏武青虹_偃无师_普通" then
		pgs[1] = 0xF870CFF7
		pgs[2] = 0xF870CFF7
		pgs[3] = 0x10AD6201
		pgs[4] = 0x2120194F
		pgs[6] = 0xFB30DC17
		pgs[7] = 0xE25C0098
		pgs[8] = 0xE994CBC7
		pgs[9] = 0x76DE282F
		pgs[10] = "audio/1222.mp3"
	elseif pg == "灵犀神剑_偃无师_普通" then
		pgs[1] = 0x53FF28DF
		pgs[2] = 0x53FF28DF
		pgs[3] = 0x55E1AC27
		pgs[4] = 0x9CA9AA0D
		pgs[6] = 0xED47ED45
		pgs[7] = 0xF3CDBF99
		pgs[8] = 0x30E9FB89
		pgs[9] = 0x398D9DDC
		pgs[10] = "audio/1222.mp3"
	elseif pg == "四法青云_偃无师_普通" then
		pgs[1] = 0x7F89FCB3
		pgs[2] = 0x7F89FCB3
		pgs[3] = 0x00919E5C
		pgs[4] = 0xAE8C251A
		pgs[6] = 0xDF6B7526
		pgs[7] = 0x2D55F615
		pgs[8] = 0x04906093
		pgs[9] = 0x8FC40F24
		pgs[10] = "audio/1222.mp3"
	elseif pg == "霜冷九州_偃无师_普通" then
		pgs[1] = 0xF7D26EA8
		pgs[2] = 0xF7D26EA8
		pgs[3] = 0x1824E3A5
		pgs[4] = 0x0F062CA2
		pgs[6] = 0xD2656D03
		pgs[7] = 0x2E368961
		pgs[8] = 0x853CFDD9
		pgs[9] = 0xEFB68790
		pgs[10] = "audio/1222.mp3"
	elseif pg == "擒龙_偃无师_普通" then
		pgs[1] = 0xF540EE21
		pgs[2] = 0xF540EE21
		pgs[3] = 0x25309EC1
		pgs[4] = 0x023069CA
		pgs[6] = 0x5C2C0872
		pgs[7] = 0x769CE33E
		pgs[8] = 0x2C7A88D9
		pgs[9] = 0xEFB68790
		pgs[10] = "audio/1222.mp3"

	elseif pg == "偃无师_普通" then
		pgs[1] = 0x00000097
		pgs[2] = 0x00000097
		pgs[3] = 0x00000100
		pgs[4] = 0x00000096
		pgs[6] = 0x00000095
		pgs[7] = 0x00000099
		pgs[8] = 0x00000101
		pgs[9] = 0x00000094
		pgs[10] = "common/shape.wda"
	elseif pg == "偃无师_巨剑" then
		pgs[1] = 0x00000097
		pgs[2] = 0x00000097
		pgs[3] = 0x00000100
		pgs[4] = 0x00000096
		pgs[6] = 0x00000095
		pgs[7] = 0x00000099
		pgs[8] = 0x00000101
		pgs[9] = 0x00000094
		pgs[10] = "common/shape.wda"
		pgs[11] = 0xEF1D0947
		pgs[12] = 0xC56B969C
		pgs[15] = "audio/1115.mp3"
	elseif pg == "钝铁重剑_偃无师_普通" then
		pgs[1] = 0x00000043
		pgs[2] = 0x00000043
		pgs[3] = 0x00000090
		pgs[4] = 0x00000031
		pgs[6] = 0x00000019
		pgs[7] = 0x00000054
		pgs[8] = 0x00000066
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wda"
	elseif pg == "壁玉长铗_偃无师_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000084
		pgs[4] = 0x00000025
		pgs[6] = 0x00000013
		pgs[7] = 0x00000037
		pgs[8] = 0x00000072
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wda"
	elseif pg == "惊涛雪_偃无师_普通" then
		pgs[1] = 0x00000049
		pgs[2] = 0x00000049
		pgs[3] = 0x00000085
		pgs[4] = 0x00000026
		pgs[6] = 0x00000014
		pgs[7] = 0x00000038
		pgs[8] = 0x00000048
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wda"
	elseif pg == "鸦九_偃无师_普通" then
		pgs[1] = 0x00000045
		pgs[2] = 0x00000045
		pgs[3] = 0x00000091
		pgs[4] = 0x00000033
		pgs[6] = 0x00000021
		pgs[7] = 0x00000055
		pgs[8] = 0x00000067
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wda"
	elseif pg == "昆吾_偃无师_普通" then
		pgs[1] = 0x00000047
		pgs[2] = 0x00000047
		pgs[3] = 0x00000086
		pgs[4] = 0x00000027
		pgs[6] = 0x00000015
		pgs[7] = 0x00000039
		pgs[8] = 0x00000051
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wda"
	elseif pg == "弦歌_偃无师_普通" then
		pgs[1] = 0x00000057
		pgs[2] = 0x00000057
		pgs[3] = 0x00000093
		pgs[4] = 0x00000034
		pgs[6] = 0x00000023
		pgs[7] = 0x00000046
		pgs[8] = 0x00000082
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wda"
	elseif pg == "墨骨枯麟_偃无师_普通" then
		pgs[1] = 0x00000040
		pgs[2] = 0x00000040
		pgs[3] = 0x00000087
		pgs[4] = 0x00000028
		pgs[6] = 0x00000016
		pgs[7] = 0x00000053
		pgs[8] = 0x00000063
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wda"
	elseif pg == "腾蛇郁刃_偃无师_普通" then
		pgs[1] = 0x00000042
		pgs[2] = 0x00000042
		pgs[3] = 0x00000089
		pgs[4] = 0x00000030
		pgs[6] = 0x00000018
		pgs[7] = 0x00000052
		pgs[8] = 0x00000103
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wda"
	elseif pg == "秋水澄流_偃无师_普通" then
		pgs[1] = 0x000000105
		pgs[2] = 0x000000105
		pgs[3] = 0x00000088
		pgs[4] = 0x00000029
		pgs[6] = 0x00000017
		pgs[7] = 0x00000041
		pgs[8] = 0x00000064
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wda"
	elseif pg == "百辟镇魂_偃无师_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000083
		pgs[4] = 0x00000024
		pgs[6] = 0x00000012
		pgs[7] = 0x00000106
		pgs[8] = 0x00000107
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wda"
	elseif pg == "长息_偃无师_普通" then
		pgs[1] = 0x00000044
		pgs[2] = 0x00000044
		pgs[3] = 0x00000092
		pgs[4] = 0x00000032
		pgs[6] = 0x00000020
		pgs[7] = 0x00000108
		pgs[8] = 0x00000109
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wda"


	elseif pg == "桃夭夭_飘带" then
		pgs[1] = 0x0C8FDA47
		pgs[2] = 0x0C8FDA47
		pgs[3] = 0x0C8FD720
		pgs[4] = 0xC8FDA180
		pgs[6] = 0x0C8FD718
		pgs[7] = 0xC8FDA296
		pgs[8] = 0xC8FDA289
		pgs[9] = 0xC8FDA287
		pgs[10] = "audio/1222.mp3"
		pgs[11] = 0x707D130D
		pgs[12] = 0x175B63C0
		pgs[15] = "audio/1115.mp3"
	elseif pg == "五色缎带_桃夭夭_普通" then
		pgs[1] = 0xA53FECF4
		pgs[2] = 0xA53FECF4
		pgs[3] = 0xA1E7D445
		pgs[4] = 0xEE1E86D1
		pgs[6] = 0xB6495C7D
		pgs[7] = 0xFEC751B2
		pgs[8] = 0x7C764187
		pgs[9] = 0x2151B286
		pgs[10] = "audio/1222.mp3"
	elseif pg == "无极丝_桃夭夭_普通" then
		pgs[1] = 0x2DC47758
		pgs[2] = 0x2DC47758
		pgs[3] = 0xB3A754CE
		pgs[4] = 0x7D829F97
		pgs[6] = 0x9CC635F2
		pgs[7] = 0x60D66D11
		pgs[8] = 0xA19D67DF
		pgs[9] = 0x8B8352B7
		pgs[10] = "audio/1222.mp3"
	elseif pg == "七彩罗刹_桃夭夭_普通" then
		pgs[1] = 0x4EB293C1
		pgs[2] = 0x4EB293C1
		pgs[3] = 0xA930B7BE
		pgs[4] = 0xF3D9B16B
		pgs[6] = 0x12EA4C25
		pgs[7] = 0x9F13C3D0
		pgs[8] = 0x04BF0188
		pgs[9] = 0xF9D6C3B0
		pgs[10] = "audio/1222.mp3"
	elseif pg == "彩虹_桃夭夭_普通" then
		pgs[1] = 0xA4E7E620
		pgs[2] = 0xA4E7E620
		pgs[3] = 0x7116581A
		pgs[4] = 0xBE9B3D09
		pgs[6] = 0x2AD9EA91
		pgs[7] = 0x723C25DD
		pgs[8] = 0xB7E14A4F
		pgs[9] = 0x620FE6B1
		pgs[10] = "audio/1222.mp3"
	elseif pg == "流云_桃夭夭_普通" then
		pgs[1] = 0x6F2E866F
		pgs[2] = 0x6F2E866F
		pgs[3] = 0xCD434139
		pgs[4] = 0x9D63EF9D
		pgs[6] = 0x1FE48F84
		pgs[7] = 0x0C923CE1
		pgs[8] = 0xF0EA98E1
		pgs[9] = 0x469ACA2A
		pgs[10] = "audio/1222.mp3"
	elseif pg == "碧波_桃夭夭_普通" then
		pgs[1] = 0xCE2B41EC
		pgs[2] = 0xCE2B41EC
		pgs[3] = 0x1DE079AD
		pgs[4] = 0x43D5E3BF
		pgs[6] = 0x37017692
		pgs[7] = 0x61BB1655
		pgs[8] = 0x28D8B610
		pgs[9] = 0x10DDCE44
		pgs[10] = "audio/1222.mp3"
	elseif pg == "秋水落霞_桃夭夭_普通" then
		pgs[1] = 0x07709C75
		pgs[2] = 0x07709C75
		pgs[3] = 0x08E3BA76
		pgs[4] = 0x88C1356A
		pgs[6] = 0xB0BBE8C7
		pgs[7] = 0xCC0CAEC1
		pgs[8] = 0x79521FAA
		pgs[9] = 0x474085ED
		pgs[10] = "audio/1222.mp3"
	elseif pg == "晃金仙绳_桃夭夭_普通" then
		pgs[1] = 0xC298B821
		pgs[2] = 0xC298B821
		pgs[3] = 0xFB027BB6
		pgs[4] = 0x3881F0F3
		pgs[6] = 0x7C243BCF
		pgs[7] = 0x1001EE49
		pgs[8] = 0x891407E9
		pgs[9] = 0x11353491
		pgs[10] = "audio/1222.mp3"
	elseif pg == "此最相思_桃夭夭_普通" then
		pgs[1] = 0xEDEC5CBC
		pgs[2] = 0xEDEC5CBC
		pgs[3] = 0xA0DE2FEF
		pgs[4] = 0x4A7673FE
		pgs[6] = 0x348D04BA
		pgs[7] = 0xB08135F3
		pgs[8] = 0x9DDEE2CD
		pgs[9] = 0x208786E5
		pgs[10] = "audio/1222.mp3"
	elseif pg == "揽月摘星_桃夭夭_普通" then
		pgs[1] = 0x169138C8
		pgs[2] = 0x169138C8
		pgs[3] = 0x87FBD841
		pgs[4] = 0x6329FE9E
		pgs[6] = 0xD292E908
		pgs[7] = 0x169E2035
		pgs[8] = 0xF8167E8D
		pgs[9] = 0x7EC4569E
		pgs[10] = "audio/1222.mp3"
	elseif pg == "九霄_桃夭夭_普通" then
		pgs[1] = 0x7F1A6777
		pgs[2] = 0x7F1A6777
		pgs[3] = 0xEBBD89FA
		pgs[4] = 0x8310F14C
		pgs[6] = 0x3CECB898
		pgs[7] = 0x31B08320
		pgs[8] = 0x48D96197
		pgs[9] = 0x7045A7D2
		pgs[10] = "audio/1222.mp3"

	elseif pg == "桃夭夭_普通" then
		pgs[1] = 0x00000088
		pgs[2] = 0x00000088
		pgs[3] = 0x00000094
		pgs[4] = 0x00000087
		pgs[6] = 0x00000086
		pgs[7] = 0x0C8FD725
		pgs[8] = 0x00000092
		pgs[9] = 0x00000085
		pgs[10] = "common/shape.wdb"
	elseif pg == "桃夭夭_灯笼" then
		pgs[1] = 0x00000088
		pgs[2] = 0x00000088
		pgs[3] = 0x00000094
		pgs[4] = 0x00000087
		pgs[6] = 0x00000086
		pgs[7] = 0x0C8FD725
		pgs[8] = 0x00000092
		pgs[9] = 0x00000085
		pgs[10] = "common/shape.wdb"
		pgs[11] = 0xC7F8CA2F
		pgs[12] = 0x244480EE
		pgs[15] = "audio/1115.mp3"
	elseif pg == "素纸灯_桃夭夭_普通" then
		pgs[1] = 0x00000037
		pgs[2] = 0x00000037
		pgs[3] = 0x00000080
		pgs[4] = 0x00000027
		pgs[6] = 0x00000017
		pgs[7] = 0x00000070
		pgs[8] = 0x00000048
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wdb"
	elseif pg == "如意宫灯_桃夭夭_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000079
		pgs[4] = 0x00000026
		pgs[6] = 0x00000016
		pgs[7] = 0x00000069
		pgs[8] = 0x00000047
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wdb"
	elseif pg == "玉兔盏_桃夭夭_普通" then
		pgs[1] = 0x00000039
		pgs[2] = 0x00000039
		pgs[3] = 0x00000082
		pgs[4] = 0x00000029
		pgs[6] = 0x00000019
		pgs[7] = 0x00000072
		pgs[8] = 0x00000050
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wdb"
	elseif pg == "蟠龙_桃夭夭_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000078
		pgs[4] = 0x00000025
		pgs[6] = 0x00000046
		pgs[7] = 0x00000068
		pgs[8] = 0x00000046
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wdb"
	elseif pg == "云鹤_桃夭夭_普通" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000084
		pgs[4] = 0x00000031
		pgs[6] = 0x00000021
		pgs[7] = 0x00000073
		pgs[8] = 0x00000052
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wdb"
	elseif pg == "风荷_桃夭夭_普通" then
		pgs[1] = 0x00000032
		pgs[2] = 0x00000032
		pgs[3] = 0x00000074
		pgs[4] = 0x00000022
		pgs[6] = 0x00000011
		pgs[7] = 0x00000064
		pgs[8] = 0x00000042
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wdb"
	elseif pg == "金风玉露_桃夭夭_普通" then
		pgs[1] = 0x00000033
		pgs[2] = 0x00000033
		pgs[3] = 0x00000077
		pgs[4] = 0x00000029
		pgs[6] = 0x00000054
		pgs[7] = 0x00000067
		pgs[8] = 0x00000014
		pgs[9] = 0x00000107
		pgs[10] = "common/shape.wdb"
	elseif pg == "凰火燎原_桃夭夭_普通" then
		pgs[1] = 0x00000034
		pgs[2] = 0x00000034
		pgs[3] = 0x00000076
		pgs[4] = 0x00000024
		pgs[6] = 0x00000055
		pgs[7] = 0x00000066
		pgs[8] = 0x00000013
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wdb"
	elseif pg == "月露清愁_桃夭夭_普通" then
		pgs[1] = 0x00000106
		pgs[2] = 0x00000106
		pgs[3] = 0x00000083
		pgs[4] = 0x00000030
		pgs[6] = 0x00000020
		pgs[7] = 0x00000040
		pgs[8] = 0x00000051
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wdb"
	elseif pg == "夭桃秾李_桃夭夭_普通" then
		pgs[1] = 0x00000038
		pgs[2] = 0x00000038
		pgs[3] = 0x00000081
		pgs[4] = 0x00000028
		pgs[6] = 0x00000018
		pgs[7] = 0x00000071
		pgs[8] = 0x00000049
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wdb"
	elseif pg == "荒尘_桃夭夭_普通" then
		pgs[1] = 0x00000108
		pgs[2] = 0x00000108
		pgs[3] = 0x00000075
		pgs[4] = 0x00000023
		pgs[6] = 0x00000012
		pgs[7] = 0x00000065
		pgs[8] = 0x00000043
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wdb"

	elseif pg == "鬼潇潇_爪刺" then
		pgs[1] = 0xC8FDA282--攻击
		pgs[2] = 0xC8FDA282--攻击
		pgs[3] = 0xC8FDA253--死亡
		pgs[4] = 0xC8FDA279--防御
		pgs[6] = 0xC8FDA339--战斗站立
		pgs[7] = 0x00C8FDA4--施法
		pgs[8] = 0xC8FDA202--战斗跑步
		pgs[9] = 0xC8FDA176--被打
		pgs[10] = "audio/1222.mp3"
		pgs[11] = 0x44C94422--战斗跑步
		pgs[12] = 0x3DAB59BD--被打
		pgs[15] = "audio/1115.mp3"
	elseif pg == "铁爪_鬼潇潇_普通" then
		pgs[1] = 0xD8C84714
		pgs[2] = 0xD8C84714
		pgs[3] = 0x8554BA42
		pgs[4] = 0x2BBB7044
		pgs[6] = 0xFA704666
		pgs[7] = 0x4DC318C9
		pgs[8] = 0xD104E67F
		pgs[9] = 0x4496CA86
		pgs[10] = "audio/1222.mp3"
	elseif pg == "青龙牙_鬼潇潇_普通" then
		pgs[1] = 0x8C811220
		pgs[2] = 0x8C811220
		pgs[3] = 0x2E7BEC5D
		pgs[4] = 0xC87D6432
		pgs[6] = 0xBBB66679
		pgs[7] = 0xC1D12715
		pgs[8] = 0x71E45393
		pgs[9] = 0x98F6A979
		pgs[10] = "audio/1222.mp3"
	elseif pg == "青刚刺_鬼潇潇_普通" then
		pgs[1] = 0x4AB65936
		pgs[2] = 0x4AB65936
		pgs[3] = 0xF1C3EB05
		pgs[4] = 0xEFD58471
		pgs[6] = 0x8CD79C98
		pgs[7] = 0xD3E18BFB
		pgs[8] = 0x0708B7C5
		pgs[9] = 0x9C6AED3B
		pgs[10] = "audio/1222.mp3"
	elseif pg == "撕天_鬼潇潇_普通" then
		pgs[1] = 0x450C888A
		pgs[2] = 0x450C888A
		pgs[3] = 0x60B8F5B2
		pgs[4] = 0x3FB86DEC
		pgs[6] = 0xA5EBBA28
		pgs[7] = 0x78ED127D
		pgs[8] = 0x9F8667CD
		pgs[9] = 0x36CE4ACA
		pgs[10] = "audio/1222.mp3"
	elseif pg == "毒牙_鬼潇潇_普通" then
		pgs[1] = 0x051B463A
		pgs[2] = 0x051B463A
		pgs[3] = 0x73792347
		pgs[4] = 0x8292637D
		pgs[6] = 0x470BA647
		pgs[7] = 0xC9AF27AA
		pgs[8] = 0xA1709867
		pgs[9] = 0xECF48FE4
		pgs[10] = "audio/1222.mp3"
	elseif pg == "胭脂_鬼潇潇_普通" then
		pgs[1] = 0x2E1083FE
		pgs[2] = 0x2E1083FE
		pgs[3] = 0x3017B6E1
		pgs[4] = 0xEF3E8D26
		pgs[6] = 0x5D578929
		pgs[7] = 0x1501BE96
		pgs[8] = 0x17DEE18F
		pgs[9] = 0x6D1C58D9
		pgs[10] = "audio/1222.mp3"
	elseif pg == "九阴勾魂_鬼潇潇_普通" then
		pgs[1] = 0x42399936
		pgs[2] = 0x42399936
		pgs[3] = 0xB8FC756F
		pgs[4] = 0x3B85FA19
		pgs[6] = 0x419D4670
		pgs[7] = 0x089EAA81
		pgs[8] = 0xB65DEFCC
		pgs[9] = 0xED25A4A3
		pgs[10] = "audio/1222.mp3"
	elseif pg == "雪蚕之刺_鬼潇潇_普通" then
		pgs[1] = 0xA93E1FD5
		pgs[2] = 0xA93E1FD5
		pgs[3] = 0xE12D30CF
		pgs[4] = 0x8F87C512
		pgs[6] = 0x5F3920E8
		pgs[7] = 0xDF5499B8
		pgs[8] = 0x51699CEE
		pgs[9] = 0x318949E3
		pgs[10] = "audio/1222.mp3"
	elseif pg == "贵霜之牙_鬼潇潇_普通" then
		pgs[1] = 0xD8270CA8
		pgs[2] = 0xD8270CA8
		pgs[3] = 0xE7D2F1D3
		pgs[4] = 0x9B7F1C84
		pgs[6] = 0x40A723EF
		pgs[7] = 0xF9361347
		pgs[8] = 0xBC2B048E
		pgs[9] = 0x29C67740
		pgs[10] = "audio/1222.mp3"
	elseif pg == "忘川三途_鬼潇潇_普通" then
		pgs[1] = 0xC688EF38
		pgs[2] = 0xC688EF38
		pgs[3] = 0xC4DA3341
		pgs[4] = 0x1E8CCE73
		pgs[6] = 0xBAC52DA2
		pgs[7] = 0x023D984C
		pgs[8] = 0x2EE39875
		pgs[9] = 0xA4749BE3
		pgs[10] = "audio/1222.mp3"
	elseif pg == "离钩_鬼潇潇_普通" then
		pgs[1] = 0xE15BC68D
		pgs[2] = 0xE15BC68D
		pgs[3] = 0xCD0DEC76
		pgs[4] = 0x01147D15
		pgs[6] = 0xB0ABEA3D
		pgs[7] = 0x60613BC6
		pgs[8] = 0x2E602DCB
		pgs[9] = 0xFF43B2D1
		pgs[10] = "audio/1222.mp3"

	elseif pg == "鬼潇潇_普通" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000101
		pgs[4] = 0x00000029
		pgs[6] = 0x00000107
		pgs[7] = 0x00000089
		pgs[8] = 0x00000077
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wdc"
	elseif pg == "鬼潇潇_伞" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000101
		pgs[4] = 0x00000029
		pgs[6] = 0x00000107
		pgs[7] = 0x00000089
		pgs[8] = 0x00000077
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wdc"
		pgs[11] = 0xB2FD1E56--战斗跑步
		pgs[12] = 0xF46E4BB3--被打
		pgs[15] = "audio/1115.mp3"
	elseif pg == "红罗伞_鬼潇潇_普通" then
		pgs[1] = 0x00000034
		pgs[2] = 0x00000034
		pgs[3] = 0x00000094
		pgs[4] = 0x00000022
		pgs[6] = 0x00000108
		pgs[7] = 0x00000082
		pgs[8] = 0x00000046
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wdc"
	elseif pg == "琳琅盖_鬼潇潇_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000096
		pgs[4] = 0x00000024
		pgs[6] = 0x00000109
		pgs[7] = 0x00000084
		pgs[8] = 0x00000048
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wdc"
	elseif pg == "碧火琉璃_鬼潇潇_普通" then
		pgs[1] = 0x00000031
		pgs[2] = 0x00000031
		pgs[3] = 0x00000091
		pgs[4] = 0x00000020
		pgs[6] = 0x00000013
		pgs[7] = 0x00000079
		pgs[8] = 0x00000046
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wdc"
	elseif pg == "浮生归梦_鬼潇潇_普通" then
		pgs[1] = 0x00000032
		pgs[2] = 0x00000032
		pgs[3] = 0x00000092
		pgs[4] = 0x00000104
		pgs[6] = 0x00000014
		pgs[7] = 0x00000080
		pgs[8] = 0x00000044
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wdc"
	elseif pg == "鬼骨_鬼潇潇_普通" then
		pgs[1] = 0x00000033
		pgs[2] = 0x00000033
		pgs[3] = 0x00000093
		pgs[4] = 0x00000021
		pgs[6] = 0x00000015
		pgs[7] = 0x00000081
		pgs[8] = 0x00000045
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wdc"
	elseif pg == "金刚伞_鬼潇潇_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000095
		pgs[4] = 0x00000023
		pgs[6] = 0x00000111
		pgs[7] = 0x00000083
		pgs[8] = 0x00000047
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wdc"
	elseif pg == "晴雪_鬼潇潇_普通" then
		pgs[1] = 0x00000037
		pgs[2] = 0x00000037
		pgs[3] = 0x00000097
		pgs[4] = 0x00000025
		pgs[6] = 0x00000016
		pgs[7] = 0x00000085
		pgs[8] = 0x00000070
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wdc"
	elseif pg == "雪羽穿云_鬼潇潇_普通" then
		pgs[1] = 0x00000038
		pgs[2] = 0x00000038
		pgs[3] = 0x00000098
		pgs[4] = 0x00000026
		pgs[6] = 0x00000017
		pgs[7] = 0x00000086
		pgs[8] = 0x00000075
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wdc"
	elseif pg == "月影星痕_鬼潇潇_普通" then
		pgs[1] = 0x00000039
		pgs[2] = 0x00000039
		pgs[3] = 0x00000099
		pgs[4] = 0x00000027
		pgs[6] = 0x00000018
		pgs[7] = 0x00000087
		pgs[8] = 0x00000076
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wdc"
	elseif pg == "云梦_鬼潇潇_普通" then
		pgs[1] = 0x00000040
		pgs[2] = 0x00000040
		pgs[3] = 0x00000100
		pgs[4] = 0x00000028
		pgs[6] = 0x00000114
		pgs[7] = 0x00000088
		pgs[8] = 0x00000052
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wdc"
	elseif pg == "枕霞_鬼潇潇_普通" then
		pgs[1] = 0x00000042
		pgs[2] = 0x00000042
		pgs[3] = 0x00000102
		pgs[4] = 0x00000030
		pgs[6] = 0x00000115
		pgs[7] = 0x00000090
		pgs[8] = 0x00000116
		pgs[9] = 0x00000012
		pgs[10] = "common/shape.wdc"


------------------------------------------------------神武宠物
elseif pg =="飞天_普通" or pg =="进阶飞天_普通"then
	   pgs[1] = 0x01000001
	   pgs[2] = 0x01000001
	   pgs[3] = 0x01000002
	   pgs[4] = 0x01000003
	   pgs[6] = 0x01000005
	   pgs[7] = 0x01000001
	   pgs[8] = 0x01000004
	   pgs[9] = 0x01000003
	   pgs[10] = "铃铛界面.wdf"
elseif pg =="进阶超级神狗_普通" or pg =="超级神狗_普通" then
	   pgs[1] = 0x03000006
	   pgs[2] = 0x03000006
	   pgs[3] = 0x03000007
	   pgs[4] = 0x03000008
	   pgs[6] = 0x03000009
	   pgs[7] = 0x03000006
	   pgs[8] = 0x03000010
	   pgs[9] = 0x03000008
	   pgs[10] = "铃铛界面.wdf"
elseif pg =="进阶超级神鼠_普通" or pg =="超级神鼠_普通" then
	   pgs[1] = 0x04000006
	   pgs[2] = 0x04000006
	   pgs[3] = 0x04000007
	   pgs[4] = 0x04000008
	   pgs[6] = 0x04000009
	   pgs[7] = 0x04000006
	   pgs[8] = 0x04000010
	   pgs[9] = 0x04000008
	   pgs[10] = "铃铛界面.wdf"
elseif pg =="超级神猪_普通" or pg =="进阶超级神猪_普通" then
	   pgs[1] = 0x05000001
	   pgs[2] = 0x05000001
	   pgs[3] = 0x05000007
	   pgs[4] = 0x05000008
	   pgs[6] = 0x05000009
	   pgs[7] = 0x05000001
	   pgs[8] = 0x05000010
	   pgs[9] = 0x05000008
	   pgs[10] = "铃铛界面.wdf"
elseif pg =="超级小白龙_普通" or pg =="进阶超级小白龙_普通" then
	   pgs[1] = 0x06000001
	   pgs[2] = 0x06000001
	   pgs[3] = 0x06000007
	   pgs[4] = 0x06000008
	   pgs[6] = 0x06000009
	   pgs[7] = 0x06000001
	   pgs[8] = 0x06000010
	   pgs[9] = 0x06000008
	   pgs[10] = "铃铛界面.wdf"
elseif pg =="超级猪小戒_普通" or pg =="进阶超级猪小戒_普通" then
	   pgs[1] = 0x07000006
	   pgs[2] = 0x07000006
	   pgs[3] = 0x07000007
	   pgs[4] = 0x07000008
	   pgs[6] = 0x07000009
	   pgs[7] = 0x07000006
	   pgs[8] = 0x07000010
	   pgs[9] = 0x07000008
	   pgs[10] = "铃铛界面.wdf"

  elseif pg == "谛听_普通" then
		pgs[1] = 0x08000001--攻击
		pgs[2] = 0x08000001--攻击
		pgs[3] = 0x08000002--死亡
		pgs[4] = 0x08000003--防御
		pgs[6] = 0x08000004--战斗
		pgs[7] = 0x08000001--施法
		pgs[8] = 0x08000005--跑
		pgs[9] = 0x08000003--受伤
        pgs[10] = "nb.wdf"
        elseif pg == "进阶谛听_普通" then
		pgs[1] = 0x08000011--攻击
		pgs[2] = 0x08000011--攻击
		pgs[3] = 0x08000012--死亡
		pgs[4] = 0x08000013--防御
		pgs[6] = 0x08000019--战斗
		pgs[7] = 0x08000016--施法
		pgs[8] = 0x08000015--跑
		pgs[9] = 0x08000013--受伤
        pgs[10] = "nb.wdf"
       elseif pg == "进阶谛听_饰品_普通 " then
		pgs[1] = 0x08000011--攻击
		pgs[2] = 0x08000011--攻击
		pgs[3] = 0x08000017--死亡
		pgs[4] = 0x08000018--防御
		pgs[6] = 0x08000019--战斗
		pgs[7] = 0x08000016--施法
		pgs[8] = 0x08000020--跑
		pgs[9] = 0x08000018--受伤
        pgs[10] = "nb.wdf"
        elseif pg == "独角兽_普通" then
		pgs[1] = 0x08000001--攻击
		pgs[2] = 0x08000001--攻击
		pgs[3] = 0x08000002--死亡
		pgs[4] = 0x08000003--防御
		pgs[6] = 0x08000004--战斗
		pgs[7] = 0x08000001--施法
		pgs[8] = 0x08000005--跑
		pgs[9] = 0x08000003--受伤
        pgs[10] = "nb.wdf"
        elseif pg == "进阶独角兽_普通" then
		pgs[1] = 0x08000011--攻击
		pgs[2] = 0x08000011--攻击
		pgs[3] = 0x08000012--死亡
		pgs[4] = 0x08000013--防御
		pgs[6] = 0x08000019--战斗
		pgs[7] = 0x08000016--施法
		pgs[8] = 0x08000015--跑
		pgs[9] = 0x08000013--受伤
        pgs[10] = "nb.wdf"
       elseif pg == "进阶独角兽_饰品_普通 " then
		pgs[1] = 0x08000011--攻击
		pgs[2] = 0x08000011--攻击
		pgs[3] = 0x08000017--死亡
		pgs[4] = 0x08000018--防御
		pgs[6] = 0x08000019--战斗
		pgs[7] = 0x08000016--施法
		pgs[8] = 0x08000020--跑
		pgs[9] = 0x08000018--受伤
        pgs[10] = "nb.wdf"
       elseif pg == "画江湖_普通" then
		pgs[1] = 0x09000001--攻击
		pgs[2] = 0x09000001--攻击
		pgs[3] = 0x09000002--死亡
		pgs[4] = 0x09000003--防御
		pgs[6] = 0x09000004--战斗
		pgs[7] = 0x09000001--施法
		pgs[8] = 0x09000009--跑
		pgs[9] = 0x09000008--受伤
        pgs[10] = "nb.wdf"
        elseif pg == "进阶画江湖_普通" then
		pgs[1] = 0x09000016--攻击
		pgs[2] = 0x09000016--攻击
		pgs[3] = 0x09000012--死亡
		pgs[4] = 0x09000013--防御
		pgs[6] = 0x09000014--战斗
		pgs[7] = 0x09000016--施法
		pgs[8] = 0x09000015--跑
		pgs[9] = 0x09000013--受伤
        pgs[10] = "nb.wdf"
         elseif pg == "进阶画江湖_饰品_普通" then
		pgs[1] = 0x09000016--攻击
		pgs[2] = 0x09000016--攻击
		pgs[3] = 0x09000017--死亡
		pgs[4] = 0x09000018--防御
		pgs[6] = 0x09000019--战斗
		pgs[7] = 0x09000016--施法
		pgs[8] = 0x09000020--跑
		pgs[9] = 0x09000018--受伤
        pgs[10] = "nb.wdf"
    elseif pg == "超级阿狸_普通" then
		pgs[1] = 0x10000001--攻击
		pgs[2] = 0x10000001--攻击
		pgs[3] = 0x10000002--死亡
		pgs[4] = 0x10000003--防御
		pgs[6] = 0x10000004--战斗
		pgs[7] = 0x10000001--施法
		pgs[8] = 0x10000005--跑
		pgs[9] = 0x10000003--受伤
		pgs[10] = "nb.wdf"
elseif pg == "进阶超级阿狸_普通" then
		pgs[1] = 0x10000006--攻击
		pgs[2] = 0x10000006--攻击
		pgs[3] = 0x10000007--死亡
		pgs[4] = 0x10000008--防御
		pgs[6] = 0x10000009--战斗
		pgs[7] = 0x10000001--施法
		pgs[8] = 0x10000010--跑
		pgs[9] = 0x10000008--受伤
		pgs[10] = "nb.wdf"
	elseif pg == "进阶超级阿狸_饰品_普通" then
		pgs[1] = 0x10000006--攻击
		pgs[2] = 0x10000006--攻击
		pgs[3] = 0x10000007--死亡
		pgs[4] = 0x10000008--防御
		pgs[6] = 0x10000009--战斗
		pgs[7] = 0x10000001--施法
		pgs[8] = 0x10000010--跑
		pgs[9] = 0x10000008--受伤
		pgs[10] = "nb.wdf"
 elseif pg == "超级尾巴_普通" then
		pgs[1] = 0x10000011--攻击
		pgs[2] = 0x10000011--攻击
		pgs[3] = 0x10000012--死亡
		pgs[4] = 0x10000013--防御
		pgs[6] = 0x10000014--战斗
		pgs[7] = 0x10000011--施法
		pgs[8] = 0x10000015--跑
		pgs[9] = 0x10000013--受伤
		pgs[10] = "nb.wdf"
elseif pg == "进阶超级尾巴_普通" then
		pgs[1] = 0x10000016--攻击
		pgs[2] = 0x10000016--攻击
		pgs[3] = 0x10000017--死亡
		pgs[4] = 0x10000018--防御
		pgs[6] = 0x10000019--战斗
		pgs[7] = 0x10000016--施法
		pgs[8] = 0x10000020--跑
		pgs[9] = 0x10000018--受伤
		pgs[10] = "nb.wdf"
	elseif pg == "进阶超级尾巴_饰品_普通" then
		pgs[1] = 0x10000016--攻击
		pgs[2] = 0x10000016--攻击
		pgs[3] = 0x10000017--死亡
		pgs[4] = 0x10000018--防御
		pgs[6] = 0x10000019--战斗
		pgs[7] = 0x10000016--施法
		pgs[8] = 0x10000020--跑
		pgs[9] = 0x10000018--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "雪仙_普通" then
		pgs[1] = 0x20000001--攻击
		pgs[2] = 0x20000001--攻击
		pgs[3] = 0x20000002--死亡
		pgs[4] = 0x20000003--防御
		pgs[6] = 0x20000004--战斗
		pgs[7] = 0x20000001--施法
		pgs[8] = 0x20000005--跑
		pgs[9] = 0x20000003--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶雪仙_普通" then
		pgs[1] = 0x20000006--攻击
		pgs[2] = 0x20000006--攻击
		pgs[3] = 0x20000007--死亡
		pgs[4] = 0x20000008--防御
		pgs[6] = 0x20000009--战斗
		pgs[7] = 0x20000006--施法
		pgs[8] = 0x20000010--跑
		pgs[9] = 0x20000008--受伤
		pgs[10] = "nb.wdf"
elseif pg == "进阶雪仙_饰品_普通" then
		pgs[1] = 0x20000006--攻击
		pgs[2] = 0x20000006--攻击
		pgs[3] = 0x20000007--死亡
		pgs[4] = 0x20000008--防御
		pgs[6] = 0x20000009--战斗
		pgs[7] = 0x20000006--施法
		pgs[8] = 0x20000010--跑
		pgs[9] = 0x20000008--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "花仙_普通" then
		pgs[1] = 0x20000011--攻击
		pgs[2] = 0x20000011--攻击
		pgs[3] = 0x20000012--死亡
		pgs[4] = 0x20000013--防御
		pgs[6] = 0x20000014--战斗
		pgs[7] = 0x20000011--施法
		pgs[8] = 0x20000015--跑
		pgs[9] = 0x20000013--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶花仙_普通" then
		pgs[1] = 0x20000016--攻击
		pgs[2] = 0x20000016--攻击
		pgs[3] = 0x20000017--死亡
		pgs[4] = 0x20000018--防御
		pgs[6] = 0x20000019--战斗
		pgs[7] = 0x20000016--施法
		pgs[8] = 0x20000020--跑
		pgs[9] = 0x20000018--受伤
		pgs[10] = "nb.wdf"
		elseif pg == "进阶花仙_饰品_普通" then
		pgs[1] = 0x20000016--攻击
		pgs[2] = 0x20000016--攻击
		pgs[3] = 0x20000017--死亡
		pgs[4] = 0x20000018--防御
		pgs[6] = 0x20000019--战斗
		pgs[7] = 0x20000016--施法
		pgs[8] = 0x20000020--跑
		pgs[9] = 0x20000018--受伤
		pgs[10] = "nb.wdf"
  elseif pg == "月影_普通" then
		pgs[1] = 0x30000001--攻击
		pgs[2] = 0x30000001--攻击
		pgs[3] = 0x30000002--死亡
		pgs[4] = 0x30000003--防御
		pgs[6] = 0x30000004--战斗
		pgs[7] = 0x30000001--施法
		pgs[8] = 0x30000005--跑
		pgs[9] = 0x30000003--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶月影_普通" then
		pgs[1] = 0x30000006--攻击
		pgs[2] = 0x30000006--攻击
		pgs[3] = 0x30000007--死亡
		pgs[4] = 0x30000008--防御
		pgs[6] = 0x30000010--战斗
		pgs[7] = 0x30000009--施法
		pgs[8] = 0x30000010--跑
		pgs[9] = 0x30000008--受伤
		pgs[10] = "nb.wdf"
 elseif pg == "进阶月影_饰品_普通" then
		pgs[1] = 0x30000006--攻击
		pgs[2] = 0x30000006--攻击
		pgs[3] = 0x30000007--死亡
		pgs[4] = 0x30000008--防御
		pgs[6] = 0x30000010--战斗
		pgs[7] = 0x30000009--施法
		pgs[8] = 0x30000010--跑
		pgs[9] = 0x30000008--受伤
		pgs[10] = "nb.wdf"
	elseif pg == "裁决者_普通" then
		pgs[1] = 0x30000012--攻击
		pgs[2] = 0x30000012--攻击
		pgs[3] = 0x30000013--死亡
		pgs[4] = 0x30000014--防御
		pgs[6] = 0x30000015--战斗
		pgs[7] = 0x30000012--施法
		pgs[8] = 0x30000016--跑
		pgs[9] = 0x30000014--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶裁决者_普通" then
		pgs[1] = 0x30000017--攻击
		pgs[2] = 0x30000017--攻击
		pgs[3] = 0x30000018--死亡
		pgs[4] = 0x30000019--防御
		pgs[6] = 0x30000020--战斗
		pgs[7] = 0x30000021--施法
		pgs[8] = 0x30000020--跑
		pgs[9] = 0x30000019--受伤
		pgs[10] = "nb.wdf"
 elseif pg == "进阶裁决者_饰品_普通" then
		pgs[1] = 0x30000017--攻击
		pgs[2] = 0x30000017--攻击
		pgs[3] = 0x30000018--死亡
		pgs[4] = 0x30000019--防御
		pgs[6] = 0x30000020--战斗
		pgs[7] = 0x30000021--施法
		pgs[8] = 0x30000020--跑
		pgs[9] = 0x30000019--受伤
		pgs[10] = "nb.wdf"
elseif pg == "小精灵_普通" then
		pgs[1] = 0x40000001--攻击
		pgs[2] = 0x40000001--攻击
		pgs[3] = 0x40000002--死亡
		pgs[4] = 0x40000003--防御
		pgs[6] = 0x40000004--战斗
		pgs[7] = 0x40000001--施法
		pgs[8] = 0x40000005--跑
		pgs[9] = 0x40000003--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶小精灵_普通" then
		pgs[1] = 0x40000006--攻击
		pgs[2] = 0x40000006--攻击
		pgs[3] = 0x40000007--死亡
		pgs[4] = 0x40000008--防御
		pgs[6] = 0x40000009--战斗
		pgs[7] = 0x40000006--施法
		pgs[8] = 0x40000010--跑
		pgs[9] = 0x40000008--受伤
		pgs[10] = "nb.wdf"
	elseif pg == "进阶小精灵_饰品_普通" then
		pgs[1] = 0x40000006--攻击
		pgs[2] = 0x40000006--攻击
		pgs[3] = 0x40000007--死亡
		pgs[4] = 0x40000008--防御
		pgs[6] = 0x40000009--战斗
		pgs[7] = 0x40000006--施法
		pgs[8] = 0x40000010--跑
		pgs[9] = 0x40000008--受伤
		pgs[10] = "nb.wdf"
   elseif pg == "葬送者_普通" then
		pgs[1] = 0x50000001--攻击
		pgs[2] = 0x50000001--攻击
		pgs[3] = 0x50000002--死亡
		pgs[4] = 0x50000003--防御
		pgs[6] = 0x50000004--战斗
		pgs[7] = 0x50000001--施法
		pgs[8] = 0x50000005--跑
		pgs[9] = 0x50000003--受伤
		pgs[10] = "nb.wdf"
    elseif pg == "进阶葬送者_普通" then
		pgs[1] = 0x50000006--攻击
		pgs[2] = 0x50000006--攻击
		pgs[3] = 0x50000007--死亡
		pgs[4] = 0x50000008--防御
		pgs[6] = 0x50000009--战斗
		pgs[7] = 0x50000006--施法
		pgs[8] = 0x50000010--跑
		pgs[9] = 0x50000008--受伤
		pgs[10] = "nb.wdf"
	elseif pg == "进阶葬送者_饰品_普通" then
		pgs[1] = 0x50000006--攻击
		pgs[2] = 0x50000006--攻击
		pgs[3] = 0x50000007--死亡
		pgs[4] = 0x50000008--防御
		pgs[6] = 0x50000009--战斗
		pgs[7] = 0x50000006--施法
		pgs[8] = 0x50000010--跑
		pgs[9] = 0x50000008--受伤
		pgs[10] = "nb.wdf"
	 elseif pg == "超级小猴子_普通" then
		pgs[1] = 0x9FD2C549--攻击
		pgs[2] = 0x9FD2C549--攻击
		pgs[3] = 0x9FD2C50D--死亡
		pgs[4] = 0x9FD2C530--防御
		pgs[6] = 0x9FD2C50D--战斗
		pgs[7] = 0x9FD2C549--施法
		pgs[8] = 0x9FD2C594--跑
		pgs[9] = 0x9FD2C5A9--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级小猴子_饰品_普通" then
		pgs[1] = 0x9FD2C549--攻击
		pgs[2] = 0x9FD2C549--攻击
		pgs[3] = 0x9FD2C50D--死亡
		pgs[4] = 0x9FD2C530--防御
		pgs[6] = 0x9FD2C50D--战斗
		pgs[7] = 0x9FD2C549--施法
		pgs[8] = 0x9FD2C594--跑
		pgs[9] = 0x9FD2C5A9--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级小猴子_普通" then
		pgs[1] = 0x9FD2C549--攻击
		pgs[2] = 0x9FD2C549--攻击
		pgs[3] = 0x9FD2C50D--死亡
		pgs[4] = 0x9FD2C530--防御
		pgs[6] = 0x9FD2C50D--战斗
		pgs[7] = 0x9FD2C549--施法
		pgs[8] = 0x9FD2C594--跑
		pgs[9] = 0x9FD2C5A9--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级小萝莉_饰品_普通" then
		pgs[1] = 0xFE7335A7--普通攻击
		pgs[2] = 0xFE73A149--施法攻击
		pgs[3] = 0xFE73A10D--死亡
		pgs[4] = 0xFE73A130--防御
		pgs[6] = 0xFE73A10D--战斗
		pgs[7] = 0xFE73A149--施法
		pgs[8] = 0xFE73A12C--跑
		pgs[9] = 0xFE737C5B--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级小萝莉_普通" then
		pgs[1] = 0xFE7335A7--普通攻击
		pgs[2] = 0xFE73A149--施法攻击
		pgs[3] = 0xFE73A10D--死亡
		pgs[4] = 0xFE73A130--防御
		pgs[6] = 0xFE73A10D--战斗
		pgs[7] = 0xFE73A149--施法
		pgs[8] = 0xFE73A12C--跑
		pgs[9] = 0xFE737C5B--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "超级小萝莉_普通" then
		pgs[1] = 0xFE7335A7--普通攻击
		pgs[2] = 0xFE73A149--施法攻击
		pgs[3] = 0xFE73A10D--死亡
		pgs[4] = 0xFE73A130--防御
		pgs[6] = 0xFE73A10D--战斗
		pgs[7] = 0xFE73A149--施法
		pgs[8] = 0xFE73A12C--跑
		pgs[9] = 0xFE737C5B--受伤
		pgs[10] = "xue.wdf"
		elseif pg == "超级武罗_普通" then
		pgs[1] = 0xC4FE35A7--
		pgs[2] = 0xC4FE35A7--
		pgs[3] = 0xC4FE70C6--
		pgs[4] = 0xC4FE7C5B--
		pgs[6] = 0xC4FE0D17--
		pgs[7] = 0xC4FE35A7--
		pgs[8] = 0xC4FE2CDD--
		pgs[9] = 0xC4FE7C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级武罗_普通" then
		pgs[1] = 0xC4FE35A7--
		pgs[2] = 0xC4FE35A7--
		pgs[3] = 0xC4FE70C6--
		pgs[4] = 0xC4FE7C5B--
		pgs[6] = 0xC4FE0D17--
		pgs[7] = 0xC4FE35A7--
		pgs[8] = 0xC4FE2CDD--
		pgs[9] = 0xC4FE7C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级武罗_饰品_普通" then
		pgs[1] = 0xC4FE35A7--
		pgs[2] = 0xC4FE35A7--
		pgs[3] = 0xC4FE70C6--
		pgs[4] = 0xC4FE7C5B--
		pgs[6] = 0xC4FE0D17--
		pgs[7] = 0xC4FE35A7--
		pgs[8] = 0xC4FE2CDD--
		pgs[9] = 0xC4FE7C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "超级帝释天_普通" then
		pgs[1] = 0xA1764335--
		pgs[2] = 0xA176432C--
		pgs[3] = 0xA176430E--
		pgs[4] = 0xA1764330--
		pgs[6] = 0xA176437C--
		pgs[7] = 0xA1764349--
		pgs[8] = 0xA176432C--
		pgs[9] = 0xA1764330--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级帝释天_普通" then
		pgs[1] = 0xA1764335--
		pgs[2] = 0xA176432C--
		pgs[3] = 0xA176430E--
		pgs[4] = 0xA1764330--
		pgs[6] = 0xA176437C--
		pgs[7] = 0xA1764349--
		pgs[8] = 0xA176432C--
		pgs[9] = 0xA1764330--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级帝释天_饰品_普通" then
		pgs[1] = 0xA1764335--
		pgs[2] = 0xA176432C--
		pgs[3] = 0xA176430E--
		pgs[4] = 0xA1764330--
		pgs[6] = 0xA176437C--
		pgs[7] = 0xA1764349--
		pgs[8] = 0xA176432C--
		pgs[9] = 0xA1764330--
		pgs[10] = "xue.wdf"
		elseif pg == "超级贪狼_普通" then
		pgs[1] = 0x70C735A7--
		pgs[2] = 0x70C74918--
		pgs[3] = 0x70C770C6--
		pgs[4] = 0x70C77C5B--
		pgs[6] = 0x70C70D17--
		pgs[7] = 0x70C74918--
		pgs[8] = 0x70C72CDD--
		pgs[9] = 0x70C77C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级贪狼_普通" then
		pgs[1] = 0x70C735A7--
		pgs[2] = 0x70C74918--
		pgs[3] = 0x70C770C6--
		pgs[4] = 0x70C77C5B--
		pgs[6] = 0x70C70D17--
		pgs[7] = 0x70C74918--
		pgs[8] = 0x70C72CDD--
		pgs[9] = 0x70C77C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级贪狼_饰品_普通" then
		pgs[1] = 0x70C735A7--
		pgs[2] = 0x70C74918--
		pgs[3] = 0x70C770C6--
		pgs[4] = 0x70C77C5B--
		pgs[6] = 0x70C70D17--
		pgs[7] = 0x70C74918--
		pgs[8] = 0x70C72CDD--
		pgs[9] = 0x70C77C5B--
		pgs[10] = "xue.wdf"
		elseif pg == "超级翼龙_普通" then
		pgs[1] = 0x0AE90B70--
		pgs[2] = 0x0A1A4780--
		pgs[3] = 0x0A3BCD60--
		pgs[4] = 0x0AF7D390--
		pgs[6] = 0x0A0D1710--
		pgs[7] = 0x0A1A4780--
		pgs[8] = 0x0A2CDD20--
		pgs[9] = 0x0A2A89B0--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级翼龙_普通" then
		pgs[1] = 0x0AE90B70--
		pgs[2] = 0x0A1A4780--
		pgs[3] = 0x0A3BCD60--
		pgs[4] = 0x0AF7D390--
		pgs[6] = 0x0A0D1710--
		pgs[7] = 0x0A1A4780--
		pgs[8] = 0x0A2CDD20--
		pgs[9] = 0x0A2A89B0--
		pgs[10] = "xue.wdf"
		elseif pg == "进阶超级翼龙_饰品_普通" then
		pgs[1] = 0x0AE90B70--
		pgs[2] = 0x0A1A4780--
		pgs[3] = 0x0A3BCD60--
		pgs[4] = 0x0AF7D390--
		pgs[6] = 0x0A0D1710--
		pgs[7] = 0x0A1A4780--
		pgs[8] = 0x0A2CDD20--
		pgs[9] = 0x0A2A89B0--
		pgs[10] = "xue.wdf"
		elseif pg == "赵云_普通" then
		pgs[1] = 0x00000003--普通攻击
		pgs[2] = 0x00000003--施法攻击
		pgs[3] = 0x00000004--死亡
		pgs[4] = 0x00000327--防御
		pgs[6] = 0x00000006--静立
		pgs[7] = 0x00000003--施法
		pgs[8] = 0x00000001--跑
		pgs[9] = 0x00000327--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "紫霞仙子_普通" then
		pgs[1] = 0x00000011--普通攻击
		pgs[2] = 0x00000011--施法攻击
		pgs[3] = 0x00000012--死亡
		pgs[4] = 0x00000008--防御
		pgs[6] = 0x00000014--静立
		pgs[7] = 0x00000011--施法
		pgs[8] = 0x00000009--跑
		pgs[9] = 0x00000008--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "阿朱_普通" then
		pgs[1] = 0x00000019--普通攻击
		pgs[2] = 0x00000019--施法攻击
		pgs[3] = 0x00000020--死亡
		pgs[4] = 0x00000017--防御
		pgs[6] = 0x00000022--静立
		pgs[7] = 0x00000019--施法
		pgs[8] = 0x00000018--跑
		pgs[9] = 0x00000017--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "白子画_普通" then
		pgs[1] = 0x00000026--普通攻击
		pgs[2] = 0x00000026--施法攻击
		pgs[3] = 0x00000027--死亡
		pgs[4] = 0x00000023--防御
		pgs[6] = 0x00000029--静立
		pgs[7] = 0x00000026--施法
		pgs[8] = 0x00000024--跑
		pgs[9] = 0x00000023--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "碧瑶_普通" then
		pgs[1] = 0x00000035--普通攻击
		pgs[2] = 0x00000037--施法攻击
		pgs[3] = 0x00000038--死亡
		pgs[4] = 0x00000034--防御
		pgs[6] = 0x00000040--静立
		pgs[7] = 0x00000037--施法
		pgs[8] = 0x00000036--跑
		pgs[9] = 0x00000034--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "貂蝉_普通" then
		pgs[1] = 0x00000072--普通攻击
		pgs[2] = 0x00000072--施法攻击
		pgs[3] = 0x00000073--死亡
		pgs[4] = 0x00000069--防御
		pgs[6] = 0x00000075--静立
		pgs[7] = 0x00000072--施法
		pgs[8] = 0x00000070--跑
		pgs[9] = 0x00000069--受伤
		pgs[10] = "素材修复.wdf"
		elseif pg == "凤九_普通" then
		pgs[4] = 0x00000079--防御
		pgs[9] = 0x00000079--受伤
		pgs[8] = 0x00000080--跑
		pgs[1] = 0x00000082--普通攻击
		pgs[2] = 0x00000082--施法攻击
		pgs[7] = 0x00000082--施法
		pgs[3] = 0x00000083--死亡
		pgs[6] = 0x00000085--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "关羽_普通" then
		pgs[4] = 0x00000089--防御
		pgs[9] = 0x00000089--受伤
		pgs[8] = 0x00000091--跑
		pgs[1] = 0x00000093--普通攻击
		pgs[2] = 0x00000093--施法攻击
		pgs[7] = 0x00000093--施法
		pgs[3] = 0x00000094--死亡
		pgs[6] = 0x00000096--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "鬼厉_普通" then
		pgs[4] = 0x00000098--防御
		pgs[9] = 0x00000098--受伤
		pgs[8] = 0x00000099--跑
		pgs[1] = 0x00000100--普通攻击
		pgs[2] = 0x00000100--施法攻击
		pgs[7] = 0x00000100--施法
		pgs[3] = 0x00000101--死亡
		pgs[6] = 0x00000103--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "花无缺_普通" then
		pgs[4] = 0x00000108--防御
		pgs[9] = 0x00000108--受伤
		pgs[8] = 0x00000109--跑
		pgs[1] = 0x00000111--普通攻击
		pgs[2] = 0x00000111--施法攻击
		pgs[7] = 0x00000111--施法
		pgs[3] = 0x00000112--死亡
		pgs[6] = 0x00000114--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "剑圣_普通" then
		pgs[4] = 0x00000120--防御
		pgs[9] = 0x00000120--受伤
		pgs[8] = 0x00000121--跑
		pgs[1] = 0x00000123--普通攻击
		pgs[2] = 0x00000123--施法攻击
		pgs[7] = 0x00000123--施法
		pgs[3] = 0x00000124--死亡
		pgs[6] = 0x00000126--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "巨灵神_普通" then
		pgs[4] = 0x00000128--防御
		pgs[9] = 0x00000128--受伤
		pgs[8] = 0x00000129--跑
		pgs[1] = 0x00000131--普通攻击
		pgs[2] = 0x00000131--施法攻击
		pgs[7] = 0x00000131--施法
		pgs[3] = 0x00000132--死亡
		pgs[6] = 0x00000134--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "李蓉蓉_普通" then
		pgs[4] = 0x00000140--防御
		pgs[9] = 0x00000140--受伤
		pgs[8] = 0x00000141--跑
		pgs[1] = 0x00000142--普通攻击
		pgs[2] = 0x00000142--施法攻击
		pgs[7] = 0x00000142--施法
		pgs[3] = 0x00000143--死亡
		pgs[6] = 0x00000144--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "李逍遥_普通" then
		pgs[4] = 0x00000144--防御
		pgs[9] = 0x00000144--受伤
		pgs[8] = 0x00000146--跑
		pgs[1] = 0x00000148--普通攻击
		pgs[2] = 0x00000148--施法攻击
		pgs[7] = 0x00000148--施法
		pgs[3] = 0x00000149--死亡
		pgs[6] = 0x00000151--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "怜星_普通" then
		pgs[4] = 0x00000153--防御
		pgs[9] = 0x00000153--受伤
		pgs[8] = 0x00000154--跑
		pgs[1] = 0x00000156--普通攻击
		pgs[2] = 0x00000156--施法攻击
		pgs[7] = 0x00000156--施法
		pgs[3] = 0x00000157--死亡
		pgs[6] = 0x00000159--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "凌凌漆_普通" then
		pgs[4] = 0x00000161--防御
		pgs[9] = 0x00000161--受伤
		pgs[8] = 0x00000162--跑
		pgs[1] = 0x00000164--普通攻击
		pgs[2] = 0x00000164--施法攻击
		pgs[7] = 0x00000164--施法
		pgs[3] = 0x00000165--死亡
		pgs[6] = 0x00000167--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "龙儿_普通" then
		pgs[4] = 0x00000172--防御
		pgs[9] = 0x00000172--受伤
		pgs[8] = 0x00000173--跑
		pgs[1] = 0x00000174--普通攻击
		pgs[2] = 0x00000174--施法攻击
		pgs[7] = 0x00000174--施法
		pgs[3] = 0x00000175--死亡
		pgs[6] = 0x00000177--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "陆雪琪_普通" then
		pgs[4] = 0x00000181--防御
		pgs[9] = 0x00000181--受伤
		pgs[8] = 0x00000182--跑
		pgs[1] = 0x00000183--普通攻击
		pgs[2] = 0x00000183--施法攻击
		pgs[7] = 0x00000183--施法
		pgs[3] = 0x00000184--死亡
		pgs[6] = 0x00000186--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "洛神_普通" then
		pgs[4] = 0x00000187--防御
		pgs[9] = 0x00000187--受伤
		pgs[8] = 0x00000188--跑
		pgs[1] = 0x00000190--普通攻击
		pgs[2] = 0x00000191--施法攻击
		pgs[7] = 0x00000191--施法
		pgs[3] = 0x00000192--死亡
		pgs[6] = 0x00000194--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "吕布_普通" then
		pgs[4] = 0x00000196--防御
		pgs[9] = 0x00000196--受伤
		pgs[8] = 0x00000197--跑
		pgs[1] = 0x00000199--普通攻击
		pgs[2] = 0x00000199--施法攻击
		pgs[7] = 0x00000199--施法
		pgs[3] = 0x00000200--死亡
		pgs[6] = 0x00000202--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "普智_普通" then
		pgs[4] = 0x00000209--防御
		pgs[9] = 0x00000209--受伤
		pgs[8] = 0x00000210--跑
		pgs[1] = 0x00000211--普通攻击
		pgs[2] = 0x00000211--施法攻击
		pgs[7] = 0x00000211--施法
		pgs[3] = 0x00000212--死亡
		pgs[6] = 0x00000214--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "青霞仙子_普通" then
		pgs[4] = 0x00000217--防御
		pgs[9] = 0x00000217--受伤
		pgs[8] = 0x00000218--跑
		pgs[1] = 0x00000220--普通攻击
		pgs[2] = 0x00000220--施法攻击
		pgs[7] = 0x00000220--施法
		pgs[3] = 0x00000221--死亡
		pgs[6] = 0x00000223--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "人皇_普通" then
		pgs[4] = 0x00000225--防御
		pgs[9] = 0x00000225--受伤
		pgs[8] = 0x00000226--跑
		pgs[1] = 0x00000228--普通攻击
		pgs[2] = 0x00000229--施法攻击
		pgs[7] = 0x00000229--施法
		pgs[3] = 0x00000230--死亡
		pgs[6] = 0x00000232--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "杀阡陌_普通" then--啊
		pgs[4] = 0x00000234--防御
		pgs[9] = 0x00000234--受伤
		pgs[8] = 0x00000235--跑
		pgs[1] = 0x00000237--普通攻击
		pgs[2] = 0x00000237--施法攻击
		pgs[7] = 0x00000237--施法
		pgs[3] = 0x00000238--死亡
		pgs[6] = 0x00000240--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "通臂猿猴_普通" then
		pgs[4] = 0x00000251--防御
		pgs[9] = 0x00000251--受伤
		pgs[8] = 0x00000252--跑
		pgs[1] = 0x00000253--普通攻击
		pgs[2] = 0x00000253--施法攻击
		pgs[7] = 0x00000253--施法
		pgs[3] = 0x00000254--死亡
		pgs[6] = 0x00000256--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "万人往_普通" then
		pgs[4] = 0x00000257--防御
		pgs[9] = 0x00000257--受伤
		pgs[8] = 0x00000258--跑
		pgs[1] = 0x00000260--普通攻击
		pgs[2] = 0x00000261--施法攻击
		pgs[7] = 0x00000261--施法
		pgs[3] = 0x00000262--死亡
		pgs[6] = 0x00000264--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "尉迟恭_普通" then
		pgs[4] = 0x00000266--防御
		pgs[9] = 0x00000266--受伤
		pgs[8] = 0x00000267--跑
		pgs[1] = 0x00000269--普通攻击
		pgs[2] = 0x00000269--施法攻击
		pgs[7] = 0x00000269--施法
		pgs[3] = 0x00000270--死亡
		pgs[6] = 0x00000272--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "小昭_普通" then
		pgs[4] = 0x00000278--防御
		pgs[9] = 0x00000278--受伤
		pgs[8] = 0x00000279--跑
		pgs[1] = 0x00000281--普通攻击
		pgs[2] = 0x00000281--施法攻击
		pgs[7] = 0x00000281--施法
		pgs[3] = 0x00000282--死亡
		pgs[6] = 0x00000284--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "雄霸_普通" then
		pgs[4] = 0x00000286--防御
		pgs[9] = 0x00000286--受伤
		pgs[8] = 0x00000287--跑
		pgs[1] = 0x00000289--普通攻击
		pgs[2] = 0x00000289--施法攻击
		pgs[7] = 0x00000289--施法
		pgs[3] = 0x00000290--死亡
		pgs[6] = 0x00000292--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "邀月_普通" then
		pgs[4] = 0x00000296--防御
		pgs[9] = 0x00000296--受伤
		pgs[8] = 0x00000297--跑
		pgs[1] = 0x00000299--普通攻击
		pgs[2] = 0x00000300--施法攻击
		pgs[7] = 0x00000300--施法
		pgs[3] = 0x00000301--死亡
		pgs[6] = 0x00000303--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "张小凡_普通" then
		pgs[4] = 0x00000311--防御
		pgs[9] = 0x00000311--受伤
		pgs[8] = 0x00000312--跑
		pgs[1] = 0x00000314--普通攻击
		pgs[2] = 0x00000314--施法攻击
		pgs[7] = 0x00000314--施法
		pgs[3] = 0x00000315--死亡
		pgs[6] = 0x00000317--静立
		pgs[10] = "素材修复.wdf"
		elseif pg == "赵敏_普通" then
		pgs[4] = 0x00000319--防御
		pgs[9] = 0x00000319--受伤
		pgs[8] = 0x00000320--跑
		pgs[1] = 0x00000322--普通攻击
		pgs[2] = 0x00000322--施法攻击
		pgs[7] = 0x00000322--施法
		pgs[3] = 0x00000323--死亡
		pgs[6] = 0x00000325--静立
		pgs[10] = "素材修复.wdf"


elseif pg == "司法天神_普通"then---------
		pgs[1] = 0x10000121 --攻击A
		pgs[2] = 0x10000121 --攻击B
		pgs[3] = 0x10000122 --倒地  通用死亡 0x6DF00
		pgs[4] = 0x10000120 --防御
		pgs[6] = 0x10000118 --站立
		pgs[7] = 0x10000121 --施法
		pgs[8] = 0x10000119 --跑动
		pgs[9] = 0x10000120 --挨揍
		pgs[10] = "房屋图标.wdf"


elseif pg == "阎罗王_普通"then---------
		pgs[1] = 0x15F50CFF --攻击A
		pgs[2] = 0x15F50CFF --攻击B
		pgs[3] = 0x9152660 --倒地  通用死亡 0x6DF00
		pgs[4] = 0x9402033C --防御
		pgs[6] = 0xA5B436EE --站立
		pgs[7] = 0x21B6E8AA --施法
		pgs[8] = 0x558B14D5 --跑动
		pgs[9] = 0x455697fe --挨揍
		pgs[10] = "nb.wdf"
elseif pg == "阎罗王_普通"then---------
		pgs[1] = 0x15F50CFF --攻击A
		pgs[2] = 0x15F50CFF --攻击B
		pgs[3] = 0x9152660 --倒地  通用死亡 0x6DF00
		pgs[4] = 0x9402033C --防御
		pgs[6] = 0xA5B436EE --站立
		pgs[7] = 0x21B6E8AA --施法
		pgs[8] = 0x558B14D5 --跑动
		pgs[9] = 0x455697fe --挨揍
		pgs[10] = "nb.wdf"
elseif pg == "自在天魔_普通"then---------
		pgs[1] = 0xBF358FFE --攻击A
		pgs[2] = 0xBF358FFE --攻击B
		pgs[3] = 0x6F8C61B8 --倒地  通用死亡 0x6DF00
		pgs[4] = 0xF207F1A0 --防御
		pgs[6] = 0xF207F1A0 --站立
		pgs[7] = 0x679F3915 --施法
		pgs[8] = 0xF207F1A0 --跑动
		pgs[9] = 0x2FE25A8B --挨揍
		pgs[10] = "nb.wdf"
elseif pg == "超级红孩儿_普通" then
	    pgs[1] = 0x10000000--攻击
		pgs[2] = 0x10000000--攻击
		pgs[3] = 0x10000001--死亡
		pgs[4] = 0x10000005--防御
		pgs[6] = 0x10000002--战斗
		pgs[7] = 0x10000003--施法
		pgs[8] = 0x10000004--跑
		pgs[9] = 0x10000005--受伤
		pgs[10] = "xbb.wdf"

elseif pg == "自在心猿_普通" then
	    pgs[1] = 0x20000004--攻击
		pgs[2] = 0x20000004--攻击
		pgs[3] = 0x20000008--死亡
		pgs[4] = 0x20000003--防御
		pgs[6] = 0x20000012--战斗
		pgs[7] = 0x20000006--施法
		pgs[8] = 0x20000010--跑
		pgs[9] = 0x20000003--受伤
		pgs[10] = "xbb.wdf"

elseif pg == "恶魔泡泡_普通" then
	    pgs[1] = 0x51E72D23--攻击
		pgs[2] = 0x51E72D23--攻击
		pgs[3] = 0x51E72D25--死亡
		pgs[4] = 0x51E72D21--防御
		pgs[6] = 0x51E72D28--战斗
		pgs[7] = 0x51E72D24--施法
		pgs[8] = 0x51E72D27--跑
		pgs[9] = 0x51E72D21--受伤
		pgs[10] = "xbb.wdf"

elseif pg == "进阶沙暴_普通" then
	    pgs[1] = 0x00000240--攻击
		pgs[2] = 0x00000240--攻击
		pgs[3] = 0x00000238--死亡
		pgs[4] = 0x00000239--防御
		pgs[6] = 0x00000236--战斗
		pgs[7] = 0x00000241--施法
		pgs[8] = 0x00000237--跑
		pgs[9] = 0x00000239--受伤
		pgs[10] = "xbb.wdf"
elseif pg == "超级飞廉_普通" then---------
		pgs[1] =  0xC0000047
		pgs[2] =  0xC0000047 --攻击B
		pgs[3] =  0xC0000048--倒地  通用死亡 0x6DF00
		pgs[4] =  0xC0000046 --防御
		pgs[6] =   0xC0000046 --站立
		pgs[7] = 0xC0000049 --施法
		pgs[8] =  0xC0000045 --跑动
		pgs[9] =   0xC0000050 --挨揍
		pgs[10] = 	"xbb.wdf"

elseif pg == "超级神柚_普通" then---------
		pgs[1] =  0xC0000055
		pgs[2] =  0xC0000055 --攻击B
		pgs[3] =  0xC0000056--倒地  通用死亡 0x6DF00
		pgs[4] =  0xC0000054 --防御
		pgs[6] =   0xC0000054 --站立
		pgs[7] = 0xC0000057 --施法
		pgs[8] =  0xC0000053 --跑动
		pgs[9] =   0xC0000058 --挨揍
		pgs[10] = 	"xbb.wdf"

elseif pg == "有苏鸠_普通" then---------
		pgs[1] =  0x00000089
		pgs[2] =  0x00000089 --攻击B
		pgs[3] =  0x00000091--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000094 --防御
		pgs[6] =  0x00000094 --站立
		pgs[7] =  0x00000090 --施法
		pgs[8] =  0x00000093 --跑动
		pgs[9] =  0x00000087 --挨揍
		pgs[10] = 	"xcwsc.wdf"

elseif pg == "司雨_普通" then---------
		pgs[1] =  0x00000055
		pgs[2] =  0x00000055 --攻击B
		pgs[3] =  0x00000057--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000060 --防御
		pgs[6] =  0x00000060 --站立
		pgs[7] =  0x00000056 --施法
		pgs[8] =  0x00000059 --跑动
		pgs[9] =  0x00000053 --挨揍
		pgs[10] = 	"xcwsc.wdf"

elseif pg == "进阶司雨_普通" then---------
		pgs[1] =  0x00000026
		pgs[2] =  0x00000026 --攻击B
		pgs[3] =  0x00000028--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000031 --防御
		pgs[6] =  0x00000031 --站立
		pgs[7] =  0x00000027 --施法
		pgs[8] =  0x00000030 --跑动
		pgs[9] =  0x00000024 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "觉醒涂山雪_普通" then---------
		pgs[1] =  0x00000034
		pgs[2] =  0x00000034 --攻击B
		pgs[3] =  0x00000036--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000039 --防御
		pgs[6] =  0x00000039 --站立
		pgs[7] =  0x00000035 --施法
		pgs[8] =  0x00000038 --跑动
		pgs[9] =  0x00000032 --挨揍
		pgs[10] = 	"xcwsc.wdf"

elseif pg == "泡泡仙灵·飞燕女_普通" then---------
		pgs[1] =  0x00000127
		pgs[2] =  0x00000127 --攻击B
		pgs[3] =  0x00000128--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000129 --防御
		pgs[6] =  0x00000130 --站立
		pgs[7] =  0x00000131 --施法
		pgs[8] =  0x00000132 --跑动
		pgs[9] =  0x00000133 --挨揍
		pgs[10] = 	"xcwsc.wdf"

elseif pg == "泡泡仙灵·骨精灵_普通" then---------
		pgs[1] =  0x00000134
		pgs[2] =  0x00000134 --攻击B
		pgs[3] =  0x00000135--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000136 --防御
		pgs[6] =  0x00000137 --站立
		pgs[7] =  0x00000138 --施法
		pgs[8] =  0x00000139 --跑动
		pgs[9] =  0x00000140 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "泡泡仙灵·剑侠客_普通" then---------
		pgs[1] =  0x00000141
		pgs[2] =  0x00000141 --攻击B
		pgs[3] =  0x00000142--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000143 --防御
		pgs[6] =  0x00000144 --站立
		pgs[7] =  0x00000145 --施法
		pgs[8] =  0x00000146 --跑动
		pgs[9] =  0x00000147 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "泡泡仙灵·龙太子_普通" then---------
		pgs[1] =  0x00000148
		pgs[2] =  0x00000148 --攻击B
		pgs[3] =  0x00000149--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000150 --防御
		pgs[6] =  0x00000151 --站立
		pgs[7] =  0x00000152 --施法
		pgs[8] =  0x00000153 --跑动
		pgs[9] =  0x00000154 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "泡泡仙灵·杀破狼_普通" then---------
		pgs[1] =  0x00000155
		pgs[2] =  0x00000155 --攻击B
		pgs[3] =  0x00000156--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000157 --防御
		pgs[6] =  0x00000158 --站立
		pgs[7] =  0x00000159 --施法
		pgs[8] =  0x00000160 --跑动
		pgs[9] =  0x00000161 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "泡泡仙灵·神天兵_普通" then---------
		pgs[1] =  0x00000162
		pgs[2] =  0x00000162 --攻击B
		pgs[3] =  0x00000163--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000164 --防御
		pgs[6] =  0x00000165 --站立
		pgs[7] =  0x00000166 --施法
		pgs[8] =  0x00000167 --跑动
		pgs[9] =  0x00000168 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "泡泡仙灵·巫蛮儿_普通" then---------
		pgs[1] =  0x00000169
		pgs[2] =  0x00000169 --攻击B
		pgs[3] =  0x00000170--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000171 --防御
		pgs[6] =  0x00000172 --站立
		pgs[7] =  0x00000173 --施法
		pgs[8] =  0x00000174 --跑动
		pgs[9] =  0x00000175 --挨揍
		pgs[10] = 	"xcwsc.wdf"

elseif pg == "泡泡仙灵·羽灵神_普通" then---------
		pgs[1] =  0x00000176
		pgs[2] =  0x00000176 --攻击B
		pgs[3] =  0x00000177--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000178 --防御
		pgs[6] =  0x00000179 --站立
		pgs[7] =  0x00000180 --施法
		pgs[8] =  0x00000181 --跑动
		pgs[9] =  0x00000182 --挨揍
		pgs[10] = 	"xcwsc.wdf"
elseif pg == "暗黑谛听_普通"then---------
	    pgs[1] =  0x00000064
		pgs[2] =  0x00000064 --攻击B
		pgs[3] =  0x00000066--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000063 --防御
		pgs[6] =  0x00000001 --站立
		pgs[7] =  0x00000065 --施法
		pgs[8] =  0x00000068 --跑动
		pgs[9] =  0x00000063 --挨揍
		pgs[10] = 	"anhebb.wdf"
elseif pg == "暗黑童子_普通"then---------
	    pgs[1] =  0x00000005
		pgs[2] =  0x00000005 --攻击B
		pgs[3] =  0x00000007--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000003 --防御
		pgs[6] =  0x00000010 --站立
		pgs[7] =  0x00000006 --施法
		pgs[8] =  0x00000009 --跑动
		pgs[9] =  0x00000003 --挨揍
		pgs[10] = 	"anhebb.wdf"
elseif pg == "彩蝶女孩_普通"then---------
	    pgs[1] =  0x69007831
		pgs[2] =  0x69007831 --攻击B
		pgs[3] =  0x69007832--倒地  通用死亡 0x6DF00
		pgs[4] =  0x69007833 --防御
		pgs[6] =  0x69007834 --站立
		pgs[7] =  0x69007835 --施法
		pgs[8] =  0x69007836 --跑动
		pgs[9] =  0x69007837 --挨揍
		pgs[10] = "xcwsc.wdf"
elseif pg == "彩蝶男孩_普通"then---------
	    pgs[1] =  0x69007838
		pgs[2] =  0x69007838 --攻击B
		pgs[3] =  0x69007839--倒地  通用死亡 0x6DF00
		pgs[4] =  0x69007840 --防御
		pgs[6] =  0x69007841 --站立
		pgs[7] =  0x69007842 --施法
		pgs[8] =  0x69007843 --跑动
		pgs[9] =  0x69007844 --挨揍
		pgs[10] = "xcwsc.wdf"
elseif pg == "小小盲僧_普通"then---------
	    pgs[1] =  0x00000073
		pgs[2] =  0x00000073 --攻击B
		pgs[3] =  0x00000074--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000075 --防御
		pgs[6] =  0x00000076 --站立
		pgs[7] =  0x00000077 --施法
		pgs[8] =  0x00000078 --跑动
		pgs[9] =  0x00000079 --挨揍
		pgs[10] = 	"靓号.wdf"
elseif pg == "盲僧眼珠_普通"then---------
	    pgs[1] =  0x00000080
		pgs[2] =  0x00000080 --攻击B
		pgs[3] =  0x00000081--倒地  通用死亡 0x6DF00
		pgs[4] =  0x00000082 --防御
		pgs[6] =  0x00000083 --站立
		pgs[7] =  0x00000084 --施法
		pgs[8] =  0x00000085 --跑动
		pgs[9] =  0x00000086 --挨揍
		pgs[10] = 	"靓号.wdf"
 ----------------------------------------------------------------------------------------九黎
elseif pg =="刑天_普通" then   -------------九黎
		pgs[1] = 0x10000795--攻击
		pgs[2] = 0x10000795--攻击二
		pgs[3] = 0x10000799--死亡
		pgs[4] = 0x10000794--防御
		pgs[6] = 0x10000793--待机
		pgs[7] = 0x10000797--施法
		pgs[8] = 0x10000800--移动
		pgs[9] = 0x10000792--挨打
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000796--攻击特效1
        pgs[13] = 0x10000798--法术特效1
        pgs[15] = "yjlsc.wdf"--特效文件
elseif pg =="风祖飞廉_普通" then  -------------九黎
		pgs[1] = 0x10000762--攻击
		pgs[2] = 0x10000762--攻击二
		pgs[3] = 0x10000766--死亡
		pgs[4] = 0x10000761--防御
		pgs[6] = 0x10000760--待机
		pgs[7] = 0x10000764--施法
		pgs[8] = 0x10000767--移动
		pgs[9] = 0x10000759--挨打
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000763--攻击特效1
        pgs[13] = 0x10000765--法术特效1
        pgs[15] = "yjlsc.wdf"--特效文件
elseif pg =="食铁兽_普通" then
		pgs[1] = 0x10000778--攻击
		pgs[2] = 0x10000778--攻击二
		pgs[3] = 0x10000782--死亡
		pgs[4] = 0x10000777--防御
		pgs[6] = 0x10000776--待机
		pgs[7] = 0x10000780--施法
		pgs[8] = 0x10000784--移动
		pgs[9] = 0x10000775--挨打
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000779--攻击特效1
        pgs[12] = 0x10000781--法术特效1
        pgs[15] = "yjlsc.wdf"--特效文件



elseif pg =="影精灵_普通" then
		pgs[1] = 0x10000375--.战斗普通攻击--攻击
		pgs[2] = 0x10000375--.战斗普通攻击--攻击二
		pgs[3] = 0x10000380--.战斗普通死亡--死亡
		pgs[4] = 0x10000374--.战斗普通防御--防御
		pgs[6] = 0x10000373--.战斗普通待机6--待机
		pgs[7] = 0x10000379--.战斗普通施法--施法
		pgs[8] = 0x10000381--.战斗普通移动--移动
		pgs[9] = 0x10000372--.战斗普通挨打--挨打
		pgs[10] = "yjlsc.wdf"

elseif pg =="影精灵_双斧" then

		pgs[1] = 0x10000375--.战斗普通攻击--攻击
		pgs[2] = 0x10000375--.战斗普通攻击--攻击二
		pgs[3] = 0x10000380--.战斗普通死亡--死亡
		pgs[4] = 0x10000374--.战斗普通防御--防御
		pgs[6] = 0x10000373--.战斗普通待机6--待机
		pgs[7] = 0x10000379--.战斗普通施法--施法
		pgs[8] = 0x10000381--.战斗普通移动--移动
		pgs[9] = 0x10000372--.战斗普通挨打--挨打
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000339--.双斧(乾)攻击特效1--攻击特效1
        pgs[12] = 0x10000342--.双斧(乾)施法特效11--法术特效1
        pgs[13] = 0x10000340--.双斧(乾)光武攻击特效
        pgs[14] = 0x10000341--.双斧(乾)光武施法特效
        pgs[15] = "yjlsc.wdf"--特效文件
        pgs[18] = 0x10000335--.双斧(坤)攻击特效1
        pgs[19] = 0x10000338--.双斧(坤)施法特效1
        pgs[20] = 0x10000336--.双斧(坤)光武攻击特效
        pgs[21] = 0x10000337--.双斧(坤)光武施法特效
        pgs[22] = "yjlsc.wdf"--.双斧(坤)光武施法特效
elseif pg =="影精灵_爪刺" then
		pgs[1] = 0x10000385
		pgs[2] = 0x10000385
		pgs[3] = 0x10000387
		pgs[4] = 0x10000384
		pgs[6] = 0x10000383
		pgs[7] = 0x10000386
		pgs[8] = 0x10000388
		pgs[9] = 0x10000382
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000361
        pgs[12] = 0x10000364
        pgs[13] = 0x10000362
        pgs[14] = 0x10000363
        pgs[15] = "yjlsc.wdf"
elseif pg =="影精灵_魔棒" then
		pgs[1] = 0x10000368
		pgs[2] = 0x10000368
		pgs[3] = 0x10000370
		pgs[4] = 0x10000367
		pgs[6] = 0x10000366
		pgs[7] = 0x10000369
		pgs[8] = 0x10000371
		pgs[9] = 0x10000365
		pgs[10] = "yjlsc.wdf"
        pgs[11] = 0x10000357
        pgs[12] = 0x10000360
        pgs[13] = 0x10000358
        pgs[14] = 0x10000359
        pgs[15] = "yjlsc.wdf"--特效文件

elseif pg == "细木棒_影精灵_普通" then    ------V1
		pgs[1] = 0x10000396
		pgs[2] = 0x10000396
		pgs[3] = 0x10000400
		pgs[4] = 0x10000395
		pgs[6] = 0x10000394
		pgs[7] = 0x10000399
		pgs[8] = 0x10000401
		pgs[9] = 0x10000393
        pgs[10] = "yjlsc.wdf"
elseif pg == "金丝魔棒_影精灵_普通" then
		pgs[1] = 0x10000396
		pgs[2] = 0x10000396
		pgs[3] = 0x10000400
		pgs[4] = 0x10000395
		pgs[6] = 0x10000394
		pgs[7] = 0x10000399
		pgs[8] = 0x10000401
		pgs[9] = 0x10000393
        pgs[10] = "yjlsc.wdf"
elseif pg == "玉如意_影精灵_普通" then
		pgs[1] = 0x10000396
		pgs[2] = 0x10000396
		pgs[3] = 0x10000400
		pgs[4] = 0x10000395
		pgs[6] = 0x10000394
		pgs[7] = 0x10000399
		pgs[8] = 0x10000401
		pgs[9] = 0x10000393
        pgs[10] = "yjlsc.wdf"
elseif pg == "点金棒_影精灵_普通" then
		pgs[1] = 0x10000450
		pgs[2] = 0x10000450
		pgs[3] = 0x10000454
		pgs[4] = 0x10000449
		pgs[6] = 0x10000448
		pgs[7] = 0x10000453
		pgs[8] = 0x10000455
		pgs[9] = 0x10000447
        pgs[10] = "yjlsc.wdf"
elseif pg == "云龙棒_影精灵_普通" then
		pgs[1] = 0x10000450
		pgs[2] = 0x10000450
		pgs[3] = 0x10000454
		pgs[4] = 0x10000449
		pgs[6] = 0x10000448
		pgs[7] = 0x10000453
		pgs[8] = 0x10000455
		pgs[9] = 0x10000447
        pgs[10] = "yjlsc.wdf"
elseif pg == "幽路引魂_影精灵_普通" then
		pgs[1] = 0x10000450
		pgs[2] = 0x10000450
		pgs[3] = 0x10000454
		pgs[4] = 0x10000449
		pgs[6] = 0x10000448
		pgs[7] = 0x10000453
		pgs[8] = 0x10000455
		pgs[9] = 0x10000447
        pgs[10] = "yjlsc.wdf"
elseif pg == "满天星_影精灵_普通" then
		pgs[1] = 0x10000512
		pgs[2] = 0x10000512
		pgs[3] = 0x10000516
		pgs[4] = 0x10000511
		pgs[6] = 0x10000510
		pgs[7] = 0x10000515
		pgs[8] = 0x10000517
		pgs[9] = 0x10000509
        pgs[10] = "yjlsc.wdf"
elseif pg == "水晶棒_影精灵_普通" then
		pgs[1] = 0x10000512
		pgs[2] = 0x10000512
		pgs[3] = 0x10000516
		pgs[4] = 0x10000511
		pgs[6] = 0x10000510
		pgs[7] = 0x10000515
		pgs[8] = 0x10000517
		pgs[9] = 0x10000509
        pgs[10] = "yjlsc.wdf"
elseif pg == "日月光华_影精灵_普通" then
		pgs[1] = 0x10000512
		pgs[2] = 0x10000512
		pgs[3] = 0x10000516
		pgs[4] = 0x10000511
		pgs[6] = 0x10000510
		pgs[7] = 0x10000515
		pgs[8] = 0x10000517
		pgs[9] = 0x10000509
        pgs[10] = "yjlsc.wdf"
elseif pg == "沧海_影精灵_普通" then
		pgs[1] = 0x10000622
		pgs[2] = 0x10000622
		pgs[3] = 0x10000626
		pgs[4] = 0x10000621
		pgs[6] = 0x10000620
		pgs[7] = 0x10000625
		pgs[8] = 0x10000627
		pgs[9] = 0x10000619
        pgs[10] = "yjlsc.wdf"
elseif pg == "红莲_影精灵_普通" then
		pgs[1] = 0x10000668
		pgs[2] = 0x10000668
		pgs[3] = 0x10000672
		pgs[4] = 0x10000667
		pgs[6] = 0x10000666
		pgs[7] = 0x10000671
		pgs[8] = 0x10000673
		pgs[9] = 0x10000665
        pgs[10] = "yjlsc.wdf"
elseif pg == "盘龙_影精灵_普通" then
		pgs[1] = 0x10000012
		pgs[2] = 0x10000012
		pgs[3] = 0x10000016
		pgs[4] = 0x10000011
		pgs[6] = 0x10000010
		pgs[7] = 0x10000015
		pgs[8] = 0x10000017
		pgs[9] = 0x10000009
        pgs[10] = "yjlsc.wdf"
elseif pg == "降魔玉杵_影精灵_普通" then
		pgs[1] = 0x10000062
		pgs[2] = 0x10000062
		pgs[3] = 0x10000066
		pgs[4] = 0x10000061
		pgs[6] = 0x10000060
		pgs[7] = 0x10000065
		pgs[8] = 0x10000067
		pgs[9] = 0x10000059
        pgs[10] = "yjlsc.wdf"
elseif pg == "青藤玉树_影精灵_普通" then
		pgs[1] = 0x10000112
		pgs[2] = 0x10000112
		pgs[3] = 0x10000116
		pgs[4] = 0x10000111
		pgs[6] = 0x10000110
		pgs[7] = 0x10000115
		pgs[8] = 0x10000117
		pgs[9] = 0x10000109
        pgs[10] = "yjlsc.wdf"
elseif pg == "墨玉骷髅_影精灵_普通" then
		pgs[1] = 0x10000162
		pgs[2] = 0x10000162
		pgs[3] = 0x10000166
		pgs[4] = 0x10000161
		pgs[6] = 0x10000160
		pgs[7] = 0x10000165
		pgs[8] = 0x10000167
		pgs[9] = 0x10000159
        pgs[10] = "yjlsc.wdf"
elseif pg == "丝萝乔木_影精灵_普通" then
		pgs[1] = 0x10000212
		pgs[2] = 0x10000212
		pgs[3] = 0x10000216
		pgs[4] = 0x10000211
		pgs[6] = 0x10000210
		pgs[7] = 0x10000215
		pgs[8] = 0x10000217
		pgs[9] = 0x10000209
        pgs[10] = "yjlsc.wdf"
elseif pg == "醍醐_影精灵_普通" then
		pgs[1] = 0x10000262
		pgs[2] = 0x10000262
		pgs[3] = 0x10000266
		pgs[4] = 0x10000261
		pgs[6] = 0x10000260
		pgs[7] = 0x10000265
		pgs[8] = 0x10000267
		pgs[9] = 0x10000259
        pgs[10] = "yjlsc.wdf"
elseif pg == "铁爪_影精灵_普通" then  --v2
		pgs[1] = 0x10000432
		pgs[2] = 0x10000432
		pgs[3] = 0x10000436
		pgs[4] = 0x10000431
		pgs[6] = 0x10000430
		pgs[7] = 0x10000435
		pgs[8] = 0x10000437
		pgs[9] = 0x10000429
        pgs[10] = "yjlsc.wdf"
elseif pg == "天狼爪_影精灵_普通" then
		pgs[1] = 0x10000432
		pgs[2] = 0x10000432
		pgs[3] = 0x10000436
		pgs[4] = 0x10000431
		pgs[6] = 0x10000430
		pgs[7] = 0x10000435
		pgs[8] = 0x10000437
		pgs[9] = 0x10000429
        pgs[10] = "yjlsc.wdf"
elseif pg == "幽冥鬼爪_影精灵_普通" then
		pgs[1] = 0x10000432
		pgs[2] = 0x10000432
		pgs[3] = 0x10000436
		pgs[4] = 0x10000431
		pgs[6] = 0x10000430
		pgs[7] = 0x10000435
		pgs[8] = 0x10000437
		pgs[9] = 0x10000429
        pgs[10] = "yjlsc.wdf"
elseif pg == "青龙牙_影精灵_普通" then
		pgs[1] = 0x10000484
		pgs[2] = 0x10000484
		pgs[3] = 0x10000488
		pgs[4] = 0x10000483
		pgs[6] = 0x10000492
		pgs[7] = 0x10000487
		pgs[8] = 0x10000489
		pgs[9] = 0x10000491
        pgs[10] = "yjlsc.wdf"
elseif pg == "勾魂爪_影精灵_普通" then
		pgs[1] = 0x10000484
		pgs[2] = 0x10000484
		pgs[3] = 0x10000488
		pgs[4] = 0x10000483
		pgs[6] = 0x10000492
		pgs[7] = 0x10000487
		pgs[8] = 0x10000489
		pgs[9] = 0x10000491
        pgs[10] = "yjlsc.wdf"
elseif pg == "玄冰刺_影精灵_普通" then
		pgs[1] = 0x10000484
		pgs[2] = 0x10000484
		pgs[3] = 0x10000488
		pgs[4] = 0x10000483
		pgs[6] = 0x10000492
		pgs[7] = 0x10000487
		pgs[8] = 0x10000489
		pgs[9] = 0x10000491
        pgs[10] = "yjlsc.wdf"
elseif pg == "青刚刺_影精灵_普通" then
		pgs[1] = 0x10000548
		pgs[2] = 0x10000548
		pgs[3] = 0x10000552
		pgs[4] = 0x10000547
		pgs[6] = 0x10000546
		pgs[7] = 0x10000551
		pgs[8] = 0x10000553
		pgs[9] = 0x10000545
        pgs[10] = "yjlsc.wdf"
elseif pg == "华光刺_影精灵_普通" then
		pgs[1] = 0x10000548
		pgs[2] = 0x10000548
		pgs[3] = 0x10000552
		pgs[4] = 0x10000547
		pgs[6] = 0x10000546
		pgs[7] = 0x10000551
		pgs[8] = 0x10000553
		pgs[9] = 0x10000545
        pgs[10] = "yjlsc.wdf"
elseif pg == "龙鳞刺_影精灵_普通" then
		pgs[1] = 0x10000548
		pgs[2] = 0x10000548
		pgs[3] = 0x10000552
		pgs[4] = 0x10000547
		pgs[6] = 0x10000546
		pgs[7] = 0x10000551
		pgs[8] = 0x10000553
		pgs[9] = 0x10000545
        pgs[10] = "yjlsc.wdf"
elseif pg == "撕天_影精灵_普通" then
		pgs[1] = 0x10000658
		pgs[2] = 0x10000658
		pgs[3] = 0x10000662
		pgs[4] = 0x10000657
		pgs[6] = 0x10000656
		pgs[7] = 0x10000661
		pgs[8] = 0x10000663
		pgs[9] = 0x10000655
        pgs[10] = "yjlsc.wdf"
elseif pg == "毒牙_影精灵_普通" then
		pgs[1] = 0x10000704
		pgs[2] = 0x10000704
		pgs[3] = 0x10000708
		pgs[4] = 0x10000703
		pgs[6] = 0x10000702
		pgs[7] = 0x10000707
		pgs[8] = 0x10000709
		pgs[9] = 0x10000701
        pgs[10] = "yjlsc.wdf"
elseif pg == "胭脂_影精灵_普通" then
		pgs[1] = 0x10000048
		pgs[2] = 0x10000048
		pgs[3] = 0x10000052
		pgs[4] = 0x10000047
		pgs[6] = 0x10000046
		pgs[7] = 0x10000051
		pgs[8] = 0x10000053
		pgs[9] = 0x10000045
        pgs[10] = "yjlsc.wdf"
elseif pg == "九阴勾魂_影精灵_普通" then
		pgs[1] = 0x10000098
		pgs[2] = 0x10000098
		pgs[3] = 0x10000102
		pgs[4] = 0x10000097
		pgs[6] = 0x10000096
		pgs[7] = 0x10000101
		pgs[8] = 0x10000103
		pgs[9] = 0x10000095
        pgs[10] = "yjlsc.wdf"
elseif pg == "雪蚕之刺_影精灵_普通" then
		pgs[1] = 0x10000148
		pgs[2] = 0x10000148
		pgs[3] = 0x10000152
		pgs[4] = 0x10000147
		pgs[6] = 0x10000146
		pgs[7] = 0x10000151
		pgs[8] = 0x10000153
		pgs[9] = 0x10000145
        pgs[10] = "yjlsc.wdf"
elseif pg == "贵霜之牙_影精灵_普通" then
		pgs[1] = 0x10000198
		pgs[2] = 0x10000198
		pgs[3] = 0x10000202
		pgs[4] = 0x10000197
		pgs[6] = 0x10000196
		pgs[7] = 0x10000201
		pgs[8] = 0x10000203
		pgs[9] = 0x10000195
        pgs[10] = "yjlsc.wdf"
elseif pg == "忘川三途_影精灵_普通" then
		pgs[1] = 0x10000248
		pgs[2] = 0x10000248
		pgs[3] = 0x10000252
		pgs[4] = 0x10000247
		pgs[6] = 0x10000246
		pgs[7] = 0x10000251
		pgs[8] = 0x10000253
		pgs[9] = 0x10000245
        pgs[10] = "yjlsc.wdf"
elseif pg == "离钩_影精灵_普通" then
		pgs[1] = 0x10000298
		pgs[2] = 0x10000298
		pgs[3] = 0x10000302
		pgs[4] = 0x10000297
		pgs[6] = 0x10000296
		pgs[7] = 0x10000301
		pgs[8] = 0x10000303
		pgs[9] = 0x10000295
        pgs[10] = "yjlsc.wdf"
elseif pg == "顽石双斧(乾)_影精灵_普通" then   --v3
		pgs[1] = 0x10000406
		pgs[2] = 0x10000406
		pgs[3] = 0x10000413
		pgs[4] = 0x10000405
		pgs[6] = 0x10000404
		pgs[7] = 0x10000412
		pgs[8] = 0x10000414
		pgs[9] = 0x10000403
        pgs[10] = "yjlsc.wdf"
elseif pg == "镔铁双斧(乾)_影精灵_普通" then
		pgs[1] = 0x10000406
		pgs[2] = 0x10000406
		pgs[3] = 0x10000413
		pgs[4] = 0x10000405
		pgs[6] = 0x10000404
		pgs[7] = 0x10000412
		pgs[8] = 0x10000414
		pgs[9] = 0x10000403
        pgs[10] = "yjlsc.wdf"
elseif pg == "黑曜双斧(乾)_影精灵_普通" then
		pgs[1] = 0x10000406
		pgs[2] = 0x10000406
		pgs[3] = 0x10000413
		pgs[4] = 0x10000405
		pgs[6] = 0x10000404
		pgs[7] = 0x10000412
		pgs[8] = 0x10000414
		pgs[9] = 0x10000403
        pgs[10] = "yjlsc.wdf"
elseif pg == "枭首双斧(乾)_影精灵_普通" then
		pgs[1] = 0x10000460
		pgs[2] = 0x10000460
		pgs[3] = 0x10000467
		pgs[4] = 0x10000459
		pgs[6] = 0x10000458
		pgs[7] = 0x10000466
		pgs[8] = 0x10000468
		pgs[9] = 0x10000457
        pgs[10] = "yjlsc.wdf"
elseif pg == "破军双斧(乾)_影精灵_普通" then
		pgs[1] = 0x10000460
		pgs[2] = 0x10000460
		pgs[3] = 0x10000467
		pgs[4] = 0x10000459
		pgs[6] = 0x10000458
		pgs[7] = 0x10000466
		pgs[8] = 0x10000468
		pgs[9] = 0x10000457
        pgs[10] = "yjlsc.wdf"
elseif pg == "隳城双戚(乾)_影精灵_普通" then
		pgs[1] = 0x10000460
		pgs[2] = 0x10000460
		pgs[3] = 0x10000467
		pgs[4] = 0x10000459
		pgs[6] = 0x10000458
		pgs[7] = 0x10000466
		pgs[8] = 0x10000468
		pgs[9] = 0x10000457
        pgs[10] = "yjlsc.wdf"
elseif pg == "飞头蛮(乾)_影精灵_普通" then
		pgs[1] = 0x10000522
		pgs[2] = 0x10000522
		pgs[3] = 0x10000529
		pgs[4] = 0x10000521
		pgs[6] = 0x10000520
		pgs[7] = 0x10000528
		pgs[8] = 0x10000530
		pgs[9] = 0x10000519
        pgs[10] = "yjlsc.wdf"
elseif pg == "竹叶青(乾)_影精灵_普通" then
		pgs[1] = 0x10000558
		pgs[2] = 0x10000558
		pgs[3] = 0x10000565
		pgs[4] = 0x10000557
		pgs[6] = 0x10000556
		pgs[7] = 0x10000564
		pgs[8] = 0x10000566
		pgs[9] = 0x10000555
        pgs[10] = "yjlsc.wdf"
elseif pg == "鲛煞(乾)_影精灵_普通" then
		pgs[1] = 0x10000592
		pgs[2] = 0x10000592
		pgs[3] = 0x10000599
		pgs[4] = 0x10000591
		pgs[6] = 0x10000590
		pgs[7] = 0x10000598
		pgs[8] = 0x10000600
		pgs[9] = 0x10000589
        pgs[10] = "yjlsc.wdf"
elseif pg == "啖月(乾)_影精灵_普通" then
		pgs[1] = 0x10000632
		pgs[2] = 0x10000632
		pgs[3] = 0x10000639
		pgs[4] = 0x10000631
		pgs[6] = 0x10000630
		pgs[7] = 0x10000638
		pgs[8] = 0x10000640
		pgs[9] = 0x10000629
        pgs[10] = "yjlsc.wdf"
elseif pg == "义战(乾)_影精灵_普通" then
		pgs[1] = 0x10000678
		pgs[2] = 0x10000678
		pgs[3] = 0x10000685
		pgs[4] = 0x10000677
		pgs[6] = 0x10000676
		pgs[7] = 0x10000684
		pgs[8] = 0x10000686
		pgs[9] = 0x10000675
        pgs[10] = "yjlsc.wdf"
elseif pg == "恶来(乾)_影精灵_普通" then
		pgs[1] = 0x10000022
		pgs[2] = 0x10000022
		pgs[3] = 0x10000029
		pgs[4] = 0x10000021
		pgs[6] = 0x10000020
		pgs[7] = 0x10000028
		pgs[8] = 0x10000030
		pgs[9] = 0x10000019
        pgs[10] = "yjlsc.wdf"
elseif pg == "烬世野火(乾)_影精灵_普通" then
		pgs[1] = 0x10000072
		pgs[2] = 0x10000072
		pgs[3] = 0x10000079
		pgs[4] = 0x10000071
		pgs[6] = 0x10000070
		pgs[7] = 0x10000078
		pgs[8] = 0x10000080
		pgs[9] = 0x10000069
        pgs[10] = "yjlsc.wdf"
elseif pg == "九州海沸(乾)_影精灵_普通" then
		pgs[1] = 0x10000122
		pgs[2] = 0x10000122
		pgs[3] = 0x10000129
		pgs[4] = 0x10000121
		pgs[6] = 0x10000120
		pgs[7] = 0x10000128
		pgs[8] = 0x10000130
		pgs[9] = 0x10000119
        pgs[10] = "yjlsc.wdf"
elseif pg == "八狱末劫(乾)_影精灵_普通" then
		pgs[1] = 0x10000172
		pgs[2] = 0x10000172
		pgs[3] = 0x10000179
		pgs[4] = 0x10000171
		pgs[6] = 0x10000170
		pgs[7] = 0x10000178
		pgs[8] = 0x10000180
		pgs[9] = 0x10000169
        pgs[10] = "yjlsc.wdf"
elseif pg == "罗喉计都(乾)_影精灵_普通" then
		pgs[1] = 0x10000222
		pgs[2] = 0x10000222
		pgs[3] = 0x10000229
		pgs[4] = 0x10000221
		pgs[6] = 0x10000220
		pgs[7] = 0x10000228
		pgs[8] = 0x10000230
		pgs[9] = 0x10000219
        pgs[10] = "yjlsc.wdf"
elseif pg == "非天(乾)_影精灵_普通" then
		pgs[1] = 0x10000272
		pgs[2] = 0x10000272
		pgs[3] = 0x10000279
		pgs[4] = 0x10000271
		pgs[6] = 0x10000270
		pgs[7] = 0x10000278
		pgs[8] = 0x10000280
		pgs[9] = 0x10000269
        pgs[10] = "yjlsc.wdf"
elseif pg == "顽石双斧(坤)_影精灵_普通" then  --V4
		pgs[1] = 0x10000419
		pgs[2] = 0x10000419
		pgs[3] = 0x10000426
		pgs[4] = 0x10000418
		pgs[6] = 0x10000417
		pgs[7] = 0x10000425
		pgs[8] = 0x10000427
		pgs[9] = 0x10000416
        pgs[10] = "yjlsc.wdf"
elseif pg == "镔铁双斧(坤)_影精灵_普通" then
		pgs[1] = 0x10000419
		pgs[2] = 0x10000419
		pgs[3] = 0x10000426
		pgs[4] = 0x10000418
		pgs[6] = 0x10000417
		pgs[7] = 0x10000425
		pgs[8] = 0x10000427
		pgs[9] = 0x10000416
        pgs[10] = "yjlsc.wdf"
elseif pg == "黑曜双斧(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000419
		pgs[2] = 0x10000419
		pgs[3] = 0x10000426
		pgs[4] = 0x10000418
		pgs[6] = 0x10000417
		pgs[7] = 0x10000425
		pgs[8] = 0x10000427
		pgs[9] = 0x10000416
        pgs[10] = "yjlsc.wdf"
elseif pg == "枭首双斧(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000473
		pgs[2] = 0x10000473
		pgs[3] = 0x10000480
		pgs[4] = 0x10000472
		pgs[6] = 0x10000471
		pgs[7] = 0x10000479
		pgs[8] = 0x10000481
		pgs[9] = 0x10000470
        pgs[10] = "yjlsc.wdf"
elseif pg == "破军双斧(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000473
		pgs[2] = 0x10000473
		pgs[3] = 0x10000480
		pgs[4] = 0x10000472
		pgs[6] = 0x10000471
		pgs[7] = 0x10000479
		pgs[8] = 0x10000481
		pgs[9] = 0x10000470
        pgs[10] = "yjlsc.wdf"
elseif pg == "隳城双戚(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000473
		pgs[2] = 0x10000473
		pgs[3] = 0x10000480
		pgs[4] = 0x10000472
		pgs[6] = 0x10000471
		pgs[7] = 0x10000479
		pgs[8] = 0x10000481
		pgs[9] = 0x10000470
        pgs[10] = "yjlsc.wdf"
elseif pg == "飞头蛮(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000535
		pgs[2] = 0x10000535
		pgs[3] = 0x10000542
		pgs[4] = 0x10000534
		pgs[6] = 0x10000533
		pgs[7] = 0x10000541
		pgs[8] = 0x10000543
		pgs[9] = 0x10000532
        pgs[10] = "yjlsc.wdf"
elseif pg == "竹叶青(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000571
		pgs[2] = 0x10000571
		pgs[3] = 0x10000578
		pgs[4] = 0x10000570
		pgs[6] = 0x10000569
		pgs[7] = 0x10000577
		pgs[8] = 0x10000579
		pgs[9] = 0x10000568
        pgs[10] = "yjlsc.wdf"
elseif pg == "鲛煞(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000605
		pgs[2] = 0x10000605
		pgs[3] = 0x10000612
		pgs[4] = 0x10000604
		pgs[6] = 0x10000603
		pgs[7] = 0x10000611
		pgs[8] = 0x10000613
		pgs[9] = 0x10000602
        pgs[10] = "yjlsc.wdf"
elseif pg == "啖月(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000645
		pgs[2] = 0x10000645
		pgs[3] = 0x10000652
		pgs[4] = 0x10000644
		pgs[6] = 0x10000643
		pgs[7] = 0x10000651
		pgs[8] = 0x10000653
		pgs[9] = 0x10000642
        pgs[10] = "yjlsc.wdf"
elseif pg == "义战(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000691
		pgs[2] = 0x10000691
		pgs[3] = 0x10000698
		pgs[4] = 0x10000690
		pgs[6] = 0x10000689
		pgs[7] = 0x10000697
		pgs[8] = 0x10000699
		pgs[9] = 0x10000688
        pgs[10] = "yjlsc.wdf"
elseif pg == "恶来(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000035
		pgs[2] = 0x10000035
		pgs[3] = 0x10000042
		pgs[4] = 0x10000034
		pgs[6] = 0x10000033
		pgs[7] = 0x10000041
		pgs[8] = 0x10000043
		pgs[9] = 0x10000032
        pgs[10] = "yjlsc.wdf"
elseif pg == "烬世野火(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000085
		pgs[2] = 0x10000085
		pgs[3] = 0x10000092
		pgs[4] = 0x10000084
		pgs[6] = 0x10000083
		pgs[7] = 0x10000091
		pgs[8] = 0x10000093
		pgs[9] = 0x10000082
        pgs[10] = "yjlsc.wdf"
elseif pg == "九州海沸(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000135
		pgs[2] = 0x10000135
		pgs[3] = 0x10000142
		pgs[4] = 0x10000134
		pgs[6] = 0x10000133
		pgs[7] = 0x10000141
		pgs[8] = 0x10000143
		pgs[9] = 0x10000132
        pgs[10] = "yjlsc.wdf"
elseif pg == "八狱末劫(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000185
		pgs[2] = 0x10000185
		pgs[3] = 0x10000192
		pgs[4] = 0x10000184
		pgs[6] = 0x10000183
		pgs[7] = 0x10000191
		pgs[8] = 0x10000193
		pgs[9] = 0x10000182
        pgs[10] = "yjlsc.wdf"
elseif pg == "罗喉计都(坤)_影精灵_普通" then--20
		pgs[1] = 0x10000235
		pgs[2] = 0x10000235
		pgs[3] = 0x10000242
		pgs[4] = 0x10000234
		pgs[6] = 0x10000233
		pgs[7] = 0x10000241
		pgs[8] = 0x10000243
		pgs[9] = 0x10000232
        pgs[10] = "yjlsc.wdf"
elseif pg == "非天(坤)_影精灵_普通" then
		pgs[1] = 0x10000285
		pgs[2] = 0x10000285
		pgs[3] = 0x10000292
		pgs[4] = 0x10000284
		pgs[6] = 0x10000283
		pgs[7] = 0x10000291
		pgs[8] = 0x10000293
		pgs[9] = 0x10000282
		pgs[10] = "yjlsc.wdf"


--V0























-- elseif pg == "恶魔泡泡_普通" then---------
-- 		pgs[1] =  "恶魔泡泡攻击"
-- 		pgs[2] =  "恶魔泡泡攻击"--攻击B
-- 		pgs[3] =  "恶魔泡泡死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "恶魔泡泡站立" --防御
-- 		pgs[6] =  "恶魔泡泡站立" --站立
-- 		pgs[7] =  "恶魔泡泡施法" --施法
-- 		pgs[8] =  "恶魔泡泡行走" --跑动
-- 		pgs[9] =  "恶魔泡泡挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"
-- elseif pg == "超级飞廉_普通" then---------
-- 		pgs[1] =  "超级飞廉攻击"
-- 		pgs[2] =  "超级飞廉攻击"--攻击B
-- 		pgs[3] =  "超级飞廉死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "超级飞廉站立" --防御
-- 		pgs[6] =  "超级飞廉站立" --站立
-- 		pgs[7] =  "超级飞廉施法" --施法
-- 		pgs[8] =  "超级飞廉行走" --跑动
-- 		pgs[9] =  "超级飞廉挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"
-- elseif pg == "自在心猿_普通" then---------
-- 		pgs[1] =  "自在心猿攻击"
-- 		pgs[2] =  "自在心猿攻击"--攻击B
-- 		pgs[3] =  "自在心猿死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "自在心猿站立" --防御
-- 		pgs[6] =  "自在心猿站立" --站立
-- 		pgs[7] =  "自在心猿施法" --施法
-- 		pgs[8] =  "自在心猿行走" --跑动
-- 		pgs[9] =  "自在心猿挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"

-- elseif pg == "进阶沙暴_普通" then---------
-- 		pgs[1] =  "进阶沙暴攻击"
-- 		pgs[2] =  "进阶沙暴攻击"--攻击B
-- 		pgs[3] =  "进阶沙暴死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "进阶沙暴站立" --防御
-- 		pgs[6] =  "进阶沙暴站立" --站立
-- 		pgs[7] =  "进阶沙暴施法" --施法
-- 		pgs[8] =  "进阶沙暴奔跑" --跑动
-- 		pgs[9] =  "进阶沙暴挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"
-- elseif pg == "超级红孩儿_普通" then---------
-- 		pgs[1] =  "红孩儿攻击"
-- 		pgs[2] =  "红孩儿攻击"--攻击B
-- 		pgs[3] =  "红孩儿死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "红孩儿站立" --防御
-- 		pgs[6] =  "红孩儿站立" --站立
-- 		pgs[7] =  "红孩儿施法" --施法
-- 		pgs[8] =  "红孩儿行走" --跑动
-- 		pgs[9] =  "红孩儿挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"
-- elseif pg == "超级神柚_普通" then---------
-- 		pgs[1] =  "超级神柚攻击"
-- 		pgs[2] =  "超级神柚攻击"--攻击B
-- 		pgs[3] =  "超级神柚死亡"--倒地  通用死亡 0x6DF00
-- 		pgs[4] =  "超级神柚站立" --防御
-- 		pgs[6] =  "超级神柚站立" --站立
-- 		pgs[7] =  "超级神柚施法" --施法
-- 		pgs[8] =  "超级神柚行走" --跑动
-- 		pgs[9] =  "超级神柚挨打" --挨揍
-- 		pgs[10] = "新宝宝.gpk"


-------------------------------------------------------------------战斗锦衣加载


	-- elseif pg == "碧华锦凝雪_剑侠客_普通" then
	-- 	pgs[4] = 0x00000005--防御
	-- 	pgs[9] = 0x00000005--受伤
	-- 	pgs[8] = 0x00000004--跑
	-- 	pgs[1] = 0x00000002--普通攻击
	-- 	pgs[2] = 0x00000006--施法攻击
	-- 	pgs[7] = 0x00000006--施法
	-- 	pgs[3] = 0x00000005--死亡
	-- 	pgs[6] = 0x00000005--静立
	-- 	pgs[10] = "实验锦衣.wdf"

	-- elseif pg == "碧华锦凝雪_剑侠客_剑" then
	-- 	pgs[4] = 0x00000005--防御
	-- 	pgs[9] = 0x00000005--受伤
	-- 	pgs[8] = 0x00000004--跑
	-- 	pgs[1] = 0x00000002--普通攻击
	-- 	pgs[2] = 0x00000006--施法攻击
	-- 	pgs[7] = 0x00000006--施法
	-- 	pgs[3] = 0x00000005--死亡
	-- 	pgs[6] = 0x00000005--静立
	-- 	pgs[10] = "实验锦衣.wdf"


	-- elseif pg == "碧华锦凝雪_剑侠客_刀" then
	-- 	pgs[4] = 0x00000005--防御
	-- 	pgs[9] = 0x00000005--受伤
	-- 	pgs[8] = 0x00000004--跑
	-- 	pgs[1] = 0x00000002--普通攻击
	-- 	pgs[2] = 0x00000006--施法攻击
	-- 	pgs[7] = 0x00000006--施法
	-- 	pgs[3] = 0x00000005--死亡
	-- 	pgs[6] = 0x00000005--静立
	-- 	pgs[10] = "实验锦衣.wdf"














------------------------------------------------------神武宠物

	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
--########################################################?自己修改?##########################################
	end

	 -- if pgs[10]==nil and pgs[1]==nil then
	 -- 	pgs[1] = 0x474B1237
	 -- 	pgs[2] = 0xC33B0F39
	 -- 	pgs[10] = "普通模型.wdf"
	 -- end

	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	return pgs
end





function 引擎.取武器锦衣素材(名称,模型,攻击)
	local pgs = {}
	local 锦衣资源=新加战斗锦衣[名称]..模型代码[模型]
	pgs[1] = tonumber("0x"..锦衣资源.."a1")--普通攻击
	pgs[2] = tonumber("0x"..锦衣资源.."b1")--施法攻击
	pgs[3] = tonumber("0x"..锦衣资源.."c0")
	pgs[4] = tonumber("0x"..锦衣资源.."d0")
	pgs[5] = "qtjy.wdf"
	if 攻击~=nil and 攻击 == 2 then
	 	  pgs[1] =tonumber("0x"..锦衣资源.."a2")
		  pgs[2] =tonumber("0x"..锦衣资源.."b2")
		 if 模型 == "羽灵神" or 模型 == "桃夭夭" or 模型 == "鬼潇潇" or 模型 == "巫蛮儿" or 模型 == "偃无师" or 模型 == "杀破狼" then
	            pgs[3] =tonumber("0x"..锦衣资源.."c2")
			    pgs[4] =tonumber("0x"..锦衣资源.."d2")
		 elseif 模型 == "逍遥生" then
		        pgs[3] =tonumber("0x"..锦衣资源.."c2")
		 end
	else

		  if 模型 == "羽灵神" or 模型 == "桃夭夭" or 模型 == "鬼潇潇" or 模型 == "巫蛮儿" or 模型 == "偃无师" or 模型 == "杀破狼" then
		     pgs[3] =tonumber("0x"..锦衣资源.."c1")
			 pgs[4] =tonumber("0x"..锦衣资源.."d1")
		  elseif 模型 == "逍遥生" then
			 pgs[3] = tonumber("0x"..锦衣资源.."c1")
		  end
	end
  return pgs
end





function 引擎.取战斗锦衣素材(名称,造型)
	local pgs = {}
	if 名称=="青春" then
		if 造型 == "英女侠" then
			pgs[1] = 0x00000070--普通攻击
			pgs[2] = 0x00000002--施法攻击
			pgs[3] = 0x00000003--站立
			pgs[4] = 0x00000001--行动
			pgs[5] = "锦衣修复.wdf"
		 elseif 造型 == "羽灵神" then
		 	pgs[1] = 0x00000004--普通攻击
			pgs[2] = 0x00000006--施法攻击
			pgs[3] = 0x00000007--站立
			pgs[4] = 0x00000005--行动
			pgs[5] = "锦衣修复.wdf"
		 elseif 造型 == "剑侠客" then
		 	pgs[1] = 0x00000008--普通攻击
			pgs[2] = 0x00000010--施法攻击
			pgs[3] = 0x00000011--站立
			pgs[4] = 0x00000009--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "飞燕女" then
		 	pgs[1] = 0x00000012--普通攻击
			pgs[2] = 0x00000014--施法攻击
			pgs[3] = 0x00000015--站立
			pgs[4] = 0x00000013--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "骨精灵" or 造型 == "影精灵" then
		 	pgs[1] = 0x00000016--普通攻击
			pgs[2] = 0x00000018--施法攻击
			pgs[3] = 0x00000019--站立
			pgs[4] = 0x00000017--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "鬼潇潇" then
		 	pgs[1] = 0x00000020--普通攻击
			pgs[2] = 0x00000022--施法攻击
			pgs[3] = 0x00000023--站立
			pgs[4] = 0x00000021--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "狐美人" then
		 	pgs[1] = 0x00000024--普通攻击
			pgs[2] = 0x00000026--施法攻击
			pgs[3] = 0x00000027--站立
			pgs[4] = 0x00000025--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "虎头怪" then
		 	pgs[1] = 0x00000028--普通攻击
			pgs[2] = 0x00000030--施法攻击
			pgs[3] = 0x00000031--站立
			pgs[4] = 0x00000029--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "巨魔王" then
		 	pgs[1] = 0x00000033--普通攻击
			pgs[2] = 0x00000035--施法攻击
			pgs[3] = 0x00000037--站立
			pgs[4] = 0x00000034--行动
			pgs[5] = "锦衣修复.wdf"
			pgs[6] = 0x00000032--挨打
			pgs[7] = 0x00000036--死亡
		elseif 造型 == "龙太子" then
		 	pgs[1] = 0x00000038--普通攻击
			pgs[2] = 0x00000040--施法攻击
			pgs[3] = 0x00000041--站立
			pgs[4] = 0x00000039--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "神天兵" then
		 	pgs[1] = 0x00000042--普通攻击
			pgs[2] = 0x00000044--施法攻击
			pgs[3] = 0x00000045--站立
			pgs[4] = 0x00000043--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "桃夭夭" then
		 	pgs[1] = 0x00000046--普通攻击
			pgs[2] = 0x00000048--施法攻击
			pgs[3] = 0x00000049--站立
			pgs[4] = 0x00000047--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "巫蛮儿" then
		 	pgs[1] = 0x00000050--普通攻击
			pgs[2] = 0x00000052--施法攻击
			pgs[3] = 0x00000053--站立
			pgs[4] = 0x00000051--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "舞天姬" then
		 	pgs[1] = 0x00000054--普通攻击
			pgs[2] = 0x00000056--施法攻击
			pgs[3] = 0x00000057--站立
			pgs[4] = 0x00000055--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "逍遥生" then
		 	pgs[1] = 0x00000058--普通攻击
			pgs[2] = 0x00000060--施法攻击
			pgs[3] = 0x00000061--站立
			pgs[4] = 0x00000059--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "玄彩娥" then
		 	pgs[1] = 0x00000062--普通攻击
			pgs[2] = 0x00000064--施法攻击
			pgs[3] = 0x00000065--站立
			pgs[4] = 0x00000063--行动
			pgs[5] = "锦衣修复.wdf"
		elseif 造型 == "偃无师" then
		 	pgs[1] = 0x00000066--普通攻击
			pgs[2] = 0x00000068--施法攻击
			pgs[3] = 0x00000069--站立
			pgs[4] = 0x00000067--行动
			pgs[5] = "锦衣修复.wdf"
	    elseif 造型 == "杀破狼" then
		 	pgs[1] = 0x00000085--普通攻击
			pgs[2] = 0x00000084--施法攻击
			pgs[3] = 0x00000083--站立
			pgs[4] = 0x00000086--行动
			pgs[5] = "锦衣修复.wdf"
        end
   elseif 名称=="素颜" then
     	if 造型 == "逍遥生" or 造型 == "剑侠客" or  造型 == "杀破狼" or  造型 == "巨魔王" or  造型 == "虎头怪" or
     	 造型 == "羽灵神"  or 造型 == "神天兵" or 造型 == "龙太子" or  造型 == "偃无师"then
     		pgs[1] = 0x00000074--普通攻击
			pgs[2] = 0x00000072--施法攻击
			pgs[3] = 0x00000071--站立
			pgs[4] = 0x00000073--行动
			pgs[5] = "锦衣修复.wdf"
		else
			pgs[1] = 0x00000078--普通攻击
			pgs[2] = 0x00000076--施法攻击
			pgs[3] = 0x00000075--站立
			pgs[4] = 0x00000077--行动
			pgs[5] = "锦衣修复.wdf"
        end
     elseif 名称=="绝色" then
     	    pgs[1] = 0x00000082--普通攻击
			pgs[2] = 0x00000080--施法攻击
			pgs[3] = 0x00000079--站立
			pgs[4] = 0x00000081--行动
			pgs[5] = "锦衣修复.wdf"
     elseif 名称=="春秋" then
     	    pgs[1] = 0x00000088--普通攻击
			pgs[2] = 0x00000090--施法攻击
			pgs[3] = 0x00000091--站立
			pgs[4] = 0x00000089--行动
			pgs[5] = "锦衣修复.wdf"
	 elseif 名称=="夏蚕" then
	 	    if 造型 == "英女侠" or 造型 == "飞燕女" or 造型 == "舞天姬" or 造型 == "玄彩娥" or 造型 == "巫蛮儿" then
	 	        pgs[1] = 0x00000092--普通攻击
				pgs[2] = 0x00000094--施法攻击
				pgs[3] = 0x00000095--站立
				pgs[4] = 0x00000093--行动
				pgs[5] = "锦衣修复.wdf"
		    elseif 造型 == "骨精灵" or 造型 == "影精灵" or 造型 == "桃夭夭" or 造型 == "鬼潇潇" or 造型 == "狐美人" then
		        pgs[1] = 0x00000096--普通攻击
				pgs[2] = 0x00000097--施法攻击
				pgs[3] = 0x00000098--站立
				pgs[4] = 0x00000099--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "虎头怪" then
		        pgs[1] = 0x00000101--普通攻击
				pgs[2] = 0x00000102--施法攻击
				pgs[3] = 0x00000103--站立
				pgs[4] = 0x00000100--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "杀破狼" or  造型 == "巨魔王"  or 造型 == "神天兵" then
		        pgs[1] = 0x00000104--普通攻击
				pgs[2] = 0x00000106--施法攻击
				pgs[3] = 0x00000107--站立
				pgs[4] = 0x00000105--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "逍遥生" or 造型 == "剑侠客"  then
				pgs[1] = 0x00000108--普通攻击
				pgs[2] = 0x00000110--施法攻击
				pgs[3] = 0x00000111--站立
				pgs[4] = 0x00000109--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "羽灵神"   or 造型 == "龙太子" or  造型 == "偃无师"then
	     	    pgs[1] = 0x00000112--普通攻击
				pgs[2] = 0x00000114--施法攻击
				pgs[3] = 0x00000087--站立
				pgs[4] = 0x00000113--行动
				pgs[5] = "锦衣修复.wdf"
			end
	  elseif 名称=="星河" then
	  	    if 造型 == "神天兵" then
		        pgs[1] = 0x00000134--普通攻击
				pgs[2] = 0x00000136--施法攻击
				pgs[3] = 0x00000135--站立
				pgs[4] = 0x00000115--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "羽灵神"   or 造型 == "龙太子" or  造型 == "杀破狼"then
	     	    pgs[1] = 0x00000116--普通攻击
				pgs[2] = 0x00000118--施法攻击
				pgs[3] = 0x00000119--站立
				pgs[4] = 0x00000117--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "逍遥生" or 造型 == "剑侠客" or 造型 == "巨魔王" then
				pgs[1] = 0x00000172--普通攻击
				pgs[2] = 0x00000138--施法攻击
				pgs[3] = 0x00000139--站立
				pgs[4] = 0x00000137--行动
				pgs[5] = "锦衣修复.wdf"
			elseif 造型 == "偃无师"  then
				pgs[1] = 0x00000128--普通攻击
				pgs[2] = 0x00000129--施法攻击
				pgs[3] = 0x00000130--站立
				pgs[4] = 0x00000132--行动
				pgs[5] = "锦衣修复.wdf"
				pgs[6] = 0x00000131--挨打
		    	pgs[7] = 0x00000133--死亡
			elseif 造型 == "虎头怪" then
		        pgs[1] = 0x00000144--普通攻击
				pgs[2] = 0x00000146--施法攻击
				pgs[3] = 0x00000147--站立
				pgs[4] = 0x00000145--行动
				pgs[5] = "锦衣修复.wdf"
			else
				pgs[1] = 0x00000124--普通攻击
				pgs[2] = 0x00000126--施法攻击
				pgs[3] = 0x00000127--站立
				pgs[4] = 0x00000125--行动
				pgs[5] = "锦衣修复.wdf"
			end
	   elseif 名称=="白峨" then
	   	        pgs[1] = 0x00000140--普通攻击
				pgs[2] = 0x00000142--施法攻击
				pgs[3] = 0x00000143--站立
				pgs[4] = 0x00000141--行动
				pgs[5] = "锦衣修复.wdf"
       elseif 名称=="糖果" then
       	      if 造型 == "逍遥生" or 造型 == "剑侠客" or  造型 == "杀破狼" or  造型 == "巨魔王" or  造型 == "虎头怪" or
     	         造型 == "羽灵神"  or 造型 == "神天兵" or 造型 == "龙太子" or  造型 == "偃无师"then
	   	         pgs[1] = 0x00000149--普通攻击
				 pgs[2] = 0x00000150--施法攻击
				 pgs[3] = 0x00000151--站立
				 pgs[4] = 0x00000148--行动
				 pgs[5] = "锦衣修复.wdf"
			  else
			  	 pgs[1] = 0x00000164--普通攻击
				 pgs[2] = 0x00000166--施法攻击
				 pgs[3] = 0x00000167--站立
				 pgs[4] = 0x00000165--行动
				 pgs[5] = "锦衣修复.wdf"
			  end
       elseif 名称=="青涩" then
	   	        pgs[1] = 0x00000152--普通攻击
				pgs[2] = 0x00000154--施法攻击
				pgs[3] = 0x00000155--站立
				pgs[4] = 0x00000153--行动
				pgs[5] = "锦衣修复.wdf"
        elseif 名称=="傲然" then
        	    pgs[1] = 0x00000156--普通攻击
				pgs[2] = 0x00000158--施法攻击
				pgs[3] = 0x00000159--站立
				pgs[4] = 0x00000157--行动
				pgs[5] = "锦衣修复.wdf"
	    elseif 名称=="牛仔" then
        	    pgs[1] = 0x00000160--普通攻击
				pgs[2] = 0x00000162--施法攻击
				pgs[3] = 0x00000163--站立
				pgs[4] = 0x00000161--行动
				pgs[5] = "锦衣修复.wdf"
		elseif 名称=="试剑" then
        	    pgs[1] = 0x00000168--普通攻击
				pgs[2] = 0x00000170--施法攻击
				pgs[3] = 0x00000171--站立
				pgs[4] = 0x00000169--行动
				pgs[5] = "锦衣修复.wdf"

        elseif 名称=="骨龙战骑" then
        	   pgs[1] = 0x10000026--普通攻击
			   pgs[2] = 0x10000027--施法攻击
			   pgs[3] = 0x10000028--站立
			   pgs[4] = 0x10000029--行动
			   pgs[5] = "房屋图标.wdf"
        elseif 名称=="水嘟嘟·钻白" then
        	   pgs[1] = 0x6DACE3C3--普通攻击
			   pgs[2] = 0x6DACE3C4--施法攻击
			   pgs[3] = 0x6DACE3C1--站立
			   pgs[4] = 0x6DACE3C2--行动
			   pgs[5] = "房屋图标.wdf"
    elseif 名称=="斗战神" then
		if 造型 == "英女侠" then
			pgs[1] = 0x00000063--普通攻击
			pgs[2] = 0x00000065--施法攻击
			pgs[3] = 0x00000066--站立
			pgs[4] = 0x00000064--行动
			pgs[5] = "jjyy.wdf"
		 elseif 造型 == "羽灵神" then
		 	pgs[1] = 0x00000067--普通攻击
			pgs[2] = 0x00000069--施法攻击
			pgs[3] = 0x00000070--站立
			pgs[4] = 0x00000068--行动
			pgs[5] = "jjyy.wdf"
		 elseif 造型 == "剑侠客" then
		 	pgs[1] = 0x00000018--普通攻击
			pgs[2] = 0x00000020--施法攻击
			pgs[3] = 0x00000021--站立
			pgs[4] = 0x00000019--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "飞燕女" then
		 	pgs[1] = 0x00000071--普通攻击
			pgs[2] = 0x00000073--施法攻击
			pgs[3] = 0x00000001--站立
			pgs[4] = 0x00000072--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "骨精灵" or 造型 == "影精灵" then
		 	pgs[1] = 0x00000002--普通攻击
			pgs[2] = 0x00000004--施法攻击
			pgs[3] = 0x00000005--站立
			pgs[4] = 0x00000003--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "鬼潇潇" then
		 	pgs[1] = 0x00000006--普通攻击
			pgs[2] = 0x00000008--施法攻击
			pgs[3] = 0x00000023--站立
			pgs[4] = 0x00000009--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "狐美人" then
		 	pgs[1] = 0x00000010--普通攻击
			pgs[2] = 0x00000012--施法攻击
			pgs[3] = 0x00000013--站立
			pgs[4] = 0x00000011--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "虎头怪" then
		 	pgs[1] = 0x00000014--普通攻击
			pgs[2] = 0x00000016--施法攻击
			pgs[3] = 0x00000017--站立
			pgs[4] = 0x00000015--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "巨魔王" then
		 	pgs[1] = 0x00000022--普通攻击
			pgs[2] = 0x00000024--施法攻击
			pgs[3] = 0x00000025--站立
			pgs[4] = 0x00000023--行动
			pgs[5] = "jjyy.wdf"
			pgs[6] = 0x00000032--挨打
			pgs[7] = 0x00000036--死亡
		elseif 造型 == "龙太子" then
		 	pgs[1] = 0x00000026--普通攻击
			pgs[2] = 0x00000028--施法攻击
			pgs[3] = 0x00000029--站立
			pgs[4] = 0x00000027--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "神天兵" then
		 	pgs[1] = 0x00000034--普通攻击
			pgs[2] = 0x00000036--施法攻击
			pgs[3] = 0x00000037--站立
			pgs[4] = 0x00000035--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "桃夭夭" then
		 	pgs[1] = 0x00000039--普通攻击
			pgs[2] = 0x00000041--施法攻击
			pgs[3] = 0x00000042--站立
			pgs[4] = 0x00000040--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "巫蛮儿" then
		 	pgs[1] = 0x00000043--普通攻击
			pgs[2] = 0x00000045--施法攻击
			pgs[3] = 0x00000046--站立
			pgs[4] = 0x00000044--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "舞天姬" then
		 	pgs[1] = 0x00000047--普通攻击
			pgs[2] = 0x00000049--施法攻击
			pgs[3] = 0x00000050--站立
			pgs[4] = 0x00000048--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "逍遥生" then
		 	pgs[1] = 0x00000051--普通攻击
			pgs[2] = 0x00000053 --施法攻击
			pgs[3] = 0x00000054--站立
			pgs[4] = 0x00000052--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "玄彩娥" then
		 	pgs[1] = 0x00000055--普通攻击
			pgs[2] = 0x00000057--施法攻击
			pgs[3] = 0x00000058--站立
			pgs[4] = 0x00000056--行动
			pgs[5] = "jjyy.wdf"
		elseif 造型 == "偃无师" then
		 	pgs[1] = 0x00000059--普通攻击
			pgs[2] = 0x00000061--施法攻击
			pgs[3] = 0x00000062--站立
			pgs[4] = 0x00000060--行动
			pgs[5] = "jjyy.wdf"
	    elseif 造型 == "杀破狼" then
		 	pgs[1] = 0x00000030--普通攻击
			pgs[2] = 0x00000032--施法攻击
			pgs[3] = 0x00000033--站立
			pgs[4] = 0x00000031--行动
			pgs[5] = "jjyy.wdf"
        end
    elseif 名称=="斗战胜佛" then
	  	    pgs[5] = "悟空.wdf"
		  	if 造型 == "逍遥生" or 造型 == "剑侠客" or  造型 == "杀破狼" or  造型 == "巨魔王" or  造型 == "虎头怪" or
	     	   造型 == "羽灵神"  or 造型 == "神天兵" or 造型 == "龙太子" or  造型 == "偃无师"then
		  	   pgs[1] = 0x10110000 --普通攻击
			   pgs[2] = 0x10120000--施法攻击
			   pgs[3] = 0x10130000--站立
			   pgs[4] = 0x10140000--行动
			else
	           pgs[1] = 0x12120000 --普通攻击
			   pgs[2] = 0x11120000--施法攻击
			   pgs[3] = 0x12130000--站立
			   pgs[4] = 0x12140000--行动
		    end

    elseif 名称=="八部天龙马·玄" then
	  	    pgs[5] = "sys1.wdf"
		  	if   造型 == "巨魔王" then
		  	   pgs[1] = 0XA164B009 --普通攻击
			   pgs[2] = 0XA164B010--施法攻击
			   pgs[3] = 0XA164B012--站立
			   pgs[4] = 0XA164B011--行动
			elseif 造型 == "虎头怪" then
	           pgs[1] = 0XA164B005 --普通攻击
			   pgs[2] = 0XA164B006--施法攻击
			   pgs[3] = 0XA164B008--站立
			   pgs[4] = 0XA164B007--行动
			elseif 造型 == "剑侠客" or 造型 == "龙太子" or  造型 == "杀破狼" or 造型 == "神天兵" or 造型 == "逍遥生"  or  造型 == "偃无师"  or
	     	       造型 == "羽灵神" then
	           pgs[1] = 0XA164B013 --普通攻击
			   pgs[2] = 0XA164B014--施法攻击
			   pgs[3] = 0XA164B016--站立
			   pgs[4] = 0XA164B015--行动
	     	else
	     	   pgs[1] = 0XA164B003 --普通攻击
			   pgs[2] = 0XA164B004--施法攻击
			   pgs[3] = 0XA164B001--站立
			   pgs[4] = 0XA164B002--行动
		    end

    elseif 名称=="龙凰·桃" then
	  	    pgs[5] = "sys1.wdf"
		  	if   造型 == "飞燕女" then
		  	   pgs[1] = 0XA164B083 --普通攻击
			   pgs[2] = 0XA164B084--施法攻击
			   pgs[3] = 0XA164B085--站立
			   pgs[4] = 0XA164B085--行动
			elseif 造型 == "骨精灵" then
	           pgs[1] = 0XA164B071 --普通攻击
			   pgs[2] = 0XA164B072--施法攻击
			   pgs[3] = 0XA164B073--站立
			   pgs[4] = 0XA164B073--行动
			elseif 造型 == "鬼潇潇"  then
	           pgs[1] = 0XA164B074 --普通攻击
			   pgs[2] = 0XA164B075--施法攻击
			   pgs[3] = 0XA164B076--站立
			   pgs[4] = 0XA164B076--行动
			elseif 造型 == "狐美人"  then
	           pgs[1] = 0XA164B077 --普通攻击
			   pgs[2] = 0XA164B078--施法攻击
			   pgs[3] = 0XA164B079--站立
			   pgs[4] = 0XA164B079--行动
			elseif 造型 == "虎头怪"  then
	           pgs[1] = 0XA164B080 --普通攻击
			   pgs[2] = 0XA164B081--施法攻击
			   pgs[3] = 0XA164B082--站立
			   pgs[4] = 0XA164B082--行动
			elseif 造型 == "剑侠客"  then
	           pgs[1] = 0XA164B086 --普通攻击
			   pgs[2] = 0XA164B087--施法攻击
			   pgs[3] = 0XA164B088--站立
			   pgs[4] = 0XA164B088--行动
			elseif 造型 == "巨魔王"  then
	           pgs[1] = 0XA164B089 --普通攻击
			   pgs[2] = 0XA164B090--施法攻击
			   pgs[3] = 0XA164B091--站立
			   pgs[4] = 0XA164B091--行动
			elseif 造型 == "龙太子"  then
	           pgs[1] = 0XA164B092 --普通攻击
			   pgs[2] = 0XA164B090--施法攻击
			   pgs[3] = 0XA164B094--站立
			   pgs[4] = 0XA164B094--行动
			elseif 造型 == "杀破狼"  then
	           pgs[1] = 0XA164B095 --普通攻击
			   pgs[2] = 0XA164B096--施法攻击
			   pgs[3] = 0XA164B097--站立
			   pgs[4] = 0XA164B097--行动
			elseif 造型 == "神天兵"  then
	           pgs[1] = 0XA164B098 --普通攻击
			   pgs[2] = 0XA164B099--施法攻击
			   pgs[3] = 0XA164B100--站立
			   pgs[4] = 0XA164B100--行动
			elseif 造型 == "桃夭夭"  then
	           pgs[1] = 0XA164B101 --普通攻击
			   pgs[2] = 0XA164B102--施法攻击
			   pgs[3] = 0XA164B103--站立
			   pgs[4] = 0XA164B103--行动
			elseif 造型 == "巫蛮儿"  then
	           pgs[1] = 0XA164B104 --普通攻击
			   pgs[2] = 0XA164B105--施法攻击
			   pgs[3] = 0XA164B106--站立
			   pgs[4] = 0XA164B106--行动
			elseif 造型 == "舞天姬"  then
	           pgs[1] = 0XA164B107 --普通攻击
			   pgs[2] = 0XA164B108--施法攻击
			   pgs[3] = 0XA164B109--站立
			   pgs[4] = 0XA164B109--行动
			elseif 造型 == "逍遥生"  then
	           pgs[1] = 0XA164B110 --普通攻击
			   pgs[2] = 0XA164B111--施法攻击
			   pgs[3] = 0XA164B112--站立
			   pgs[4] = 0XA164B112--行动
			elseif 造型 == "玄彩娥"  then
	           pgs[1] = 0XA164B113 --普通攻击
			   pgs[2] = 0XA164B114--施法攻击
			   pgs[3] = 0XA164B115--站立
			   pgs[4] = 0XA164B115--行动
			elseif 造型 == "偃无师"  then
	           pgs[1] = 0XA164B116 --普通攻击
			   pgs[2] = 0XA164B117--施法攻击
			   pgs[3] = 0XA164B118--站立
			   pgs[4] = 0XA164B118--行动
			elseif 造型 == "英女侠"  then
	           pgs[1] = 0XA164B119 --普通攻击
			   pgs[2] = 0XA164B120--施法攻击
			   pgs[3] = 0XA164B121--站立
			   pgs[4] = 0XA164B121--行动

		    elseif 造型 == "影精灵"  then
	           pgs[1] = 0XA164B071 --普通攻击
			   pgs[2] = 0XA164B120--施法攻击
			   pgs[3] = 0XA164B073--站立
			   pgs[4] = 0XA164B073--行动
		    elseif 造型 == "羽灵神"  then
	           pgs[1] = 0XA164B122 --普通攻击
			   pgs[2] = 0XA164B123--施法攻击
			   pgs[3] = 0XA164B124--站立
			   pgs[4] = 0XA164B124--行动
	     	else
	     	   pgs[1] = 0XA164B003 --普通攻击
			   pgs[2] = 0XA164B072--施法攻击
			   pgs[3] = 0XA164B001--站立
			   pgs[4] = 0XA164B002--行动
		    end


elseif 名称=="龙凰·皑" then
	  	    pgs[5] = "sys1.wdf"
		  	if   造型 == "飞燕女" then
		  	   pgs[1] = 0XA164B017 --普通攻击
			   pgs[2] = 0XA164B018--施法攻击
			   pgs[3] = 0XA164B019--站立
			   pgs[4] = 0XA164B019--行动
			elseif 造型 == "骨精灵" or 造型 == "影精灵" then
	           pgs[1] = 0XA164B020 --普通攻击
			   pgs[2] = 0XA164B018--施法攻击
			   pgs[3] = 0XA164B022--站立
			   pgs[4] = 0XA164B022--行动
			elseif 造型 == "鬼潇潇"  then
	           pgs[1] = 0XA164B023 --普通攻击
			   pgs[2] = 0XA164B024--施法攻击
			   pgs[3] = 0XA164B025--站立
			   pgs[4] = 0XA164B025--行动
			elseif 造型 == "狐美人"  then
	           pgs[1] = 0XA164B026 --普通攻击
			   pgs[2] = 0XA164B027--施法攻击
			   pgs[3] = 0XA164B028--站立
			   pgs[4] = 0XA164B028--行动
			elseif 造型 == "虎头怪"  then
	           pgs[1] = 0XA164B029 --普通攻击
			   pgs[2] = 0XA164B030--施法攻击
			   pgs[3] = 0XA164B031--站立
			   pgs[4] = 0XA164B031--行动

			elseif 造型 == "剑侠客"  then
	           pgs[1] = 0XA164B032 --普通攻击
			   pgs[2] = 0XA164B033--施法攻击
			   pgs[3] = 0XA164B034--站立
			   pgs[4] = 0XA164B034--行动
			elseif 造型 == "巨魔王"  then
	           pgs[1] = 0XA164B035 --普通攻击
			   pgs[2] = 0XA164B036--施法攻击
			   pgs[3] = 0XA164B037--站立
			   pgs[4] = 0XA164B037--行动
			elseif 造型 == "龙太子"  then
	           pgs[1] = 0XA164B038 --普通攻击
			   pgs[2] = 0XA164B039--施法攻击
			   pgs[3] = 0XA164B040--站立
			   pgs[4] = 0XA164B040--行动
			elseif 造型 == "杀破狼"  then
	           pgs[1] = 0XA164B041 --普通攻击
			   pgs[2] = 0XA164B042--施法攻击
			   pgs[3] = 0XA164B043--站立
			   pgs[4] = 0XA164B043--行动
			elseif 造型 == "神天兵"  then
	           pgs[1] = 0XA164B044 --普通攻击
			   pgs[2] = 0XA164B045--施法攻击
			   pgs[3] = 0XA164B046--站立
			   pgs[4] = 0XA164B046--行动
			elseif 造型 == "桃夭夭"  then
	           pgs[1] = 0XA164B047 --普通攻击
			   pgs[2] = 0XA164B048--施法攻击
			   pgs[3] = 0XA164B049--站立
			   pgs[4] = 0XA164B049--行动
			elseif 造型 == "巫蛮儿"  then
	           pgs[1] = 0XA164B050 --普通攻击
			   pgs[2] = 0XA164B051--施法攻击
			   pgs[3] = 0XA164B052--站立
			   pgs[4] = 0XA164B052--行动
			elseif 造型 == "舞天姬"  then
	           pgs[1] = 0XA164B053 --普通攻击
			   pgs[2] = 0XA164B054--施法攻击
			   pgs[3] = 0XA164B055--站立
			   pgs[4] = 0XA164B055--行动
			elseif 造型 == "逍遥生"  then
	           pgs[1] = 0XA164B056 --普通攻击
			   pgs[2] = 0XA164B057--施法攻击
			   pgs[3] = 0XA164B058--站立
			   pgs[4] = 0XA164B058--行动
			elseif 造型 == "玄彩娥"  then
	           pgs[1] = 0XA164B059 --普通攻击
			   pgs[2] = 0XA164B060--施法攻击
			   pgs[3] = 0XA164B061--站立
			   pgs[4] = 0XA164B061--行动
			elseif 造型 == "偃无师"  then
	           pgs[1] = 0XA164B062 --普通攻击
			   pgs[2] = 0XA164B063--施法攻击
			   pgs[3] = 0XA164B064--站立
			   pgs[4] = 0XA164B064--行动
			elseif 造型 == "英女侠"  then
	           pgs[1] = 0XA164B065 --普通攻击
			   pgs[2] = 0XA164B066--施法攻击
			   pgs[3] = 0XA164B067--站立
			   pgs[4] = 0XA164B067--行动

		    elseif 造型 == "羽灵神"  then
	           pgs[1] = 0XA164B067 --普通攻击
			   pgs[2] = 0XA164B069--施法攻击
			   pgs[3] = 0XA164B070--站立
			   pgs[4] = 0XA164B070--行动
	     	else
	     	   pgs[1] = 0XA164B003 --普通攻击
			   pgs[2] = 0XA164B072--施法攻击
			   pgs[3] = 0XA164B001--站立
			   pgs[4] = 0XA164B002--行动
		    end







	    end
	return pgs
end




































