function 引擎.取技能(jn)
	local jns = {}
	if jn == "灵性" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3949490866
		jns[8] = 3143201775
	elseif jn == "金刚伏魔" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2566898861
		jns[8] = 3862994147
	elseif jn == "失忆符" then
		jns[1] = "令对手一定回合无法使用特技"
		jns[3] = 4
		jns[4] = "55点魔法"
		jns[5] = "符之术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562829683
		jns[8] = 2704552245
	elseif jn == "龙腾" then
		jns[1] = "施展法术攻击对方单人"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "龙腾术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2093346600
		jns[8] = 3650312562
	elseif jn == "高级慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 242180125
		jns[8] = 4174265955
	elseif jn == "混天术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3643496130
		jns[8] = 481805567
	elseif jn == "龙腾术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3471484278
		jns[8] = 2151837087
	elseif jn == "驱尸" then
		jns[1] = "解除各类中毒状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "周易学技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1226417381
		jns[8] = 546827248
	elseif jn == "水攻" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 85059369
		jns[8] = 2415441344
	elseif jn == "尸腐毒" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*4+自身力量的20%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 49094427
		jns[8] = 2328293467
	elseif jn == "闭月羞花" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3321056507
		jns[8] = 4213596062
	elseif jn == "无敌牛虱" then
		jns[1] = "召唤牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "40点魔法"
		jns[5] = "牛虱阵技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3889342201
		jns[8] = 901977927
	elseif jn == "百毒不侵" then
		jns[1] = "解毒并在一定回合内避免中毒"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "玉质冰肌技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 45388430
		jns[8] = 938983833
	elseif jn == "养生之道" then
		jns[1] = "修身养性固本清元之术\n学习可以增加活力上限"
		jns[3] = 80
		jns[6] = "物品图标.wdf"
		jns[7] = 968832765
		jns[8] = 1635371623
	elseif jn == "乘风破浪" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "游龙术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 90073709
		jns[8] = 3228417140
	elseif jn == "烟雨剑法" then
		jns[1] = "使用后可以连续攻击对手两次"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "潇湘仙雨技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3124546025
		jns[8] = 3643055813
	elseif jn == "定心术" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "阴阳二气诀技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3988224797
		jns[8] = 99592343
	elseif jn == "百万神兵" then
		jns[1] = "令对方无法使用物理攻击"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "混天术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3140668291
		jns[8] = 4284468319
	elseif jn == "神兵护法" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "神道无念技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1217133207
		jns[8] = 3100160960

	elseif jn == "巨岩破" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到12级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3218559640
		jns[8] = 3817801025
	elseif jn == "乾坤塔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 646614501
		jns[8] = 3014813769
	elseif jn == "轻如鸿毛" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "香飘兰麝技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 33492847
		jns[8] = 367093981
	elseif jn == "灵通术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 695584869
		jns[8] = 577240546
	elseif jn == "魔王回首" then
		jns[1] = "使用后可以在受到物理攻击的时候自动反击"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "回身击技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 995890213
		jns[8] = 3043919056
	elseif jn == "飘渺式" then
		jns[1] = "物理攻击对方多个目标"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "潇湘仙雨技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3268745174
		jns[8] = 3398385178
	elseif jn == "达摩护体" then
		jns[1] = "战斗中临时提高自己或队友的气血上限\n#Y血气数值=目标等级*3.5+目标灵力的20%"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415107827
		jns[8] = 3131800459
	-- elseif jn == "高级法术抵抗" then
	-- 	jns[1] = "减少10%所受的法术伤害，但同时物理伤害能力减少10%。"
	-- 	jns[3] = 7
	-- 	jns[6] = "物品图标.wdf"
	-- 	jns[7] = 3908900845
	-- 	jns[8] = 3908900845
	elseif jn == "高级反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1907422702
		jns[8] = 511662384
	elseif jn == "灵动九天" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*4"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "人物飞升且“金刚经”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2299324564
		jns[8] = 1921901005
	elseif jn == "迷情大法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2410267095
		jns[8] = 3102396352
	elseif jn == "紧箍咒" then------------
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续伤害\n#Y伤害数值=技能等级+20+法伤*0.1"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "观音咒技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1573115441
		jns[8] = 956876360
	elseif jn == "苍茫树" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到13级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1228860567
		jns[8] = 2355974251
	elseif jn == "周易学" then
		jns[1] = "按技能等级提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 951717916
		jns[8] = 3182787390
	elseif jn == "五行学说" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3646722626
		jns[8] = 733606302
	elseif jn == "诵经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1921499236
		jns[8] = 3515981629
	elseif jn == "离魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降速度\n#Y降低速度数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "磐龙灭法技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 30806
		jns[8] = 3355342391
	elseif jn == "五雷轰顶" then
		jns[1] = "对目标造成法术伤害\n#P技能使用成功:\n#Y造成目标当前血量的25%伤害\n#P技能使用失败:\n#Y造成目标当前血量的5%伤害\n#S数值不会超过(技能等级*50)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4236045895
		jns[8] = 1825724039
	elseif jn == "六道轮回" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2191025103
		jns[8] = 1761343362
	elseif jn == "九幽阴魂" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2427286393
		jns[8] = 2803361004
	elseif jn == "佛门普渡" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "渡世步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2996697873
		jns[8] = 3423122163
	elseif jn == "傲世诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3001127144
		jns[8] = 1049195070
	elseif jn == "天神护体" then
		jns[1] = "战斗中增加队友和自己的法伤\n#Y法伤数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2173852985
		jns[8] = 4200916921
	elseif jn == "镇妖" then
		jns[1] = "使用它后可以降低怪物的伤害\n#Y伤害数值=技能等级*3"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "乾坤塔技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2821624851
		jns[8] = 251203682
	elseif jn == "生死搏" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3136073986
		jns[8] = 1362791032
	elseif jn == "天罗地网" then
		jns[1] = "固定伤害攻击多目标\n有几率使目标:\n无法使用普通攻击和降低目标速度\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1+敏捷*0.2\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "30点魔法*人数"
		jns[5] = "盘丝步技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1653509465
		jns[8] = 1457394081
	elseif jn == "天神护法" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*2"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "天罡气技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 4053425914
		jns[8] = 3750198819
	elseif jn == "乾天罡气" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y附加治疗能力:等级*2+自身法伤的10%"
		jns[3] = 5
		jns[4] = "等级*2+自身法伤的10%的气血"
		jns[6] = "物品图标.wdf"
		jns[7] = 3309202999
		jns[8] = 2018341630
	elseif jn == "高级防御" then
		jns[1] = "进入战斗后会提高16%的物理防御，但法术伤害能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1616189465
		jns[8] = 3783015310
	elseif jn == "否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能(精神集中,神迹等技能会失效)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3345212313
		jns[8] = 3002471686
	elseif jn == "盘丝阵" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2395356970
		jns[8] = 1769215086
	elseif jn == "无敌牛妖" then
		jns[1] = "召唤使用法术的牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“牛虱阵”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 526953932
		jns[8] = 2771934779
	elseif jn == "法术暴击" then
		jns[1] = "法术攻击时的暴击几率增加10%，出现暴击时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1389982585
		jns[8] = 1108386617
	elseif jn == "尸气漫天" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "拘魂诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3830562709
		jns[8] = 3540479557
	elseif jn == "雷霆万钧" then
		jns[1] = "攻击性法术，使用后攻击对方多个目标"
		jns[3] = 4
		jns[4] = "35点魔法×作用人数"
		jns[5] = "人物飞升且“天罡气”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1167105764
		jns[8] = 2063612274
	elseif jn == "佛法无边" then
		jns[1] = "使目标施展某些攻击性法术时一定几率出现连续两次攻击（不包括需停回合的法术及群体攻击性法术，如横扫千军、鹰击、后发制人、连环击）"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“金刚伏魔”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2286663605
		jns[8] = 3100187427
	elseif jn == "移形换影" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "清歌妙舞技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "情天恨海" then
		jns[1] = "克制五庄观弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "沉鱼落雁技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1898550998
		jns[8] = 2472450541
	elseif jn == "自在心法" then
		jns[1] = "清除己方队员身上普渡众生效果，同时将该回合剩余回合可增加的当前气血与气血上限结算进行回复。"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "灵性技能达到60级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1199130784
		jns[8] = 3420028880
	elseif jn == "高级偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震，物理攻击效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4012815828
		jns[8] = 1555617599
	elseif jn == "阴阳二气诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 683331190
		jns[8] = 4236173132
	elseif jn == "佛光普照" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341
		jns[8] = 921854792
	elseif jn == "飞砂走石" then
		jns[1] = "使用后可以攻击对方多个对象\n#Y技能附带5%法暴几率"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "火云术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 706133968
		jns[8] = 746568918
	elseif jn == "呼风唤雨" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 438165716
		jns[8] = 1919875705
	elseif jn == "修罗隐身" then
		jns[1] = "战斗中隐藏自己或队友的身形\n令对手无法攻击\n隐身状态下不能施展法术\n#Y该技能夜晚不能使用"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 557290721
		jns[8] = 3076118166
	elseif jn == "天地同寿" then
		jns[1] = "为友方和自己加上一个状态\n吸收全部法术伤害\n但目标降低50%防御\n且所受物理伤害会加倍"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4224047219
		jns[8] = 3294906395
	elseif jn == "倾国倾城" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 594113044
		jns[8] = 3862994147
	elseif jn == "莲华妙法" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "金刚经技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4050867699
		jns[8] = 2277699794
	elseif jn == "游龙术" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1730135660
		jns[8] = 316450658
	elseif jn == "潇湘仙雨" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3541032788
		jns[8] = 2723035390
	elseif jn == "日月乾坤" then
		jns[1] = "令对手一定回合内无法行动\n法术,特技,物攻都无法使用"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "乾坤袖技能达到20级，不能用在某些特殊任务的战斗中使用成功"
		jns[6] = "物品图标.wdf"
		jns[7] = 3902929414
		jns[8] = 3489253938
	elseif jn == "高级冥思" then
		jns[1] = "战斗中每回合自动恢复(自身等级二分之一)的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1718714912
		jns[8] = 2174943999
	elseif jn == "追魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1021060099
		jns[8] = 2404071232
	elseif jn == "唧唧歪歪" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人\n#Y该技能额外有自身50%的灵力加成"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "诵经技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1856916618
		jns[8] = 2374732908
	elseif jn == "歧黄之术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2055755507
		jns[8] = 93243227
	elseif jn == "金刚护体" then
		jns[1] = "战斗中临时提高自己或队友的防御力\n#Y防御数值=技能等级*2"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1377178114
		jns[8] = 3453377621
	elseif jn == "训兽诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1184160039
		jns[8] = 3128610907
	elseif jn == "龙吟" then
		jns[1] = "减少对方全体队员一定的气血和魔法值\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害"
		jns[3] = 4
		jns[4] = "300点魔法"
		jns[5] = "龙附技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1318499395
		jns[8] = 2137943042
	elseif jn == "裂石步" then
		jns[1] = "按技能等级提高躲避"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4286232830
		jns[8] = 3339537828
	elseif jn == "杨柳甘露" then
		jns[1] = "使用后可以复活已经死亡的队友\n可以复活处在\n“锢魂术”或者“死亡召唤”状态下\n剩余回合小于等于2的队友\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数。"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "观音咒技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3757213330
		jns[8] = 794491517
	elseif jn == "香飘兰麝" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3531606030
		jns[8] = 1383632532
	elseif jn == "判官令" then
		jns[1] = "固定伤害攻击单目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1+力量*0.1\n#G暗器加成:\n#G暗器等级%10百分比\n#Y天黑状态提高伤害+技能等级*1.5"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "拘魂诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1671969153
		jns[8] = 3702239149
	elseif jn == "救死扶伤" then
		jns[1] = "战斗中恢复多人气血以及伤势\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数"
		jns[3] = 5
		jns[4] = "50点魔法*人数"
		jns[5] = "歧黄之术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265
	elseif jn == "舍身取义" then
		jns[1] = "将目标当前气血恢复到满"
		jns[3] = 5
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“歧黄之术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265
	elseif jn == "龙附术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3715378746
		jns[8] = 3758617445
	elseif jn == "神龙摆尾" then
		jns[1] = "持续一定回合的防御性法术，拥有该效果时施法者防御和法防提高30%"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[5] = "人物飞升且“破浪诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562612473
		jns[8] = 2539345287
	elseif jn == "健身术" then
		jns[1] = "由华佗所创的五禽戏发展而来\n学习可以增加体力上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3589295296
		jns[8] = 3157390677
	elseif jn == "变身" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*2.5"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4282403049
		jns[8] = 3667711762
    elseif jn == "爪印特效" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*2"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4282403049
		jns[8] = 3667711762
	elseif jn == "莲花宝座" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 37911440
		jns[8] = 2202511971
	elseif jn == "天雷斩" then
		jns[1] = "使用后可以给予多个敌人重击"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "傲世诀技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 315619009
		jns[8] = 958381035
	elseif jn == "驱魔" then
		jns[1] = "解除并避免方寸山封类法术的影响"
		jns[3] = 6
		jns[4] = "45点魔法"
		jns[5] = "周易学技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1284415330
		jns[8] = 656352481
	elseif jn == "掌心雷" then
		jns[1] = "使用它后可以使对手不能使用主动法宝。效果可与其他封系效果叠加。成功几率等同封印成功率，受法术攻击修炼影响"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 763772202
		jns[8] = 1576485465
	elseif jn == "五行错位" then
		jns[1] = "克制女儿村弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "五行扭转技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 322760356
		jns[8] = 3739244200
	elseif jn == "失心符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1506622772
		jns[8] = 3407760722
	elseif jn == "斩龙诀" then
		jns[1] = "克制龙宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "紫薇之术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 40028053
		jns[8] = 1152390271
	elseif jn == "强力" then
		jns[1] = "进入战斗后伤害增加5%，如果对方有防御或高级防御技能，伤害结果会减少20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1458903425
		jns[8] = 707555275
	elseif jn == "如花解语" then
		jns[1] = "令对手一定回合无法使用普通攻击"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "闭月羞花技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1912374008
		jns[8] = 1283470548
	elseif jn == "拈花妙指" then
		jns[1] = "打造后为鞋子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "佛光普照技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 177955034
		jns[8] = 2841407500
	elseif jn == "复苏" then
		jns[1] = "解除并避免天宫封类法术的影响"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 141266175
		jns[8] = 2870523056
	elseif jn == "凝神术" then
		jns[1] = "10回合内增加15%自身的封系命中几率"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "归元心法技能达到100级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3869803971
		jns[8] = 3077203266
	elseif jn == "含情脉脉" then
		jns[1] = "令对手一定回合内概率\n无法使用物理和法术攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4111305818
		jns[8] = 2589491420
	elseif jn == "龙卷雨击" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "25点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "冥思" then
		jns[1] = "战斗中每回合自动恢复(自身等级四分之一)的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 622128415
		jns[8] = 3554832714
	elseif jn == "催眠符" then
		jns[1] = "令对手在受到伤害前无法行动"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "符之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3523869082
		jns[8] = 104771547
	elseif jn == "高级雷属性吸收" then
		jns[1] = "50%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1654409054
		jns[8] = 119787649
	elseif jn == "雷属性吸收" then
		jns[1] = "20%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA71D860C
		jns[8] = 0xA71D860C
	elseif jn == "分身术" then
		jns[1] = "在一场回合内里\n闪避每回合受到的首次攻击\n持续3回合"
		jns[3] = 66
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“神道无念”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "姊妹相随" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3177731283
		jns[8] = 597142503
	elseif jn == "云霄步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 276418186
		jns[8] = 3893284871
	elseif jn == "奔雷咒" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2858620755
		jns[8] = 3666293224
	elseif jn == "玉质冰肌" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3438751351
		jns[8] = 2264853140
	elseif jn == "高级法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动(50%-140%)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2322584044
		jns[8] = 3668919080
	elseif jn == "地裂火" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到14级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4132171079
		jns[8] = 75104423
	elseif jn == "狂兽诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1661790658
		jns[8] = 2338433754
	elseif jn == "我佛慈悲" then
		jns[1] = "可以复活死亡的队友\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数。"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "大慈大悲技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1545297145
		jns[8] = 266298194
	elseif jn == "破釜沉舟" then
		jns[1] = "同时攻击对方四个目标"
		jns[3] = 4
		jns[4] = "消耗上限气血的10%"
		jns[5] = "人物飞升且“十方无敌”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1580308746
		jns[8] = 619017033
	elseif jn == "金刚护法" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害数值=技能等级*2.5"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 479962043
		jns[8] = 3700736796
	elseif jn == "莲步轻舞" then
		jns[1] = "令对手一定回合无法使用法术攻击"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3508375370
		jns[8] = 4243867972
	elseif jn == "三星灭魔" then
		jns[1] = "克制魔王寨弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "黄庭经技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1209970630
		jns[8] = 84450076
	elseif jn == "十方无敌" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1137925403
		jns[8] = 4107877611
	elseif jn == "解毒" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "歧黄之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1966642136
		jns[8] = 546423120
	elseif jn == "摄魄" then
		jns[1] = "减少对方一定的魔法\n从而恢复自身魔法\n#Y数值=技能等级*2+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941
		jns[8] = 103370656
	elseif jn == "修仙术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3726980014
		jns[8] = 1673560698
	elseif jn == "幽冥鬼眼" then
		jns[1] = "使用后可以看到隐身的目标\n#Y并增加抵抗封印等级100点"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "九幽阴魂技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1975607386
		jns[8] = 2807639015
	elseif jn == "高级再生" then
		jns[1] = "每回合恢复自身等级×3的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 468221024
		jns[8] = 3809634425
	elseif jn == "振翅千里" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "大鹏展翅技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3512079122
		jns[8] = 4160807473
	elseif jn == "逆鳞" then
		jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "逆鳞技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1493556934
		jns[8] = 3804853170

  --   elseif jn == "龙骇龙腾" then
		-- jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		-- jns[3] = 5
		-- jns[4] = "40点魔法"
		-- jns[5] = "逆鳞技能达到30级"
		-- jns[6] = "物品图标.wdf"
		-- jns[7] = 1493556934
		-- jns[8] = 3804853170
	elseif jn == "浩然正气" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3449922467
		jns[8] = 567769462
	elseif jn == "天诛地灭" then
		jns[1] = "克制地府弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "天罡气技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB3C8279C
		jns[8] = 3701201548
	elseif jn == "火云术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4166858964
		jns[8] = 909252202
	elseif jn == "永恒" then
		jns[1] = "受到治疗效果提高30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1988160424
		jns[8] = 1508625069
	elseif jn == "雨落寒沙" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "作用人数*20点魔法"
		jns[5] = "沉鱼落雁技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2465624576
		jns[8] = 562574867
	elseif jn == "高级吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的30%，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1364867245
		jns[8] = 2545117654
	elseif jn == "碎甲符" then
		jns[1] = "降低3个目标的防御和灵力\n#Y数值=自身等级*4"
		jns[3] = 4
		jns[4] = "50点魔法*目标数"
		jns[5] = "人物飞升且“磐龙灭法”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 417555669
		jns[8] = 3175526110
	elseif jn == "安神诀" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y伤害加成=技能等级*2.5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3150617611
		jns[8] = 2204689180
	elseif jn == "无双一击" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2203124248
		jns[8] = 2998720398
	elseif jn == "淬灵之术" then
		jns[1] = "学习后可以打造响应等级灵饰"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 1296624794
		jns[8] = 1296624794
	elseif jn == "兵器谱" then
		jns[1] = "能够鉴定武器和铠甲，学习后也可在长安书店制作相应等级的“神兵图鉴”"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "神兵鉴赏技能等级达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1814276494
		jns[8] = 4262913816
	elseif jn == "清明自在" then
		jns[1] = "按技能等级提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3231066014
		jns[8] = 3842629365
	elseif jn == "水漫金山" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2637597442
		jns[8] = 3867686033

	elseif jn == "超级三昧真火" then
		jns[1] = "对敌方单个目标造成法术伤害。"
		jns[3] = 4
        jns[6] = "xbb.wdf"
		jns[7] = 0x8C425920
		jns[8] = 0x8C425920
	elseif jn == "追捕技巧" then
		jns[1] = "可以降低对手逃跑的成功率\n但最低不小于10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 123566127
		jns[8] = 902425300
	elseif jn == "逃离技巧" then
		jns[1] = "学习后可以提高战斗逃跑的成功率\n但最高不超过90%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1198324882
		jns[8] = 1820394508
	elseif jn == "烹饪技巧" then
		jns[1] = "传自商代名厨伊尹的技能\n可以提高制作食物的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2019196942
		jns[8] = 3782401606
	elseif jn == "中药医理" then
		jns[1] = "精通歧黄之术往往\n可以提高炼制丹药的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3878607199
		jns[8] = 642378453
	elseif jn == "沉鱼落雁" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 370722733
		jns[8] = 1052773261
	elseif jn == "紫薇之术" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3941011754
		jns[8] = 1942519774
	elseif jn == "炼金术" then
		jns[1] = "秘术士私传的炼金之术\n可以提高制作饰品、靴子和腰带的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768

	elseif jn == "攻击修炼" then
		jns[1] = "可以提升角色攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "防御修炼" then
		jns[1] = "可以提升角色防御效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法术修炼" then
		jns[1] = "可以提升角色法术攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法抗修炼" then
		jns[1] = "可以提升角色法术防御效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "满天花雨" then
		jns[1] = "对目标造成单体物理攻击\n使用后增加自己的10%攻击力\n并有30%几率使对手#Y中毒\n(#Z该中毒没特效但有效果#)\n#Y攻击力加成可以叠加三层\n#Y可获得最高20%攻击力加成\n#Y持续到战斗结束"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "沉鱼落雁技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2270504354
		jns[8] = 1714354841
	elseif jn == "符之术" then
		jns[1] = "无效果"
		jns[3] = 1
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341
		jns[8] = 921854792
	-- elseif jn == "舍身取义" then
	-- 	jns[1] = "将目标当前气血恢复到满"
	-- 	jns[3] = 3
	-- 	jns[4] = "150点魔法，且每次使用时会降低自身5%物理防御及3%灵力"
	-- 	jns[5] = "人物飞升且“歧黄之术”技能达到120级 "
	-- 	jns[6] = "物品图标.wdf"
	-- 	jns[7] = 1135928864
	-- 	jns[8] = 1707332905
	elseif jn == "剑荡四方" then
		jns[1] = "使用时可攻击多人。指定的目标受到一定伤害，并造成其他任意两个目标少量伤害。"
		jns[3] = 4
		jns[4] = "当前气血的百分之十"
		jns[6] = "物品图标.wdf"
		jns[7] = 1668746823
		jns[8] = 1668746823
	elseif jn == "金刚镯" then
		jns[1] = "大幅提升自己的伤害力\n#Y数值=伤害+自身等级*2.5"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“混天术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4185507078
		jns[8] = 1737815847
	elseif jn == "裁缝技巧" then
		jns[1] = "从天衣无缝针法演化而来\n可提高缝制头盔和铠甲的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1071853506
		jns[8] = 1758794729
	elseif jn == "落岩" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4226735508
		jns[8] = 300977089
	elseif jn == "生命之泉" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数。"
		jns[3] = 3
		jns[4] = "作用人数*30点魔法"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1093047199
		jns[8] = 2757069702
	elseif jn == "韦陀护法" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y法伤数值=技能等级*1.5"
		jns[3] = 3
		jns[4] = "35点魔法"
		jns[5] = "佛光普照技能等级达到20级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2121060262
		jns[8] = 2888289425
	elseif jn == "暗器技巧" then
		jns[1] = "暗器名家的家传秘笈\n学习后可以增加使用暗器的伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2101102727
		jns[8] = 1473796032
	elseif jn == "冥想" then
		jns[1] = "通过冥想凝聚强大的精神力量\n学习可以提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 97139368
		jns[8] = 903007607
	elseif jn == "弱点土" then
		jns[1] = "弱点为土，受到土属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2234852568
		jns[8] = 910396241
	elseif jn == "冤魂不散" then
		jns[1] = "克制大唐官府弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "九幽阴魂技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3587078621
		jns[8] = 376661686
    elseif jn == "神速" then
		jns[1] = "神速习武之人的根本，学习后可以提高1.5点人物基础速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 440987942
		jns[8] = 3473412458
  elseif jn == "人物伤害" then
    jns[1] = "每级提升人物6点伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000006
    jns[8] = 0x00000006
  elseif jn == "人物防御" then
    jns[1] = "每级提升人物3点防御"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000003
    jns[8] = 0x00000003
  elseif jn == "人物气血" then
    jns[1] = "每级提升人物10点气血"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000009
    jns[8] = 0x00000009
  elseif jn == "人物法术" then
    jns[1] = "每级提升人物8点法伤,4点法防"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000008
    jns[8] = 0x00000008
  elseif jn == "人物固伤" then
    jns[1] = "每级提升人物6点固定伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000007
    jns[8] = 0x00000007
  elseif jn == "人物速度" then
    jns[1] = "每级提升人物3点速度"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000011
    jns[8] = 0x00000011
  elseif jn == "人物治疗" then
    jns[1] = "每级提升人物3点治疗能力"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000005
    jns[8] = 0x00000005

  elseif jn == "宠物伤害" then
    jns[1] = "每级提升召唤兽8点伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000004
    jns[8] = 0x00000004
  elseif jn == "宠物防御" then
    jns[1] = "每级提升召唤兽6点防御"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000001
    jns[8] = 0x00000001
  elseif jn == "宠物气血" then
    jns[1] = "每级提升召唤兽45点气血"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000002
    jns[8] = 0x00000002
  elseif jn == "宠物灵力" then
    jns[1] = "每级提升召唤兽4点灵力"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000005
    jns[8] = 0x00000005
  elseif jn == "宠物速度" then
    jns[1] = "每级提升召唤兽4点速度"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000011
    jns[8] = 0x00000011



	elseif jn == "强身术" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533
		jns[8] = 732966867
	elseif jn == "强壮" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高10点人物基础气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2458245611
		jns[8] = 1870892091
	elseif jn == "敏捷" then
		jns[1] = "提高自身速度的10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3132756451
		jns[8] = 4289478506
	elseif jn == "盘丝舞" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "蛛丝阵法技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2082714040
		jns[8] = 382164728
	elseif jn == "火属性吸收" then
		jns[1] = "20%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4098020456
		jns[8] = 4092454521
	elseif jn == "落魄符" then
		jns[1] = "令对手一定回合内无法使用法术攻击\n并出现攻击偏差"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "符之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1553239295
		jns[8] = 2036240644

	elseif jn == "泰山压顶" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 463605150
		jns[8] = 463605150
	elseif jn == "观音咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1410587972
		jns[8] = 1911562650
	elseif jn == "牛虱阵" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1129585606
		jns[8] = 2492840335
	elseif jn == "杀气诀" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害加成=技能等级*2"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "为官之道技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1673396685
		jns[8] = 1326507976
	elseif jn == "高级毒" then
		jns[1] = "自身对毒免疫，物理攻击时有30%的几率使敌人中毒，中毒后每回合减少等级*2+对方1%的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 589320553
		jns[8] = 1086230366
	elseif jn == "高级反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击的伤害与正常攻击相同"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3922527672
		jns[8] = 3922527672
	elseif jn == "解封" then
		jns[1] = "单次解除女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "60点魔法"
		jns[5] = "九龙诀技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2555181368
		jns[8] = 1807191850
	elseif jn == "高级神迹" then
		jns[1] = "不受除日月乾坤外的所有异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 705701591
		jns[8] = 4235295997
	elseif jn == "火甲术" then
		jns[1] = "此状态维持期间遭受普通物理攻击、法术时将自动使用三味真火进行反击。"
		jns[3] = 66
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“火云术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2418820008
		jns[8] = 3223806685
	elseif jn == "地狱烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4223394612
		jns[8] = 3042874244
	elseif jn == "高级飞行" then
		jns[1] = "进入战斗后,伤害和法伤提高5%,但防御和法防降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4277341965
		jns[8] = 3853120636
	elseif jn == "龙啸九天" then
		jns[1] = "克制盘丝洞弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "龙附技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3644673853
		jns[8] = 2124753589
	elseif jn == "高级强力" then
		jns[1] = "进入战斗后伤害增加10%，如果对方有防御或高级防御技能，伤害结果会减少10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3563500497
		jns[8] = 2177485118
	elseif jn == "乙木仙遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "斜月步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 71432172
		jns[8] = 436091648
	elseif jn == "魔兽啸天" then
		jns[1] = "克制天宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "魔兽神功技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 950759216
		jns[8] = 1124928283
	elseif jn == "夺命蛛丝" then
		jns[1] = "克制方寸山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "蛛丝阵法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 227632678
		jns[8] = 3268216546
	elseif jn == "腾云驾雾" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "云霄步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1924869232
		jns[8] = 906709372
	elseif jn == "弱点水" then
		jns[1] = "弱点为水，受到水属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 803997825
		jns[8] = 1114088245
	elseif jn == "慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的75%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1457451798
		jns[8] = 3365576412
	elseif jn == "摇头摆尾" then
		jns[1] = "攻击目标时有70%几率触发飞砂走石\n30%几率触发多目标三昧真火\n(最多5个目标)\n触发飞沙走石时有20%几率给对方\n留下灼烧效果\n每回合减少固定血量!"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“牛虱阵”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3051115375
		jns[8] = 1777991632
	elseif jn == "高级鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2436724533
		jns[8] = 3547941491
	elseif jn == "高级驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法术伤害效果加倍，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 72429538
		jns[8] = 72429538
	elseif jn == "幻镜术" then
		jns[1] = "自身有40%的概率反弹法术攻击"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“盘丝步”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1134668132
		jns[8] = 605963427
	elseif jn == "高级幸运" then
		jns[1] = "被法术和物理暴击几率降低50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1781077356
		jns[8] = 481753720
	elseif jn == "高级法术暴击" then
		jns[1] = "法术攻击时的暴击几率增加20%，出现暴击时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2071863113
		jns[8] = 1628140681
	elseif jn == "瘴气" then
		jns[1] = "降低3个目标50%的被治疗效果\n持续4回合"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "人物飞升且“迷情大法”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3039047760
		jns[8] = 3862934535
	elseif jn == "高级魔之心" then
		jns[1] = "对敌人的法术伤害效果提高20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2586072698
		jns[8] = 2875710379
	elseif jn == "迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788
		jns[8] = 274661895
    elseif jn == "高级迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788
		jns[8] = 274661895



	elseif jn == "七星遁" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 923985229
		jns[8] = 2400021580
	elseif jn == "高级敏捷" then
		jns[1] = "提升自身速度的20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1248152147
		jns[8] = 2061355872
	elseif jn == "楚楚可怜" then
		jns[1] = "停止行动并保护自己免受伤害"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3842255938
		jns[8] = 952615752
	elseif jn == "精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，但自己的物理攻击效果也会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4141937856
		jns[8] = 2799682055
	elseif jn == "清心" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "九龙诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 22613468
		jns[8] = 3563353856
	elseif jn == "防御" then
		jns[1] = "进入战斗后会提高8%的物理防御，但法术伤害能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 91393867
		jns[8] = 4101692183
	elseif jn == "感知" then
		jns[1] = "可以破解地府的修罗隐身、女儿村的楚楚可怜法术效果"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3677043818
		jns[8] = 4012137980
	elseif jn == "高级龙魂" then
		jns[1] = "每成功使用三次法术都可以临时增加自身法术伤害,持续2回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00FFEF02
		jns[8] = 0x00FFEF02
	elseif jn == "魔兽反噬" then
		jns[1] = "按技能等级提高防御"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 512391647
		jns[8] = 1359532967
	elseif jn == "招架" then
		jns[1] = "受到物理基础伤害降低5%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2387844026
		jns[8] = 3512730332
	elseif jn == "弱点雷" then
		jns[1] = "弱点为雷，受到雷属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2886112942
		jns[8] = 2605672758
	elseif jn == "弱点火" then
		jns[1] = "弱点为火，受到火属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1546100078
		jns[8] = 4005696838
	elseif jn == "逆鳞术" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3104091414
		jns[8] = 3406230011
	elseif jn == "靛沧海" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到11级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2679663466
		jns[8] = 1783445565
	elseif jn == "苍鸾怒击" then
		jns[1] = "普通物理攻击发生必杀或连击时，临时提升10%伤害力随机攻击另一个目标，每回合最多触发一次。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3329378845
		jns[8] = 3329378845
  	elseif jn == "夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD5CEE60
		jns[8] = 0xEB2AF42F
   	elseif jn == "高级夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3E81ECFB
		jns[8] = 0x3E81ECFB

	elseif jn == "驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD5CEE60
		jns[8] = 0xEB2AF42F
	elseif jn == "高级驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3E81ECFB
		jns[8] = 0x3E81ECFB

	elseif jn == "天蚕丝" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "盘丝步技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1283246148
		jns[8] = 1806917376
	elseif jn == "乾坤袖" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2256743052
		jns[8] = 3443276818
	elseif jn == "烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2966154175
		jns[8] = 1668132272
	elseif jn == "踏山裂石" then
		jns[1] = "克制化生寺弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "震天诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4060498152
		jns[8] = 2813097952
	elseif jn == "破浪诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4132491653
		jns[8] = 3313121721
	elseif jn == "高级土属性吸收" then
		jns[1] = "50%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2639364118
		jns[8] = 751839372
	elseif jn == "二龙戏珠" then
		jns[1] = "施展法术攻击对方两个目标"
		jns[3] = 4
		jns[4] = "70点魔法"
		jns[5] = "人物飞升且“九龙诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1266218218
		jns[8] = 630766288
	elseif jn == "太极生化" then
		jns[1] = "克制狮驼岭弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "修仙术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1665649019
		jns[8] = 1661704448
	elseif jn == "五雷咒" then
		jns[1] = "施展法术攻击对方单人\n#Y对鬼魂术、高级鬼魂术敌人伤害增加30%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "霹雳咒技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3103307429
		jns[8] = 1116134864
	elseif jn == "高级感知" then
		jns[1] = "破解地府的修罗隐身、女儿村的楚楚可怜法术效果，气血增加5%."
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 675296013
		jns[8] = 1822711583
	elseif jn == "高级水属性吸收" then
		jns[1] = "50%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2532360260
		jns[8] = 1312179231
	elseif jn == "须弥真言" then
		jns[1] = "增加魔力值*0.4的法术伤害力"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0XAABBDD8A
		jns[8] = 0XAABBDD8A
	elseif jn == "土属性吸收" then
		jns[1] = "20%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 134325226
		jns[8] = 3503123353
	elseif jn == "拘魂诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1622524729
		jns[8] = 3403104810
	elseif jn == "高级必杀" then
		jns[1] = "物理攻击时的必杀几率增加20%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1672890477
		jns[8] = 1282412196
	elseif jn == "从天而降" then
		jns[1] = "有几率对目标造成额外30%伤害"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8F
		jns[8] = 0xAABBDD8F
	elseif jn == "大快朵颐" then
		jns[1] = "超级神猴专属技能，出手前有一定几率触发，大大提升几率性技能（连击、必杀）的触发几率。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8E
		jns[8] = 0xAABBDD8E
	elseif jn == "千钧一怒" then
		jns[1] = "超级神羊专属技能，普通物理攻击造成的伤害≧目标气血伤害*10%时，使自己的主人获得10点愤怒。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8D
		jns[8] = 0xAABBDD8D
	elseif jn == "浮云神马" then
		jns[1] = "超级神马专属技能，在场时，提高自己及主人10%的速度，最多持续5回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8C
		jns[8] = 0xAABBDD8C
	elseif jn == "再生" then
		jns[1] = "每回合恢复自身等级×2的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287776911
		jns[8] = 2264480315
	elseif jn == "连击" then
		jns[1] = "45%的几率连续两次物理攻击，触发此技能物理攻击效果会降低20%，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1161065019
		jns[8] = 834880568
	elseif jn == "毒" then
		jns[1] = "自身对毒免疫，物理攻击时有15%的几率使敌人中毒，中毒后每回合减少等级*1.5+对方1%的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 142259178
		jns[8] = 3804526840
	elseif jn == "杳无音讯" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "无常步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2049632078
		jns[8] = 739072521
	elseif jn == "鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响，但也不能使用药品和食物恢复气血（可以食用包子）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813494718
		jns[8] = 4276424619
	elseif jn == "法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有大幅度的波动(50%-120%)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 762242741
		jns[8] = 267613400
	elseif jn == "坐莲" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10魔法"
		jns[5] = "莲花宝座技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2462764859
		jns[8] = 3850121742
	elseif jn == "后发制人" then
		jns[1] = "休息一回合后攻击指定目标\n休息期间:\n#Y提高自身防御=技能等级*3.5\n#Y法防自身降低=技能等级*0.4"
		jns[3] = 4
		jns[4] = "最大气血的5%"
		jns[5] = "无双一击技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3809037555
		jns[8] = 1112380505
	elseif jn == "阎罗令" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1+力量*0.2\n#G暗器加成:\n#G暗器等级%10百分比\n#Y天黑状态提高伤害+技能等级*1.5"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "幽冥术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2806354228
		jns[8] = 3446923388
	elseif jn == "魔之心" then
		jns[1] = "对敌人的法术伤害效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 718604442
		jns[8] = 2278038627
	elseif jn == "神佑复生" then
		jns[1] = "战斗死亡时有15%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1409514751
		jns[8] = 2943632069
	elseif jn == "偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震。攻击效果增加5%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3049408565
		jns[8] = 205675459
	elseif jn == "必杀" then
		jns[1] = "物理攻击时的必杀几率增加10%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3789166294
		jns[8] = 1107454372
	elseif jn == "驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法术伤害效果增加50%，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 416049958
		jns[8] = 2077703648
	elseif jn == "三昧真火" then
		jns[1] = "使用后可以攻击对方单个对象\n#Y技能附带10%法暴几率"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "火云术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 626159438
		jns[8] = 290397996
	elseif jn == "高级火属性吸收" then
		jns[1] = "50%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2898051336
		jns[8] = 1343324785
	elseif jn == "高级永恒" then
		jns[1] = "受到的治疗效果提高50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4168001168
		jns[8] = 3963828674
	elseif jn == "横扫千军" then
		jns[1] = "能连续攻击对方3次\n但使用后需休息一回合\n休息时不能使用战斗指令\n也不会受封类法术影响\n休息期间:\n#Y自身防御和法防降低10%"
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427
	elseif jn == "紫气东来" then
		jns[1] = "克制普陀山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "小乘佛法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3576748561
		jns[8] = 3918273363
	elseif jn == "炼气化神" then
		jns[1] = "一定回合内补充自己和队友的魔法\n#Y附加5%法伤数额,并按等级提升相应系数"
		jns[3] = 3
		jns[4] = "技能等级%2的气血"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2394667501
		jns[8] = 1686425132
	elseif jn == "毒经" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3161058590
		jns[8] = 1458078261
	elseif jn == "嗜血" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "文韬武略技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2341356120
		jns[8] = 831906636
	elseif jn == "推拿" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "歧黄之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 404486915
		jns[8] = 4289032145
	elseif jn == "火牛阵" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1917391753
		jns[8] = 1358009688
	elseif jn == "反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3941065708
		jns[8] = 3754360316
	elseif jn == "牛刀小试" then
		jns[1] = "初入江湖必备技能"
		jns[3] = 4
		jns[4] = "20魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3416022732
		jns[8] = 3416022732
	elseif jn == "一笑倾城" then
		jns[1] = "令多个目标一定回合无法使用法术"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“倾国倾城”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3266381545
		jns[8] = 522280593
	elseif jn == "穿云破空" then
		jns[1] = "为腰带附加提升物理攻击伤害结果的临时效果。"
		jns[3] = 9
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“啸傲”技能达到35级，人物等级达到30级。 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3294906395
		jns[8] = 3294906395
	elseif jn == "鹰击" then
		jns[1] = "攻击对方多人，使用后需要休息1回合"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "生死搏技能达到30级，不允许连续两回合使用"
		jns[6] = "物品图标.wdf"
		jns[7] = 3219722580
		jns[8] = 1443303401
	elseif jn == "娉婷袅娜" then
		jns[1] = "使对手一定回合无法使用装备特技"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 768000231
		jns[8] = 1404049159
	elseif jn == "高级招架" then
		jns[1] = "受到物理基础伤害降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 450878763
		jns[8] = 1018872745
	elseif jn == "幸运" then
		jns[1] = "被法术和物理暴击几率降低25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3640080474
		jns[8] = 1085801234
	elseif jn == "金刚经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2444843522
		jns[8] = 4122844852
	elseif jn == "霹雳咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 53930907
		jns[8] = 300592749
	elseif jn == "魂飞魄散" then
		jns[1] = "使用后驱散目标因门派法术获得的所有良性状态（变身除外）。 "
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "“六道轮回”技能达到50级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1594584941
		jns[8] = 2719875429
	elseif jn == "妙手回春" then
		jns[1] = "重复技能无效果,请用推气过宫"
		jns[3] = 6
		jns[4] = "无介绍"
		jns[5] = "歧黄之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 416089174
		jns[8] = 2939581056
	elseif jn == "堪察令" then
		jns[1] = "鉴定头盔、饰品、腰带、靴子等类装备，学习后也可在长安书店制作相应等级的“灵宝图鉴”。"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "灵通术技能达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4073909039
		jns[8] = 2150653771
	elseif jn == "渡世步" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2399184502
		jns[8] = 2261339260
	elseif jn == "姐妹同心" then
		jns[1] = "减少对方一定的魔法\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "姊妹相随技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 42398851
		jns[8] = 502149406
	elseif jn == "飞行" then
		jns[1] = "进入战斗后,伤害和法伤提高5%,但防御和法防降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813574344
		jns[8] = 1190813269
	elseif jn == "尸腐恶" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3997271777
		jns[8] = 22951667
	elseif jn == "天外魔音" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3819811307
		jns[8] = 2331712128
	elseif jn == "吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的25%, 如果对方有异常状态，吸血后会中毒，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 668285297
		jns[8] = 156592686
	elseif jn == "一气化三清" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "修仙术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4257500096
		jns[8] = 2501870432
	elseif jn == "乾坤妙法" then
		jns[1] = "保护队友和自己\n使其不受任何负面影响\n但也无法进行任何行动\n血量必须大于50%才能使用"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1736041428
		jns[8] = 3294906395
	elseif jn == "失魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "磐龙灭法技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2029120895
		jns[8] = 2414938178
	elseif jn == "护法金刚" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 223144262
		jns[8] = 84328029
	elseif jn == "定身符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "磐龙灭法技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 170590832
		jns[8] = 2539497909
	elseif jn == "颠倒五行" then
		jns[1] = "提高自身和队友50%的五行法术吸收几率\n并且受到法术伤害降低30%"
		jns[3] = 3
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“五行扭转”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1849998950
		jns[8] = 3616521026
	elseif jn == "回身击" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1224508814
		jns[8] = 2667913913
	elseif jn == "嗜血追击" then
		jns[1] = "普通物理攻击目标时，会有一定几率攻击另一个目标一次,打死目标必定触发该效果。此效果每回合只会触发一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287596045
		jns[8] = 3287596045
	elseif jn == "反间之计" then
		jns[1] = "令怪物处于混乱状态\n不能用于玩家对战"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "文韬武略技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 146786390
		jns[8] = 841319996
	elseif jn == "小乘佛法" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2925047058
		jns[8] = 1573500785
	elseif jn == "一苇渡江" then
		jns[1] = "战斗中临时提高自己或队友的速度\n#Y速度数值=技能等级*2.5"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2822966564
		jns[8] = 1136663058
	elseif jn == "九龙诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 140291603
		jns[8] = 923894374
	elseif jn == "活血" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数,使用后恢复一定伤势"
		jns[3] = 3
		jns[4] = "70点魔法"
		jns[5] = "歧黄之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2432822176
		jns[8] = 2865439591
	elseif jn == "疾风步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2104231936
		jns[8] = 552299472
	elseif jn == "错乱" then
		jns[1] = "令对手无法使用法术\n并在物理攻击时出现目标偏差"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3622268205
		jns[8] = 4290077259
	elseif jn == "兵解符" then
		jns[1] = "在战斗中立即传送回自己门派\n溜之大吉"
		jns[3] = 66
		jns[4] = "无消耗"
		jns[5] = "符之术技能等级达到10级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1268134129
		jns[8] = 2026082073
	elseif jn == "神兵鉴赏" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 743065692
		jns[8] = 4243999668
	elseif jn == "神力无穷" then
		jns[1] = "打造后为腰带提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "狂兽诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3809438015
		jns[8] = 3884615585
	elseif jn == "宁气诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1979452270
		jns[8] = 3573433154
	elseif jn == "还阳术" then
		jns[1] = "复活倒地的队友，提高攻击力，降低防御力"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“拘魂诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2874709055
		jns[8] = 485361049
	elseif jn == "文韬武略" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1708888521
		jns[8] = 3150772814
	elseif jn == "神道无念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1749937072
		jns[8] = 3852659463
	elseif jn == "牛逼神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3975126128
		jns[8] = 2741787302
	elseif jn == "极度疯狂" then
		jns[1] = "受到物理攻击时会自动反击敌人"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "魔兽反噬技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 363599535
		jns[8] = 2884919862
	elseif jn == "大慈大悲" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1267473253
		jns[8] = 3966881348
	elseif jn == "归元咒" then
		jns[1] = "消耗魔法值来补充自己的气血\n#Y附加治疗能力:等级*2+自身法伤的10%"
		jns[3] = 5
		jns[4] = "等级*2+自身法伤的10%点魔法"
		jns[5] = "归元心法技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2473529751
		jns[8] = 3090930843
	elseif jn == "普渡众生" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y附加自身法伤5%的治疗能力,按等级提升治疗能力系数。并恢复相应数额的伤势"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "金刚经技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 688650727
		jns[8] = 3407231441
	elseif jn == "混元道果" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 675093303
		jns[8] = 3799123064
	elseif jn == "飞花摘叶" then
		jns[1] = "吸取敌方多人魔法为我方队员所使用\n且敌方受到女儿村封印技能(除特技外一切行动)\n持续3回合\n封印命中几率提高5%"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“清歌妙舞”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4065673057
		jns[8] = 1962869359
	elseif jn == "秋波暗送" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1698608098
		jns[8] = 975668103
	elseif jn == "魔王护持" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "牛逼神功技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 937481251
		jns[8] = 3778438121
	elseif jn == "反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击伤害为正常伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2574462722
		jns[8] = 326702364
	elseif jn == "黄庭经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2680262225
		jns[8] = 1501050246
	elseif jn == "五行扭转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3256679059
		jns[8] = 3457635171
	elseif jn == "魔兽神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2952870578
		jns[8] = 10218458
	elseif jn == "大鹏展翅" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1243494819
		jns[8] = 2200620761
	elseif jn == "推气过宫" then
		jns[1] = "战斗中恢复多人气血\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数"
		jns[3] = 3
		jns[4] = "50点魔法*人数"
		jns[5] = "歧黄之术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 971215069
		jns[8] = 2227035198
	elseif jn == "归元心法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3444112895
		jns[8] = 2996031232
	elseif jn == "飞行符" then
		jns[1] = "学习后也可在长安书店制作飞行符"
		jns[3] = 0
		jns[4] = "消耗一定的体力"
		jns[5] = "符之术技能达到21级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1788221468
		jns[8] = 1798664293
	elseif jn == "蛛丝阵法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 487492946
		jns[8] = 2233726885
	elseif jn == "红袖添香" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 547746768
		jns[8] = 1757842178
	elseif jn == "连环击" then
		jns[1] = "疯狂地连续的攻击敌人"
		jns[3] = 4
		jns[4] = "可连击次数×30点魔法"
		jns[5] = "狂兽诀技能达到30级，使用后解除当前所有增益状态"
		jns[6] = "物品图标.wdf"
		jns[7] = 3608703815
		jns[8] = 673541382
	elseif jn == "高级连击" then
		jns[1] = "55%的几率连续两次物理攻击，触发此技能物理攻击效果会降低20%，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1321871887
		jns[8] = 3016140514
-----------------------------------------------------------------超级技能
	elseif jn == "超级夜战" then
		jns[1] = "造成物理伤害提高10%;夜间物理伤害效果不会减少，并提高躲避能力20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D90D
		jns[8] = 0xDC76D90D
	elseif jn == "超级驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加25%,有1%几率秒杀对手(每回合只会生效一次,该效果具有5回合冷却)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D90D
		jns[8] = 0xDC76D90D

	elseif jn == "超级反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击的伤害忽视敌方10%防御！"
	 	jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7624A7
		jns[8] = 0xDC7624A7
	elseif jn == "超级反震" then
		jns[1] = "受到物理攻击时：30%反震对方，反震伤害为你所受伤害的60%；避免被敌人连击；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC762440
		jns[8] = 0xDC762440
	elseif jn == "超级吸血" then
		jns[1] = "物理攻击时：吸取对方所掉气血的30%；并将获得的溢出气血的50%转化为护盾；攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76DCBA
		jns[8] = 0xDC76DCBA
    elseif jn == "超级连击" then
		jns[1] = "55%的几率连续两次物理攻击，触发连击时候有30%几率额外攻击一次,触发此技能物理攻击效果会降低20%，如果对方有反震技能，只能攻击一次"
		jns[3] = 7     --------------7魔兽要诀 4特殊魔兽要诀
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76BCA7
		jns[8] = 0xDC76BCA7
	elseif jn == "超级飞行" then
		jns[1] = "进入战斗后,伤害和法伤提高10%,不在降低防御和法伤"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7639D0
		jns[8] = 0xDC7639D0
	elseif jn == "超级隐身" then
		jns[1] = "进入战斗后，获得修罗隐身状态3~5回合；隐身时不会被攻击；物理攻击能力降低10%；受到的伤害也降低10%；隐身时不能施法；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761E7D
		jns[8] = 0xDC761E7D
    elseif jn == "超级感知" then
		jns[1] = "可攻击修罗隐身、楚楚可怜状态之敌；气血增加10%；在场时主人也获得“感知”持续5回合，"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76500A
		jns[8] = 0xDC76500A
 	elseif jn == "超级再生" then
		jns[1] = "每回合恢复自身等级×3的气血；有20%几率回复自身等级×12的气血；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76198A
		jns[8] = 0xDC76198A

 	elseif jn == "超级冥思" then                   ----------------------------没写
		jns[1] = "每回合恢复自身(自身等级二分之一)的魔法；在场时主人获得“冥思”持续5回合"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76446C
		jns[8] = 0xDC76446C
   elseif jn == "超级驱鬼" then
		jns[1] = "对有鬼魂术之敌，物理及法术伤害效果增加150%；可将鬼魂术之敌击飞，使其不能复活"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766D7D
		jns[8] = 0xDC766D7D
	elseif jn == "超级毒" then
		jns[1] = "自身对毒免疫；物理攻击后：30%几率使敌人中毒；中毒后每回合减少等级*2+对方1%的气血,且随机降低中毒目标的攻击、防御、法伤或法防；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761E00
		jns[8] = 0xDC761E00
    elseif jn == "超级慧根" then
	    jns[1] = "使用法术时所消耗的魔法降低为正常的50%，且有30%的几率不消耗魔法；"
	    jns[3] = 7
	    jns[6] = "超级技能.wdf"
	    jns[7] = 0xDC768B79
	    jns[8] = 0xDC768B79
   elseif jn == "超级必杀" then
		jns[1] = "物理攻击的必杀几率增加30%；且必杀时有25%的几率造成3-4倍的必杀伤害；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76E841
		jns[8] = 0xDC76E841
	elseif jn == "超级幸运" then
		jns[1] = "被法术和物理暴击几率降低50%；且有5%的概率免疫受到的攻击伤害"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D20B
		jns[8] = 0xDC76D20B
	elseif jn == "超级精神集中" then
		jns[1] = "可以抵御封类异常状态,法伤提高10%,但物理攻击能力会降低20%；受到的伤害随机降低1%~10%；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC768B81
		jns[8] = 0xDC768B81
    elseif jn == "超级神迹" then
		jns[1] = "不受所有异常状态影响，主人在场时,并且每回合结束时自动解除主人一种异常状态！"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC768163
		jns[8] = 0xDC768163
    elseif jn == "超级招架" then
		jns[1] = "受到物理基础伤害降低10%,每回合第一次受到物理基础伤害降低80%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76209C
		jns[8] = 0xDC76209C
    elseif jn == "超级永恒" then
		jns[1] = "受到的治疗效果提高100%"
		jns[3] = 7
		jns[4] = "全部魔法"
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76F083
		jns[8] = 0xDC76F083
   elseif jn == "超级敏捷" then
		jns[1] = "速度增加30%；5%概率额外重复一次攻击或施法；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7624AD
		jns[8] = 0xDC7624AD
   elseif jn == "超级否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受到所有伤害减少20%，提高15%所有伤害、受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能(精神集中,神迹等技能会失效)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766108
		jns[8] = 0xDC766108
   elseif jn == "超级魔之心" then
		jns[1] = "法术伤害效果提高30%；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76E70E
		jns[8] = 0xDC76E70E
	elseif jn == "超级偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震，物理攻击效果提高20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76859E
		jns[8] = 0xDC76859E


	elseif jn == "超级奔雷咒" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点雷两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76CCD7
		jns[8] = 0xDC76CCD7
	elseif jn == "超级泰山压顶" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点土两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76694D
		jns[8] = 0xDC76694D

	elseif jn == "超级水漫金山" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点水两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC765E1E
		jns[8] = 0xDC765E1E

	elseif jn == "超级地狱烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点火两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76282C
		jns[8] = 0xDC76282C
	elseif jn == "超级雷属性吸收" then
		jns[1] = "必定免受雷属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D794
		jns[8] = 0xDC76D794
	elseif jn == "超级土属性吸收" then
		jns[1] = "必定免受土属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC769194
		jns[8] = 0xDC769194
	elseif jn == "超级水属性吸收" then
		jns[1] = "必定免受水属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC765E94
		jns[8] = 0xDC765E94
	elseif jn == "超级火属性吸收" then
		jns[1] = "必定免受火属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76A094
		jns[8] = 0xDC76A094
   elseif jn == "超级强力" then  ----------没写完
		jns[1] = "进入战斗后伤害增加15%,攻击没有防御或高级防御的敌人有10%概率使敌人头晕：2回合内造成的伤害降低50%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC762FB6
		jns[8] = 0xDC762FB6
   elseif jn == "超级防御" then
		jns[1] = "进入战斗后会提高25%的物理防御"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC763029
		jns[8] = 0xDC763029
   elseif jn == "超级进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,第2回合及以后进入战斗时,提升50%的必杀几率持续5回合。"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068C9
		jns[8] = 0xF6A068C9
	elseif jn == "超级进击法暴" then
		jns[1] = "宠物技能必须有,法暴或者高级法暴的时候才能生效,第2回合及以后进入战斗时,提升50%的法暴几率持续5回合。"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76C8A7
		jns[8] = 0xDC76C8A7
    elseif jn == "超级法术连击" then
		jns[1] = "使用法术攻击目标时增加50%几率续2次攻击敌人,二次伤害降低20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761895
		jns[8] = 0xDC761895
   elseif jn == "超级法术暴击" then
		jns[1] = "法术攻击时的暴击几率增加30%，出现暴击时伤害结果会加倍,有15%的几率造成3-4倍的暴击伤害；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068C8
		jns[8] = 0xF6A068C8
	elseif jn == "超法连&超法暴" then
		jns[1] = "使用法术攻击目标时有50%概率同时触发超级法术连击和超级法术暴击效果，触发后必定连击和暴击"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068C8
		jns[8] = 0xF6A068C8
	elseif jn == "超级法术波动" then
		jns[1] =  "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动(80%-160%)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068D1
		jns[8] = 0xF6A068D1
	elseif jn == "超级壁垒击破" then
		jns[1] =  "发动物理攻击,该攻击忽视对方60%的防御。如果目标本回合防御，则会受到更大伤害。用此技能攻击时，会忽视“防御”,“高级防御”,“超级防御”技能产生的技能效果。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76EADD
		jns[8] = 0xDC76EADD
	elseif jn == "超级法术抵抗" then
		jns[1] =  "减少20%所受到的法术伤害；且进场时额外减少50%所受到的法术伤害，持续两回合；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068D2
		jns[8] = 0xF6A068D2
  	elseif jn == "超级盾气" then
		jns[1] = "进入战斗后，则提高其等级*3的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC763C58
		jns[8] = 0xDC763C58
   elseif jn == "超级合纵" then
		jns[1] = "当本方有1|2|3|4种与其不同的召唤兽，则提高4|8|12|16%物理伤害结果"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766F4D
		jns[8] = 0xDC766F4D

-------------------------------------------------------------------------------------------------------------
	elseif jn == "隐身" then
		jns[1] = "自动附加地府修罗隐身法术2～3回合，拥有此技能物理攻击能力会降低20%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1508147758
		jns[8] = 3007875758
	elseif jn == "高级隐身" then
		jns[1] = "自动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2491734238
		jns[8] = 2948130962
	elseif jn == "似玉生香" then
		jns[1] = "令对手一定回合不能法术和普通攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "闭月羞花技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2732466496
		jns[8] = 3524410344
	elseif jn == "斜月步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 769022309
		jns[8] = 2124205828
	elseif jn == "日光华" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2064123225
		jns[8] = 877019458
	elseif jn == "寡欲令" then
		jns[1] = "解除并避免盘丝洞封类法术的影响。"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "灵通术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 653757983
		jns[8] = 482656655
	elseif jn == "法术连击" then
		jns[1] = "使用法术攻击目标时增加15%几率续2次攻击敌人,二次伤害降低50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2200246844
		jns[8] = 345682085
	elseif jn == "黄泉之息" then
		jns[1] = "攻击对方单人，并减少10%的速度，夜间使用会增加50%的技能伤害"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“幽冥术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3536984715
		jns[8] = 1893059881
	elseif jn == "魔音摄魂" then
		jns[1] = "让敌方\n受到治疗效果降低100%\n持续4回合"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“天外魔音”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 32064057
		jns[8] = 1554838399
	elseif jn == "锢魂术" then
		jns[1] = "使用后有几率可使目标5个回合内\n在死亡状态下无法被复活"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "幽冥术技能达到75级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1727365486
		jns[8] = 784403165
	elseif jn == "牛屎遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "裂石步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2481624731
		jns[8] = 668274006
	elseif jn == "高级法术连击" then
		jns[1] = "使用法术攻击目标时增加30%几率续2次攻击敌人,二次伤害降低50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3484714916
		jns[8] = 1890987017
	elseif jn == "高级神佑复生" then
		jns[1] = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2040400078
		jns[8] = 3049938323
	elseif jn == "牛劲" then
		jns[1] = "战斗中暂时提高自己的法术伤害力\n#Y提升法伤数值=技能等级*3"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "火牛阵技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3521936089
		jns[8] = 1080213476
	elseif jn == "无常步" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2772099555
		jns[8] = 71871380
	elseif jn == "为官之道" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2338752455
		jns[8] = 2050205097
	elseif jn == "狮搏"  then
		jns[1] = "以高于平时的伤害力攻击对方单人"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "生死搏技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3700481839
		jns[8] = 1627374280
	elseif jn == "威慑" then
		jns[1] = "令怪物或玩家召唤兽无法行动\n不能对玩家使用"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "训兽诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 81423983
		jns[8] = 894640149
	elseif jn == "盘丝步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3406981495
		jns[8] = 337337940
	elseif jn == "磐龙灭法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 423192983
		jns[8] = 1962038233
	elseif jn == "清歌妙舞" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1027945253
		jns[8] = 2444515719
	elseif jn == "魔息术" then
		jns[1] = "一定回合内恢复自身的魔法 "
		jns[3] = 5
		jns[4] = "50点气血"
		jns[5] = "人物飞升且“阴阳二气诀”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3643037170
		jns[8] = 787252900
	elseif jn == "三花聚顶" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y(魔法=等级*2+自身法伤的10%)*0.5"
		jns[3] = 5
		jns[4] = "等级*2+自身法伤的10%的气血"
		jns[5] = "明性修身技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3813527840
		jns[8] = 3150915326
	elseif jn == "幽冥术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2105426613
		jns[8] = 414994835
	elseif jn == "龙附" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "龙附技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2888970157
		jns[8] = 1784954158
	elseif jn == "勾魂" then
		jns[1] = "减少对方一定的气血\n从而恢复自身气血\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941
		jns[8] = 802455732
	elseif jn == "盘丝大法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2544956347
		jns[8] = 136964443
	elseif jn == "知己知彼" then
		jns[1] = "使用后可以查看敌方的信息"
		jns[3] = 4
		jns[4] = "80点魔法"
		jns[5] = "清明自在达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 196316992
		jns[8] = 2448181313
	elseif jn == "天罡气" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4224325719
		jns[8] = 517623127
	elseif jn == "落雷符" then
		jns[1] = "法术攻击多个目标\n#Y对鬼魂术、高级鬼魂术敌人伤害增加20%"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "“磐龙灭法”技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3476452217
		jns[8] = 3226830020
	elseif jn == "象形" then
		jns[1] = "攻击敌人并令其下回合无法行动\n但使用后自己也将在下回合停止行动\n且取消变身状态"
		jns[3] = 4
		jns[4] = "80魔法"
		jns[5] = "生死搏技能达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 3175084157
		jns[8] = 108912467
	elseif jn == "天魔解体" then
		jns[1] = "使用后持续一定回合\n数将自身的物理防御降低50%\n防御值的10%转化为临时伤害"
		jns[3] = 5
		jns[4] = "当前角色最大魔法的80%"
		jns[5] = "人物飞升且“生死搏”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2713209956
		jns[8] = 2477360209
	elseif jn == "水遁" then
		jns[1] = "平时或战斗中使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "战斗时消耗当前所有魔法，非战斗时消耗10点气血、魔法"
		jns[5] = "游龙术技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 596614171
		jns[8] = 2671300567
	elseif jn == "震天诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1449209742
		jns[8] = 1917106392
	elseif jn == "斗转星移" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "七星遁技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2019188530
		jns[8] = 655674701
	elseif jn == "水属性吸收" then
		jns[1] = "20%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 92545119
		jns[8] = 1756512785
	elseif jn == "宁心" then
		jns[1] = "解除并避免女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "宁气诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585090388
		jns[8] = 1957863037
	elseif jn == "明性修身" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4104116990
		jns[8] = 3074583809
	elseif jn == "打造技巧" then
		jns[1] = "铸造名家欧冶子传下的技能\n可以提高打造武器的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3866239213
		jns[8] = 1635206107
	elseif jn == "千里神行" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "消耗10点气血和10点魔法"
		jns[5] = "疾风步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 436091648
		jns[8] = 1717996623
	-- 1.3新增
	elseif jn == "天地无极" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2616462789
		jns[8] = 3629430297
	elseif jn == "九转玄功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1837364177
		jns[8] = 1720159516
	elseif jn == "武神显圣" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3229675127
		jns[8] = 2285367568
	elseif jn == "啸傲" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1753145086
		jns[8] = 796505945
	elseif jn == "气吞山河" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4005775594
		jns[8] = 1613219782
	elseif jn == "诛魔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 150136690
		jns[8] = 2802612826
	elseif jn == "法天象地" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2858795509
		jns[8] = 3937616310
	elseif jn == "踏山裂石" then
		jns[1] = "临时提升必杀几率对单个敌人进行物理攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF4DCF38F
		jns[8] = 0x1C603FAE
	elseif jn == "裂石" then
		jns[1] = "对单个敌人进行物理攻击\n#Y技能附带20%必杀几率\n#S增加1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF4DCF38F
		jns[8] = 0x1C603FAE
	elseif jn == "断岳势" then
		jns[1] = "对单个敌人进行2次物理攻击\n#Y技能附带10%必杀几率\n#S消耗1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、1点战意"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5AA54949
		jns[8] = 0x5C95AF41
	elseif jn == "天崩地裂" then
		jns[1] = "对单个敌人进行3次物理攻击\n#Y技能附带10%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、3点战意"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9ADAEA80
		jns[8] = 0x3FB03390
	elseif jn == "浪涌" then
		jns[1] = "对单个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S增加1点战意值"
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCE61D91C
		jns[8] = 0x1A289BEA
	elseif jn == "惊涛怒" then
		jns[1] = "对多个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S消耗1点战意值"
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB91C6953
		jns[8] = 0xBE11779C
	elseif jn == "翻江搅海" then
		jns[1] = "多个敌人进行物理攻击\n#Y技能附带3%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "个数*30点魔法"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x26419C11
		jns[8] = 0x11879028
	elseif jn == "腾雷" then
		jns[1] = "对目标造成法术伤害\n有几率降低目标#Y50%治疗恢复效果"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "“诛魔”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x569D01F7
		jns[8] = 0x956BA0A2
	elseif jn == "指地成钢" then
		jns[1] = "克制无底洞弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“诛魔”技能达到25级，人物等级达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4AB6831C
		jns[8] = 0x1C603FAE
	elseif jn == "不动如山" then
		jns[1] = "减少自身受到的法术伤害与物理伤害\n#Y提升防御数值=技能等级*2\n#Y提升法防数值=技能等级*1.5"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "“九转玄功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD96F2331
		jns[8] = 0x38C47290
	elseif jn == "碎星诀" then
		jns[1] = "提升自己或队友的物理伤害结果\n不能与镇魂诀同时存在\n#Y提升伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“武神显圣”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x136442C0
		jns[8] = 0x5F8D7935
	elseif jn == "镇魂诀" then
		jns[1] = "提升自己或者队友的#Y24%必杀几率\n不能与碎星诀同时存在\n#Y提升伤害数值=技能等级*1.5"
		jns[3] = 3
		jns[4] = "5%的当前气血"
		jns[5] = "“武神显圣”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9E1580AA
		jns[8] = 0xF808DCC6
	elseif jn == "无穷妙道" then
		jns[1] = "一定几率解除无底洞封印法术。"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "“法天象地”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAFDB81A4
		jns[8] = 0x76FBBEEC
	elseif jn == "纵地金光" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“法天象地”技能达到1级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE6A2AA59
		jns[8] = 0xFEF5D678
	-- 神木林
	elseif jn == "瞬息万变" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 91138644
		jns[8] = 3611723828
	elseif jn == "万灵诸念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1673295044
		jns[8] = 3633730222
	elseif jn == "巫咒" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1387740863
		jns[8] = 3945429798
	elseif jn == "万物轮转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 236054114
		jns[8] = 3548374182
	elseif jn == "天人庇护" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 466502506
		jns[8] = 2656066797
	elseif jn == "神木恩泽" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1911264426
		jns[8] = 785936658
	elseif jn == "驭灵咒" then
		jns[1] = "按技能等级提高最大魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3018347230
		jns[8] = 1524159458
	elseif jn == "落叶萧萧" then
		jns[1] = "使用法术攻击敌方多个目标\n#Y技能附带10%法连几率"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "“瞬息万变”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2E734F9D
		jns[8] = 0x0B8CF3A1
	elseif jn == "荆棘舞" then
		jns[1] = "使用法术攻击敌方，造成较高伤害。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD2AB898
		jns[8] = 0x6A647570
	elseif jn == "尘土刃" then
		jns[1] = "使用法术攻击敌方单体目标\n#Y技能附带伤害50%的伤势效果"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3FE17E30
		jns[8] = 0x71C197B0
	elseif jn == "冰川怒" then
		jns[1] = "使用法术攻击敌方单体目标\n#Y有20%概率冻结目标使其无法行动\n#S有80%几率使目标所有伤害降低10%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xEDF81F56
		jns[8] = 0x3B12CD18
	elseif jn == "雾杀" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*2+自身法伤的20%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1EE55D3C
		jns[8] = 0x0DA2D8DF
	elseif jn == "血雨" then
		jns[1] = "对目标造成大量单体法术伤害"
		jns[3] = 4
		jns[4] = "150点魔法"
		jns[5] = "“巫咒”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x126B932F
		jns[8] = 0x7D52C301
	elseif jn == "星月之惠" then
		jns[1] = "回复自身一定的气血值\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4284560198
		jns[8] = 8287795
	elseif jn == "炎护" then
		jns[1] = "抵御50%的气血伤害\n#Y每抵御1点伤害消耗1点魔法"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“天人庇护”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA215E746
		jns[8] = 0xC5D73984
	elseif jn == "叶隐" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“天人庇护”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x64FEA3A4
		jns[8] = 0x51763883
	elseif jn == "神木呓语" then
		jns[1] = "打造后为鞋子临时增加一定的魔法值。"
		jns[3] = 12
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“神木恩泽”技能达到35级，人物等级达到30级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x977F5625
		jns[8] = 0x33CC0A38
	elseif jn == "蜜润" then
		jns[1] = "提升自己或队友的灵力法伤\n#Y提升伤害数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "25点魔法"
		jns[5] = "“驭灵咒”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x058EE366
		jns[8] = 0xF83E2272
	elseif jn == "蝼蚁蚀天" then
		jns[1] = "克制凌波城弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "“驭灵咒”技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAC0B8B61
		jns[8] = 0xAC574467
	-- 无底洞
	elseif jn == "枯骨心法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3947876534
		jns[8] = 3256658495
	elseif jn == "阴风绝章" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 580599606
		jns[8] = 2376753741
	 elseif jn == "鬼蛊灵蕴" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2137124880
		jns[8] = 642299714
	elseif jn == "燃灯灵宝" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2206649654
		jns[8] = 2011054851
	elseif jn == "地冥妙法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2066772317
		jns[8] = 1202816090
	elseif jn == "混元神功" then
		jns[1] = "按技能等级提伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3367413411
		jns[8] = 2065734785
	elseif jn == "秘影迷踪" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4041502466
		jns[8] = 2278980523
	elseif jn == "移魂化骨" then
		jns[1] = "使目标获得吸血效果\n持续一定回合"
		jns[3] = 3
		jns[4] = "高于最大气血的30%才能使用"
		jns[5] = "“枯骨心法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x173015AE
		jns[8] = 0x121AC8D4
	elseif jn == "夺魄令" then
		jns[1] = "令目标一定回合内无法使用法术。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“阴风绝章”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x62221B56
		jns[8] = 0x076EA85A
	elseif jn == "煞气诀" then
		jns[1] = "使目标一定回合无法做出行动\n并且该目标不会受到攻击\n可作用于敌人或友方"
		jns[3] = 88
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC0504605
		jns[8] = 0x28D6DCD8
		jns[12] = "5回合"
	elseif jn == "惊魂掌" then
		jns[1] = "使用后使对手在持续回合内无法被他人保护"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC232A281
		jns[8] = 0x71307D22
	elseif jn == "摧心术" then
		jns[1] = "使敌方2个目标30%速度降低\n持续一定回合"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[5] = "“阴风绝章”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1CC2B0B0
		jns[8] = 0xD6A5B20C
	elseif jn == "夺命咒" then
		jns[1] = "固定伤害攻击多目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "“鬼蛊灵蕴”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2A3E7A3C
		jns[8] = 0xA9AF9E72
	elseif jn == "明光宝烛" then
		jns[1] = "战斗中大幅增加队友和自己的防御\n#Y防御数值=技能等级*2"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x54DB6CDE
		jns[8] = 0x59D84304
	elseif jn == "金身舍利" then
		jns[1] = "战斗中大幅增加队友和自己的法防\n#Y法防数值=技能等级*4"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1BE322B2
		jns[8] = 0xFE884980
	elseif jn == "地涌金莲" then
		jns[1] = "回复自身一定的气血值\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数,使用后恢复一定伤势"
		jns[3] = 3
		jns[4] = "50点魔法*人数"
		jns[5] = "“地冥妙法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x40FB7647
		jns[8] = 0xF437CA2F
	elseif jn == "万木凋枯" then
		jns[1] = "克制神木林弟子的技能"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“地冥妙法”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x036B4345
		jns[8] = 0xF2E06AF8
	elseif jn == "元阳护体" then
		jns[1] = "打造后为武器提升一定的气血"
		jns[3] = 12
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“混元神功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xABD57D92
		jns[8] = 0x2EF58426
	elseif jn == "遁地术" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“秘影迷踪”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1D14968A
		jns[8] = 0x34D061C7
	elseif jn == "惊心一剑" then
		jns[1] = "对敌人造成巨大的物理伤害并"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 472040976
		jns[8] = 376561149
	elseif jn == "力劈华山" then
		jns[1] = "无视对方的防御使对方造成巨大的伤害"
		jns[3] = 4
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3633016146
		jns[8] = 2223068576
	elseif jn == "移花接木" then
		jns[1] = "每次吸收30%的气血伤害"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5886F7D3
		jns[8] = 0x5886F7D3
	elseif jn == "壁垒击破" then
		jns[1] = "发动物理攻击,该攻击忽视对方30%的防御。如果目标本回合防御，则会受到更大伤害。用此技能攻击时，会忽视“高级防御”和“防御”这两个召唤兽技能产生的技能效果。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF1D5925A
		jns[8] = 0xF1D5925A
	elseif jn == "神迹" then
		jns[1] = "每回合结束时自动解除一切异常状态"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1245429649
		jns[8] = 1198707975
	elseif jn == "雷击" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3336994935
		jns[8] = 2495588313
	elseif jn == "上古灵符" then
		jns[1] = "给予对手巨大的法术波动伤害"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAA1341AF
		jns[8] = 0xAA1341AF
	elseif jn == "善恶有报" then
		jns[1] = "攻击时有一定几率给予对手造成双倍的伤害，也有可能为对方恢复一定气血"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 641427651
		jns[8] = 1898344999
	elseif jn == "死亡召唤" then
		jns[1] = "给予对手巨大的伤害，并且使对手处于死亡禁锢状态下，该状态存在时使鬼魂术无效并且不能使用药品进行复活"
		jns[3] = 4
		--jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1218594609
		jns[8] = 4279125360
	elseif jn == "夜舞倾城" then
		jns[1] = "对目标释放一次附加速度和固定伤害的强力法术效果的物理攻击，并且不可暴击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 387579012
		jns[8] = 1832394806
	elseif jn == "灵能激发" then
		jns[1] = "进入战斗后，临时提高自己的法术伤害能力。（法力点数越高效果越好，持续5回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x400FF62B
		jns[8] = 0x0DB9B664
	elseif jn == "盾气" then
		jns[1] = "进入战斗后，临时提高其等级*1.2的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x04B409B4
		jns[8] = 0x04B409B4
	elseif jn == "高级盾气" then
		jns[1] = "进入战斗后，则提高其等级*1.5的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8EC237B5
		jns[8] = 0x8EC237B5
	elseif jn == "合纵" then
		jns[1] = "当本方有1|2|3|4种与其不同的召唤兽，则提高1|2|3|4%物理伤害结果"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA94D8FEA
		jns[8] = 0xA94D8FEA
	elseif jn == "高级合纵" then
		jns[1] = "当本方有1|2|3|4种与其不同的召唤兽，则提高2|4|6|8%物理伤害结果"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4EAD21FF
		jns[8] = 0x4EAD21FF
	elseif jn == "高级否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受法术伤害减少20%，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能(精神集中,神迹等技能会失效)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 484689261
		jns[8] = 2449787202
	elseif jn == "高级精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，法伤提高10%，但物理攻击能力会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3121640283
		jns[8] = 3049938323
	elseif jn == "月光" then
		jns[1] = "召唤数道月光攻击敌人，同一个人可以被多道月光攻击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8B
		jns[8] = 0xAABBDD8B
	-- 特技
	elseif jn == "气疗术" then
		jns[1] = "恢复（上限3%+200）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "30点愤怒"
		jns[6] = "xcwsc.wdf"
		jns[7] = 0x0A71DEE7
		jns[8] = 0x35F72F87
	elseif jn == "心疗术" then
		jns[1] = "恢复（上限6%+400）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1936940204
		jns[8] = 4247881671
	elseif jn == "命疗术" then
		jns[1] = "恢复（上限9%+600）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2327070966
		jns[8] = 1214582243
	elseif jn == "凝气诀" then
		jns[1] = "恢复上限（15%+200）的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2234398453
		jns[8] = 4231419592
	elseif jn == "凝神诀" then
		jns[1] = "恢复上限（15%+400）的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3010398248
		jns[8] = 3594183195
	elseif jn == "气归术" then
		jns[1] = "自身恢复四分之一的气血"
		jns[3] = 5
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1743955726
		jns[8] = 1501636093
	elseif jn == "命归术" then
		jns[1] = "自身恢复二分之一的气血"
		jns[3] = 5
		jns[4] = "130点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585363944
		jns[8] = 1305176222
	elseif jn == "四海升平" then
		jns[1] = "全体恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "135点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2015850288
		jns[8] = 2239024625
	elseif jn == "回魂咒" then
		jns[1] = "单体复活"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3815030652
		jns[8] = 2541979797
	elseif jn == "起死回生" then
		jns[1] = "单体复活并恢复二分之一的气血"
		jns[3] = 3
		jns[4] = "120点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2205777788
		jns[8] = 3279499363
	elseif jn == "水清诀" then
		jns[1] = "单体解除异常状态"
		jns[3] = 3
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1988393110
		jns[8] = 2231990553
	elseif jn == "冰清诀" then
		jns[1] = "单体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4269368884
		jns[8] = 994373130
	elseif jn == "玉清诀" then
		jns[1] = "全体解除异常状态"
		jns[3] = 3
		jns[4] = "125点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2317466220
		jns[8] = 1064948127
	elseif jn == "晶清诀" then
		jns[1] = "全体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4162645482
		jns[8] = 2183757094
	elseif jn == "罗汉金钟" then
		jns[1] = "全体队友受到的法术伤害减半，效果为3回合"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000001
		jns[8] = 0x00000002
	elseif jn == "圣灵之甲" then
		jns[1] = "提升我方全体10%的防御\n效果持续到战斗结束"
		jns[3] = 66
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000003
		jns[8] = 0x00000004
	elseif jn == "魔兽之印" then
		jns[1] = "提升我方全体10%的伤害力\n效果持续到战斗结束 "
		jns[3] = 66
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000005
		jns[8] = 0x00000006
	elseif jn == "光辉之甲" then
		jns[1] = "提升队友的20%的防御\n效果持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000007
		jns[8] = 0x00000008
	elseif jn == "太极护法" then
		jns[1] = "受到的法术伤害减半，效果为6回合 "
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000009
		jns[8] = 0x00000010

elseif jn == "菩提心佑" then
		jns[1] = "给己方所有目标增加一个临时屏障,可抵御目标等级*5的伤害,持续3回合"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000009
		jns[8] = 0x00000010
	elseif jn == "身似菩提" then
		jns[1] = "给队友或自己添加一个法术反噬状态，该状态持续期间受到的所有法术伤害会让施法者受到同样的伤害,持续2回合"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000011
		jns[8] = 0x00000012
	elseif jn == "先发制人" then
		jns[1] = "提升队友20%的速度，持续3回合"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000013
		jns[8] = 0x00000014


	elseif jn == "野兽之力" then
		jns[1] = "提升队友20%的伤害力\n效果持续到战斗结束 "
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000011
		jns[8] = 0x00000012
	elseif jn == "慈航普渡" then
		jns[1] = "复活我方全体队友。"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000013
		jns[8] = 0x00000014
	elseif jn == "八凶法阵" then
		jns[1] = "超级赤焰兽专属技能，发动法术攻击4个敌人。"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000015
		jns[8] = 0x00000016
	elseif jn == "叱咤风云" then
		jns[1] = "水系法术攻击3个目标，并提高法术连击的概率。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000017
		jns[8] = 0x00000018
	elseif jn == "净台妙谛" then --1
		jns[1] = "增加自身体质*成长*2的气血。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000019
		jns[8] = 0x00000020
	elseif jn == "法术防御" then
		jns[1] = "极强的法术防御技能。可以防御法术攻击，减少65%的法术伤害，但无法防御物理攻击。"
		jns[3] = 66
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000021
		jns[8] = 0x00000022
	elseif jn == "理直气壮" then --1
		jns[1] = "普通攻击时，40%的几率攻击3次；但物理伤害效果降低20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000023
		jns[8] = 0x00000024
	elseif jn == "天降灵葫" then
		jns[1] = "群体法术攻击，随机攻击1~5个目标，最多5人。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000025
		jns[8] = 0x00000026
	elseif jn == "灵能激发" then --1
		jns[1] = "进入战斗后，提高自己的法术伤害能力。（魔力点数越高效果越好，持续到战斗结束）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000027
		jns[8] = 0x00000028
	elseif jn == "高级法术抵抗" then --1
		jns[1] = "减少10%所受的法术伤害，但同时物理伤害能力减少10%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000029
		jns[8] = 0x00000030
	elseif jn == "灵山禅语" then
		jns[1] = "增加自身魔力*（成长-0.3）的法防。" --1
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000031
		jns[8] = 0x00000032
	elseif jn == "观照万象" then
		jns[1] = "使用所有主动技能进攻目标,冷却回合10回合。"
		jns[3] = 4
		jns[4] = "200点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000033
		jns[8] = 0x00000034
	elseif jn == "弱点击破" then
		jns[1] = "单体无视一半防御攻击"
		jns[3] = 4
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4136547665
		jns[8] = 2136234800
	elseif jn == "琴音三叠" then
		jns[1] = "使用3次法术攻击敌人,按次数增加伤害"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4136547665
		jns[8] = 2136234800
	elseif jn == "冥王暴杀" then
		jns[1] = "减少对方气血，最小伤害为50"
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "状态图标.wdf"
		jns[7] = 0x00000046
		jns[8] = 0x00000047
	elseif jn == "破血狂攻" then
		jns[1] = "狂性大发，可以连续攻击两次"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4254723553
		jns[8] = 326320655
  elseif jn == "破碎无双" then
		jns[1] = "攻击目标使目标受到伤害\n同时减少相同伤害的蓝量"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4254723553
		jns[8] = 326320655
	elseif jn == "破甲术" then
		jns[1] = "单体防-20%持续到战斗结束"
		jns[3] = 4
		jns[4] = "35点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "碎甲术" then
		jns[1] = "全体防-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "放下屠刀" then
		jns[1] = "降低敌人的20%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884
		jns[8] = 441260658
	elseif jn == "笑里藏刀" then
		jns[1] = "减少敌方单体目标70点愤怒"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884
		jns[8] = 441260658
	elseif jn == "绝幻魔音" then
		jns[1] = "减少敌方全体目标20点愤怒"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x480A8A7D
		jns[8] = 0x172AE1E0
	elseif jn == "流云诀" then
		jns[1] = "单体速+20%持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9715FA32
		jns[8] = 0xA85146A6
	elseif jn == "啸风诀" then
		jns[1] = "全体速+10%持续到战斗结束"
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6812F03B
		jns[8] = 0x96370902
	elseif jn == "河东狮吼" then
		jns[1] = "降低敌方全体10%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4154480125
		jns[8] = 1389260370
	elseif jn == "修罗咒" then
		jns[1] = "单体反弹50%的物理伤害3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA0830D94
		jns[8] = 0x14FF0C1F
	elseif jn == "天衣无缝" then
		jns[1] = "单体反弹50%的法术伤害3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x68F4FE2B
		jns[8] = 0x76F6DD9E
	elseif jn == "凝滞术" then
		jns[1] = "单体速-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8FF3DB32
		jns[8] = 0x264D9AC8
	elseif jn == "停陷术" then
		jns[1] = "全体速-5%,持续到战斗结束"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x79619181
		jns[8] = 0x5E68270E
   	elseif jn == "调息" then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定气血值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x94308B6B
		jns[8] = 0x5956387D
    elseif jn == "打坐" then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定魔法值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB77AFA4C
		jns[8] = 0xA0D18931
    elseif jn == "妙手空空" then
		jns[1] = "战斗中使用的法术，可从怪物身上偷来银两或宝物。#G/(每次使用都将消耗目标等级*4点魔法)"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD4815978
		jns[8] = 0x8466E376
     elseif jn == "宝石工艺" then
		jns[1] = "提高合成宝石的成功率。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x408D50D7
		jns[8] = 0x5899607A
    elseif jn == "奇门遁甲" then
		jns[1] = "在特定场景使用道具“导标旗”做标记，用以传送。1级时可以在长寿村做标记，2级时增加傲来国，3级增加长安城，4级增加朱紫国。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFDB72ACA
		jns[8] = 0xEFE3F812
    elseif jn == "仙灵店铺" then
		jns[1] = "平时使用，能够呼出购买界面直接购买商品。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x47877A93
		jns[8] = 0xF3719878
	elseif jn == "建筑之术" then
		jns[1] = "提高建造房屋的能力，玩家拥有较高的技能后，可以建造更高级的房屋，并获得更多的室内空间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9F2DFDB6
		jns[8] = 0x16418D92
	elseif jn == "变化之术" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] =  0xD8118484--0xE6CAA561 --0xD8118484
		jns[8] = 0xE6CAA561--0xD8118484
   	elseif jn == "火眼金睛" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE9D07953
		jns[8] = 0x43CBAF9C
	elseif jn == "飞行技能" then
		jns[1] = "学习后可以使角色腾云驾雾，翱翔天地。"
		jns[3] = 108
		jns[6] = "新界面.wdf"
		jns[7] = 0x00000121
		jns[8] = 0x00000120

	elseif jn == "还魂咒" then
		jns[1] = "施展法术复活死去的同伴\n#Y附加自身法伤10%的治疗能力,按等级提升治疗能力系数。"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x987B0EEE
		jns[8] = 0x987B0EEE
	elseif jn == "仙人指路" then
		jns[1] = "恢复目标队友气血\n并解除其封类异常状态"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8F3BA732
		jns[8] = 0x8F3BA732
	elseif jn == "四面埋伏" then
		jns[1] = "提升目标队友11%的封印命中率\n只在该队友气血≤40%时才生效\n效果持续4回合"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE2CDD1D3
		jns[8] = 0xE2CDD1D3
	elseif jn == "赴汤蹈火" then
		jns[1] = "提高孩子最大气血540点\n提高法术防御162点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1dbafffc
		jns[8] = 0x1dbafffc
	elseif jn == "开门见山" then
		jns[1] = "提高孩子最大气血38O点\n提高物理攻击结果100点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6ee33a3f
		jns[8] = 0x6ee33a3f
	elseif jn == "张弛有道" then
		jns[1] = "增加魔力值*0.5的法术伤害"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xdc6ae286
		jns[8] = 0xdc6ae286
	elseif jn == "食指大动" then
		jns[1] = "法术攻击3个目标\n受到的法术伤害有25%几率获得一个护盾"
		jns[3] = 4
		jns[4] = "作用目标*50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xdc6ae286
		jns[8] = 0xdc6ae286
	elseif jn == "峰回路转" then
		jns[1] = "当你进场时，立即为全体队友恢复HP"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B85ED35  --没有这个技能素材.
		jns[8] = 0x0B85ED35
	elseif jn == "流沙轻音" then
		jns[1] = "法术攻击5个目标,伤害递减"
		jns[3] = 4
		jns[4] = "作用目标*50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B85ED35  --没有这个技能素材.
		jns[8] = 0x0B85ED35
	elseif jn == "武神怒击" then
		jns[1] = "能连续攻击对方3次。但使用后需休息一回合，休息时不能使用战斗指令，也不会受封类法术影响。"
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427
	elseif jn == "刀光剑影" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "毁灭之光" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "其疾如风" then
	jns[1] = "官府弟子多善战者\n行军当迅疾如风\n攻其无备\n使用后大幅度提高我方所有30%速度\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x184E7180
	jns[7] = 0xA208A8AE
	elseif jn == "其徐如林" then
	jns[1] = "兵者以势制权\n徐徐如林出手则必有所得\n使用后解除我方所有异常状态\n恢复5%友方气血上限"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x907FC1B6
	jns[7] = 0x49FB33E7
	elseif jn == "不动如山 " then
	jns[1] = "实而备之\n强而避之\n防御驻守合该岿然如山\n使用后大幅度降低我方所有受到30%的伤害\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x02662BEE
	jns[7] = 0x3EE72C6A
	elseif jn == "侵掠如火" then
	jns[1] = "善用兵者\n攻则侵掠如火\n战无不克\n使用后大幅度提高我方所有30%伤害\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x625EABBA
	jns[7] = 0x7690D6BE
	elseif jn == "进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,第2回合及以后进入战斗时,提升10%的必杀几率持续5回合。"--"第2回合及以后进入战斗时,提升15%的必杀几率持续5回合,且遂回合减少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X0000009F
		jns[8] = 0X0000009F
	elseif jn == "进击法暴" then
		jns[1] = "宠物技能必须有,法暴或者高级法暴的时候才能生效,第2回合及以后进入战斗时,提升10%的法暴几率持续5回合。"--"第2回合及以后进入战斗时,提升10%6的法术暴击几率持续5回合,且逐回合臧少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A0
		jns[8] = 0X000000A0
	elseif jn == "高级进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,第2回合及以后进入战斗时,提升20%的必杀几率持续5回合。"--"第2回合及以后进入战斗时,提升30%的必杀几率持续5回合,且遂回合减少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A4
		jns[8] = 0X000000A4
	elseif jn == "高级进击法暴" then
		jns[1] = "宠物技能必须有,法暴或者高级法暴的时候才能生效,第2回合及以后进入战斗时,提升20%的法暴几率持续5回合。"--"第2回合及以后进入战斗时,提升20%的法术暴击几率持续5回合,且逐回合臧少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A3
		jns[8] = 0X000000A3
	elseif jn == "扶摇万里" then
		jns[1] = "法术攻击多个目标，按等级附加一定的法术伤害，攻击人数，最多10人。"
		jns[3] = 4
		jns[6] = "xcwsc.wdf"
		jns[7] = 0x69007819
		jns[8] = 0x69007819
	elseif jn == "凝光炼彩" then
		jns[1] = "受伤时有25%的概率获得护盾，护盾值为所受伤害的50%"
		jns[3] = 7
		jns[6] = "护盾括号.wdf"
		jns[7] = 0X0085FDCB
		jns[8] = 0X0085FDCB

   elseif jn == "凭风借力" then---
		jns[1] = "每次物理攻击提升必杀时12.5%的伤害结果"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000206
		jns[8] = 0X00000207
elseif jn == "出其不意" then--
		jns[1] = "使用本回合已方召唤兽未使用过的技能时，造成的伤害结果提升15%。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000065
		jns[8] = 0X00000066
elseif jn == "风起龙游" then--
		jns[1] = "攻击速度低于自身的目标，提升10%的物理效果。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000077
		jns[8] = 0X00000078
elseif jn == "虎虎生威" then--
		jns[1] = "大幅度提升必杀时造成的伤害(与召唤力量点数有关)"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000106
		jns[8] = 0X00000107
elseif jn == "狂莽一击" then--
		jns[1] = "物理伤害提升,但攻击时可能出现偏差(随机增加10%-30%)"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000136
		jns[8] = 0X00000137
elseif jn == "气贯长虹" then--
		jns[1] = "触发连击/高级连击时，伤害提高25%/50%"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000215
		jns[8] = 0X00000216
elseif jn == "神出鬼没" then--
		jns[1] = "进入战斗后获得修罗隐身状态4回合,伤害提升10%"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000242
		jns[8] = 0X00000243
elseif jn == "义薄云天" then--
		jns[1] = "增加自身等级*0.55的法术伤害"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000305
		jns[8] = 0X00000306
elseif jn == "溜之大吉" then
		jns[1] = "增加召唤兽20%的速度"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000204
		jns[8] = 0X00000205

elseif jn == "北冥之渊" then--
		jns[1] = "令友方所有的召唤兽增加自身造成的伤害提升30%，持续3回合。冷却15回合"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000031
		jns[8] = 0X00000032

elseif jn == "无畏布施" then
		jns[1] = "增加目标的防御、法防，伤害增加20%。"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000274
		jns[8] = 0X00000275

elseif jn == "神来气旺" then
		jns[1] = "攻击多个单位(最多6个单位).听说很厉害.伤害会根据牛脾气波动。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000244
		jns[8] = 0X00000245

elseif jn == "哼哼哈兮" then
		jns[1] = "快使用双截棍哼哼哈兮,习武之人切记仁者无敌。对目标进行随机次数物理攻击。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000104
		jns[8] = 0X00000105
elseif jn == "水击三千" then
		jns[1] = "临时提升物理伤害结果和暴击倍率进行一次物理攻击。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000248
		jns[8] = 0X00000249
elseif jn == "昼伏夜出" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，进入战斗后伤害提升10%。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000246
		jns[8] = 0X00000247





elseif jn == "滋养" then
			jns[1] = "召唤绿意之灵:汲取大地滋养,为友方注入勃勃生机,迅速恢复气血。\n恢复友方单个目标的气血"
			jns[3] = 5
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x82DE1BB0
			jns[8] = 0x82DE1BB0
	------------------------------------------------空
	elseif jn == "轻歌飘舞" then
			jns[1] = "随轻拍舞步扭动，犹如飘逸的轻歌，攻击敌方目标，激发友军潜能，提升本回合物理伤害。\n轻拍舞步，攻击敌方单个自标，然后提高所有友方玩家本回合的物理伤害"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2B37D923
			jns[8] = 0x2B37D923
	elseif jn == "翩跃飞舞" then
			jns[1] = "翩髓起舞，随重拍之力攻击敌方四个单位，每次攻击伤害递增，如同舞者之力量汹涌澎湃。\n重拍舞步，对敌方4个单位发动物理攻击，伤害。倍率为80%，每攻击一个目标，后续的伤害增加。"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4345B564
			jns[8] = 0x4345B564
	elseif jn == "谆谆教诲" then
			jns[1] = "和尚的啰嗦中,偶尔也会夹杂蕴含大智慧的教诲。\n对敌方单个目标造成较高的法术伤害。"
			jns[3] = 4
			jns[4] = "45点魔法、20点愤怒"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000405
			jns[8] = 0x00000406
			jns[12] = "冷却8回合"
	elseif jn == "子母神针" then
			jns[1] = "固定伤害攻击2个目标\n#Y技能伤害:\n#Y技能等级*3.5+固定伤害+速度*0.2+伤害*0.05+法伤*0.05+武器伤害*0.1\n#G暗器加成:\n#G暗器等级%10百分比"
		    jns[3] = 4
		    jns[4] = "35点魔法、30点愤怒"
		    jns[5] = "沉鱼落雁技能达到20级"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000403
			jns[8] = 0x00000404
	elseif jn == "焕生咒" then
			jns[1] = "念动焕生咒语,借力队友的生机,吸纳满血队友的生命力，临时提升自身治疗能力，为友方目标恢复丰盈的气血\n恢复友方目标的气血，施法前会汲取所有满血的队友30点生命值，临时增加治疗能力。"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x51C241BE
			jns[8] = 0x51C241BE
	elseif jn == "燃血术" then
			jns[1] = "以自身鲜血为祭,换取强大的法力。\n消耗气血，强化你的下一个地涌金莲或焕生咒:使目标获得等同于治疗量的护盾值,夺魄令5%基础封印命中"
			jns[3] = 66
			jns[4] = "(最大气血×10%)点气血和气血上限"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8BE68718
			jns[8] = 0x8BE68718
	elseif jn == "追魂刺" then
			jns[1] = "以地脉之气为媒介,不仅能够伤人肌体,更能刺穿魂魄\n对敌方单个目标造成固定伤害。"
			jns[3] = 4
			jns[4] = "50点魔法、20点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDBFE0302
			jns[8] = 0xDBFE0302
	------------------------------------------------特效主动技能
	elseif jn == "由己渡人" then
			jns[1] = "复活一名队友\n#Y附加地冥妙法等级*6加上自身法伤10%的治疗能力,按等级提升治疗能力系数。"
			jns[3] = 5
			jns[4] = "当前气血*10%"
			jns[5] = "当前气血≥气血上限*10%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDE58924A
			jns[8] = 0xDE58924A
	elseif jn == "天眼神通" then
			jns[1] = "二郎真君开启天眼,使功法威力大增。\n使用后随机获得以下1到3种效果，持续5回合。(可同时触发多个效果）\n智眼:每合结束时获得1点战意;\n怒眼:惊涛怒、断岳势、翻江搅海、天崩地裂造成的伤害提高\n天眼;暴击几率增加。"
			jns[3] = 66
			jns[4] = "300点魔法、1点战意"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1299A579
			jns[8] = 0x1299A579
			jns[12] = "冷却8回合"
	elseif jn == "敲金击玉" then
			jns[1] = "镇元大仙所创灵宝斋法，以五行炼化仙果,使其涤除污垢,内外晶莹\n物理攻击单个目标，你所有的人参娃娃会参与此次攻击并造成额外伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBF6B4C8C
			jns[8] = 0xBF6B4C8C
	elseif jn == "催化" then
			jns[1] = "强化目标身上来自你的“雾杀”使“雾杀”造成的伤害增加100%(300%);若有风灵,会消耗1层强化所有敌友单位身上来自你的“雾杀“本场战斗中,“雾杀”的基础伤害提高6%，最多60%。(括号内为目标是NPC时的效果）"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xD10DF1DF
			jns[8] = 0xD10DF1DF
	elseif jn == "金击式" then
			jns[1] = "镇元大仙把玩金击子时自创的招式，使用时若有金玉落盈芝声。\n对敌方多个目标发动物理攻击(最多3个目标)。(对玩家使用时伤害为1）"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x37FCB484
			jns[8] = 0x37FCB484
	elseif jn == "百草诀" then
			jns[1] = "感召大地生灵，汇聚百草精华、化作神秘药灵助战。药灵呈红、蓝、黄三色,各具神奇功效。\n从自然中凝萃10颗药灵,药灵将在红色、蓝色，黄色中随机。"
			jns[3] = 66
			jns[4] = "50点魔法法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x7D0D0DAB
			jns[8] = 0x7D0D0DAB
	elseif jn == "幼狮之搏" then-------没写
			jns[1] = "宠兽专用狮搏，某些门派特殊技能"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1C454D91
			jns[8] = 0x1C454D91
	elseif jn == "鹰击长空" then--未写
			jns[1] = "宠兽专用鹰击，某些门派特殊技能(人数:等级%35，不会超过5个目标)"
			jns[3] = 4
			jns[4] = "30点魔法，攻击多人时消耗增加"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x43CEF766
			jns[8] = 0x43CEF766
	elseif jn == "翩鸿一击" then
			jns[1] = "使用该技能攻击目标，下回合提高自身15%的速度。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x30E001D4
			jns[8] = 0x30E001D4
			jns[12] = "冷却6回合"
	elseif jn == "披坚执锐" then
			jns[1] = "身披坚甲，手执利刃，敌人在追击下无所遁形\n每合随机1种你装备上的追加法术。使用披坚执锐后，视为你装备当回合随机的追加法术。"
			jns[3] = 4
			jns[4] = "随机法术消耗"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x72ED61A1
			jns[8] = 0x72ED61A1
	elseif jn == "六道无量" then---攻击玩家为完成
			jns[1] = "法术驱动的必中单体物理攻击技能,攻击时额外对一个带有尸腐毒的单位起效。\n该技能攻击玩家时,双方防御下降(自身等级*1.6+70)，持续2回合。"
			jns[3] = 4
			jns[4] = "40点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBC2DD56E
			jns[8] = 0xBC2DD56E
	elseif jn == "狂怒" then
			jns[1] = "发动神功,以狂怒之势震慑诸敌,对其造成高额伤害。\n获得与当前变身相同回合的狂怒；造成的物理伤害提高。"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6E34D2AA
			jns[8] = 0x6E34D2AA
	elseif jn == "风雷斩" then
			jns[1] = "风烈雷迅九霄怒，一斩疾霆破惊云天宫弟子能以雷霆之势予以对手沉重一击\n以雷霆之势攻击一个单位"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6D372C69
			jns[8] = 0x6D372C69
	elseif jn == "霹雳弦惊" then
			jns[1] = "天宫雷部的霸道法术，强化你的风雷斩为风雷斩·霹雳轰击对手，惊雷震耳，受之者元气大伤。\n强化你的风雷斩:对主目标额外造成伤害，持续6回合。使用雷怒霆激后会解除此状态"
			jns[3] = 66
			jns[4] = "70点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x58B7E9CB
			jns[8] = 0x58B7E9CB
	elseif jn == "雷怒霆激" then
			jns[1] = "天宫雷部的霸道法术，强化你的风雷斩为风雷斩·霹雳轰击对手，惊雷震耳，受之者元气大伤。\n强化你的风雷斩:额外攻击2个单位，持续6回合。使用霹雳弦惊解除此状态。"
			jns[3] = 66
			jns[4] = "70点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6009D906
			jns[8] = 0x6009D906
	elseif jn == "五雷正法" then
			jns[1] = "浩然真气，感通天地。行持此符，可驱雷电。\n消耗所有雷法加持，使用五雷咒攻击目标"
			jns[3] = 4
			jns[4] = "150点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xE971301E
			jns[8] = 0xE971301E
	elseif jn == "蛊树迷瘴" then
			jns[1] = "密林有蛊惑众生,朽木吐瘴藏杀气。释放瘴气蔓延，令对手丧魂落魄。\n对敌方多个目标造成法术伤害(最多5个目标)，有一定几率为目标附加1层“雾杀"
			jns[3] = 4
			jns[4] = "30点魔法*作用人数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4E4ECD7C
			jns[8] = 0x4E4ECD7C
	elseif jn == "剑意莲心" then
			jns[1] = "莲心问剑意如何，五行珠佑便可得。在五行珠的庇佑下念动此咒，博予以对手额外打击。\n消耗所有五行珠，对敌方多个单位发动物理攻击(最多6个目标)，消耗的五行珠数量越多伤害越高"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDEECD728
			jns[8] = 0xDEECD728
	elseif jn == "雷法崩裂" then
			jns[1] = "道法以气感通，风雷以气动荡，行持此符催动雷霆，可令天地前裂。\n使用五雷咒攻击目标，转化当前的符咒为”雷法崩裂“加持，每转化一枚符咒，五雷正法对主目标造成伤害提高32%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉扩展.wdf"
			jns[7] = 0x71500000
			jns[8] = 0x71500000
	elseif jn == "雷法震煞" then
			jns[1] = "真气与天地相合，随窍而发化为光电。行持此符呼召风雷威能震煞天地。\n使用五雷咒攻击目标。转化当前的符咒为“雷法震煞”加持，每转化一枚符咒，五雷正法攻击目标增加1个。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉扩展.wdf"
			jns[7] = 0x71600000
			jns[8] = 0x71600000
	elseif jn == "雷法坤伏" then
			jns[1] = "燃烧自身气宇，存神运力目出雷电。行持此符降光伏风，倾催四方。\n使用五雷咒攻击目标转化当前的符咒为”雷法坤伏“加持，每转化一枚符咒，五雷正法使随机一个攻击自标受到的物理和法术伤害增加，持续3回合。效果可叠加，但是持续回合不刷新。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉扩展.wdf"
			jns[7] = 0x71400000
			jns[8] = 0x71400000
	elseif jn == "千蛛噬魂" then
			jns[1] = "千蛛毒丝、罗网深深。蛛丝布下陷阱，毒素遍布罗网，予以敌人重击。\n对多个目标造成物理伤害(最多3个目标);对带有你的“天罗地网“状态的目标适成额外伤害。"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBBC8F2A2
			jns[8] = 0xBBC8F2A2
	elseif jn == "蛛丝缠绕" then
			jns[1] = "牵丝笼网,游蛛缠身。蜘蛛吐丝织造罗网，缠绕包裹猎物。\n攻击单个目标,并对复附加天罗地网”状态，持续4回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4DEF4B05
			jns[8] = 0x4DEF4B05
	elseif jn == "血影蚀心" then
			jns[1] = "尸气蚀心，腐莓沁骨，予以对手毒辣一击。\n对敌方单个目标造成物理伤善，攻击时有几率附加”尸腐毒“状态。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xEE1C323A
			jns[8] = 0xEE1C323A
	elseif jn == "百鬼噬魂" then
			jns[1] = "入骨噬魂,掠心夺魄,给对手造成重创。\n对敌方多个目标成物理伤害(最大4个目标)，攻击时有几率附加“尸腐毒”状态。"
			jns[3] = 4
			jns[4] = "35点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x35A96711
			jns[8] = 0x35A96711
	-----------------------------------------------------------------------------经脉特效
	elseif jn == "连破" then
			jns[1] = "横扫千军有1%几率不进入休息"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000395
			jns[8] = 0x00000395
	elseif jn == "鞭挞" then
			jns[1] = "荆棘舞会消耗最多3层“风灵，每层风灵增加15%伤害结果。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2AAB3A47
			jns[8] = 0x2AAB3A47
	elseif jn == "佛眷" then
			jns[1] = "活血会使目标受到的治疗量提高30%,持续3回合"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000401
			jns[8] = 0x00000401
	elseif jn == "聚气" then ---和凌波经脉重名
			jns[1] = "每次使用非回复类辅助门派法术时，有15%几率使下一次回复法术效果提升30%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x86873B99
			jns[8] = 0x86873B99
	elseif jn == "自矜" then
			jns[1] = "每次使用单体封印技能失败时，有40%几率获得临时封印能力提升，使得下次单体封印时成功率提高基础值的48%.（总的命中率最高不超过100%，不对一笑倾城首目标有效)。到下一次命中时清空该效果。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x22A77A43
			jns[8] = 0x22A77A43
	elseif jn == "悲恸" then
			jns[1] = "五雷咒对召唤兽造成的伤害提高30%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1D0F8066
			jns[8] = 0x1D0F8066
	elseif jn == "奔雷" then
			jns[1] = "五雷咒额外攻击1个目标，单你的封印命中率下降15%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB490BD29
			jns[8] = 0xB490BD29
	elseif jn == "电芒" then
			jns[1] = "被雷霆万钧击中的目标将被附加’电芒”状态。带有’电芒”的目标再次受到雷霆万钧打击时额外承受8%的伤害，’电芒”持续3回合（不可叠加，可以被刷新）。 自身封印命中率减少15%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x7B970F69
			jns[8] = 0x7B970F69
	elseif jn == "龙骇" then
			jns[1] = "使用龙卷雨击有25%几率使得你下一次龙腾造成的伤害提高20%;你的龙腾有25%几率使得你下一次龙卷雨击造成的伤害提高10%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDFF0E26B
			jns[8] = 0xDFF0E26B
	elseif jn == "魔冥" then
			jns[1] = "每次使用飞砂走石,可以使你下次三昧真火或魔焰滔天造成的伤害提高3%(目标为人物则为9%。持续4回合可叠加4层，层数提升时刷新时间。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8BF70190
			jns[8] = 0x8BF70190
	elseif jn == "金莲" then
			jns[1] = "你的地涌金莲额外作用1%2个单位（“地冥妙法”等级为45%105时)但你造成的固定伤害降低30%。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000398
			jns[8] = 0x00000398
	elseif jn == "风灵" then--状态
			jns[1] = "每偶数回合结束获得1层“风灵。"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4BB78E6D
			jns[8] = 0x4BB78E6D

	------------------------------------------------------------------------------------------------空
	elseif jn == "明光" then
			jns[1] = "你的治疗有18%几率触发暴击，使得技能效果翻倍。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xA2F9E185
			jns[8] = 0xA2F9E185
	elseif jn == "度厄" then---没写效果
			jns[1] = "你的唧唧歪歪和谆谆教诲不会触发法术闪避,但门派法术施加的浇了和“金刚护体、金刚护法、一苇渡江”效果降低50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8E6B4692
			jns[8] = 0x8E6B4692
	elseif jn == "踏歌" then
			jns[1] = "舞步需要遵循音乐的规律在回合数为奇数时，可以使用“重拍”舞步，在回合数为偶数时，可以使用“轻拍“舞步"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x25260F44
			jns[8] = 0x25260F44
	elseif jn == "乐韵" then
			jns[1] = "使用轻拍舞步后，获得“乐韵”，使用重拍舞步可消耗乐韵”使技能伤害提高30%"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xD5669AE4
			jns[8] = 0xD5669AE4
	elseif jn == "咒符" then------状态
			jns[1] = "回合开始时，会随机获得1-5枚符咒，雷法会消耗当前所有符咒来强化你的下一个五雷正法。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000282
			jns[8] = 0x00000282
	elseif jn == "返璞" then
			jns[1] = "作为物理攻击的大师，门派法术造成的物理伤害提高但封印命中率和造成的法术伤害降低。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4C6405CB
			jns[8] = 0x4C6405CB
	elseif jn == "五行珠" then---状态
			jns[1] = "每次使用五行攻击时，获得本次攻击五行对应的五行珠，每种五行最多拥有1枚五行珠。你的门派法术造成的治疗效果减少50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB44BA05E
			jns[8] = 0xB44BA05E
	elseif jn == "龙魂" then
			jns[1] = "每3次成功的施法，使得接下来3回合造成的法术伤害提高3%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8E2CB1FA
			jns[8] = 0x8E2CB1FA
	elseif jn == "骤雨" then
			jns[1] = "每次使用烟雨剑法后都会使你造成的物理伤害和暴击率提高2%,持续3回合，可叠加3层。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB79CC34C
			jns[8] = 0xB79CC34C
	elseif jn == "还丹" then --状态
			jns[1] = "敲金击玉每次攻击后可获得1枚人参娃娃、人参娃娃会在使用敲金击玉时与你一同攻击，额外造成30%伤害。最多持有3枚人参娃娃,持续时间3回合，获得时刷新持续时间"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFF0081A3
			jns[8] = 0xFF0081A3
	elseif jn == "驯兽幼狮" then
			jns[1] = "你的召唤兽会共附加幼狮之搏技能(技能效果等同狮搏)以及鹰击长空技能(技能效果等同鹰击)。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x013D6355
			jns[8] = 0x013D6355
	elseif jn == "狮魂" then
			jns[1] = "你每次使用狮搏后，获得1层“狮魂”使其“幼狮之搏”造成的伤害提高。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x06B6105D
			jns[8] = 0x06B6105D
	elseif jn == "神迷" then
			jns[1] = "成功使用“含情脉脉”和魔音摄魂”封印目标时,吸取4点愤怒。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6F367EF0
			jns[8] = 0x6F367EF0
	elseif jn == "药灵" then ---状态
			jns[1] = "受药灵亲和消耗药灵释放的法术会受治疗能力的加成(包含恢复、护盾、增伤效果）、但你造成的法术伤害降低50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFB48D5CC
			jns[8] = 0xFB48D5CC
	elseif jn == "吞山" then
			jns[1] = "你的裂石、断岳势和天崩地裂增加5%的暴击几率。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x70FDB194
			jns[8] = 0x70FDB194
	elseif jn == "饮海" then
			jns[1] = "你的浪涌、惊涛怒和翻江搅海忽略目标一定的防御。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x40FB7647
			jns[8] = 0x40FB7647
	elseif jn == "超级战意" then --状态
			jns[1] = "获得战意时:有20%的几率获得1点超级战意，最多持有3点超级战意;每点消耗的超级战意,将提高此次攻击20%的伤害。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4F57FF06
			jns[8] = 0x4F57FF06
	elseif jn == "战意" then--状态
			jns[1] = "用于发动门派法术。战意点数将提高自己的伤害力。战意最多累计6点，战斗中死亡时减半。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000402
			jns[8] = 0x00000402
	elseif jn == "裂魂" then
			jns[1] = "追魂刺目标为非玩家单位时,造成额外伤害;目标为玩家单位击出目标魂魄。下次使用追魂刺或夺命咒会击散离体魂魄对目标造成额外伤害"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x49D3C846
			jns[8] = 0x49D3C846


	---------------------------------------------------------------------------------------------------------------------------奇经八脉主动技能
	elseif jn == "亢龙归海" then
			jns[1] = "矫健的神龙翻腾四海的英姿很少有人目睹，而之后更无人能够道出其中的神威。\n使用龙腾连续攻击2次目标，每次造成龙腾伤害的95%，使用后息1回合。"
			jns[3] = 4
			jns[4] = "200点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xCE07792D
			jns[8] = 0xCE07792D
			jns[12] = "冷却6回合"
	elseif jn == "魔焰滔天" then
			jns[1] = "为了能给敌人造成更大的伤害，的弟子是不怕赌上自己运气的。\n使用法术攻击目标，70%几率造成三昧真火法术伤害×175%，30%几率造成三昧真火法术伤害×25%。不受佛法无边影响。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x525B9DB0
			jns[8] = 0x525B9DB0
			jns[12] = "冷却6回合，战斗开始时具有3回合冷却"
	elseif jn == "风卷残云" then
			jns[1] = "神木林在觉醒，风在咆哮！大风带着神木林弟子的怒意无情的打击面前的敌人。\n消耗所有风灵使用一次落叶萧萧，伤害结果提高（消耗风灵数×16%)。该技能不触发“重光”，但佩戴“月影”时额外提高12%伤害并消耗1点灵气。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x3778487D
			jns[8] = 0x3778487D
			jns[12] = "冷却6回合，战斗开始时具有3回合冷却却"
	elseif jn == "风雷韵动" then
			jns[1] = "以法术攻击敌方单体目标，造成110%的法术伤害。对带有“电芒”的单位额外提高40%的伤害。"
			jns[3] = 4
			jns[4] = "60点魔法，10点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x169010C9
			jns[8] = 0x169010C9
	elseif jn == "长驱直入" then
			jns[1] = "替换天赋：翩鸿一击:使用该技能攻击时,目标无法被保护。\n伤害结果为普通攻击的110%；同时60%几率对目标附加“重创”\n状态:回复效果降低30%并且受到施法者的伤害增加10%。法术驱动的物理攻击,持续2回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xAB6EA7B4
			jns[8] = 0xAB6EA7B4
			jns[12] = "冷却6回合"
	elseif jn == "天神怒斩" then
			jns[1] = "天神盛怒，以开天辟地之势，挥刀怒斩：\n1.增加25%暴击几率、忽略目标25%防御发动一次物理攻击，\n命中后驱散目标随机一个增益状态。\n2.若自身战意为1，造成额外50%伤害，否则造成25%额外伤害。\n3.每次使用后本场战斗该技能伤害永久提高25%（目标为NPC时为50%）。\n4.使用天崩地裂和翻江搅海会减少这个技能1回合的冷却回合。"
			jns[3] = 4
			jns[4] = "300点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xA8AF3DC0
			jns[8] = 0xA8AF3DC0
			jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
	elseif jn == "天命剑法" then
			jns[1] = "率意而行、道法自然，在五庄弟子出手之际，他自身也道不出这—招之中蕴含了多少剑意。或许，只有冥冥之中的三清可知吧？\n以无人能够预知的剑术攻击目标，对其随机发动1~7次物理攻击。\n使用后下回合不能行动。"
			jns[3] = 4
			jns[4] = "（最大气血的2%×攻击次数）点气血"
			jns[5] = "当前气血比例≥70%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x30EA31AF
			jns[8] = 0x30EA31AF
			jns[12] = "冷却4回合"
	elseif jn == "鸿渐于陆" then
			jns[1] = "对一伤其十指，不如断其一指，必要的时刻可以将伤害凝聚起来，给予敌方一次致命的攻击。附加（武器伤害×130%）的伤害，对敌方单体进行攻击，使目标100%几率中暗器毒"
			jns[3] = 4
			jns[4] = "100点魔法血"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x18D93692
			jns[8] = 0x18D93692
			jns[12] = "冷却4回合"
	elseif jn == "百爪狂杀" then
			jns[1] = "【被动】你被封印的几率增加20%\n法术驱动的必中物理攻击，可攻击多个目标(最多4个目标)；每增加1个攻击目标，对所有目标的伤害结果降低10%。作用目标按速度排序选择。如果你的武器带有“必中”特效，则提升10%(3%)的伤害结果。（括号内为目标为NPC时的效果）"
			jns[3] = 4
			jns[4] = "35点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8FCE05BE
			jns[8] = 0x8FCE05BE
	elseif jn == "顺势而为" then
			jns[1] = "精于封印的方寸弟子可以耗费一定的愤怒值对目标施加强大的法力，100%封印目标的法术能力，封印效果持续2回合。"
			jns[3] = 4
			jns[4] = "60点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x9E6FFF66
			jns[8] = 0x9E6FFF66
			jns[12] = "冷却6回合"
	elseif jn == "落花成泥" then
			jns[1] = "靡靡之音进入敌人耳际，使目标下回合彷徨不知所措、额外受到24%伤害，同时100%几率无法进行除灵宝以外的任何行动。（不受化生寺门派特色影响)"
			jns[3] = 4
			jns[4] = "20点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4D94B673
			jns[8] = 0x4D94B673
			jns[12] = "冷却4回合"
	elseif jn == "妖风四起" then
			jns[1] = "驱动妖风封印敌人，使其不能使用法术，持续2回合。成功率与成功率上限为（夺魄令成功率+40%）；该封印不能被水清、冰清、玉清、晶清解除（对NPC时该效果无效)"
			jns[3] = 4
			jns[4] = "（当前气血×40%）点气血，100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8295E360
			jns[8] = 0x8295E360
			jns[12] = "冷却4回合"
	elseif jn == "雷浪穿云" then
			jns[1] = "当那天地间卷起的白浪与电闪中的云彩揉成一片，任谁都无力承担神龙见首不见尾的后续打击。对目标使用后，目标在5回合内受到的所有法术伤害提高30%，使用法术技能消耗魔法增加(100%+30)点。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x77EC444B
			jns[8] = 0x77EC444B
	elseif jn == "凋零之歌" then
			jns[1] = "歌声飘进敌人的耳中，颤动着敌人心窝，在无形中侵袭着敌阵的斗志，埋下毁灭之种。消耗所有风灵，获得下述效果：\n1.使目标接下来2回合受到的法术伤害增加16+(2×消耗风灵层数)%。\n2.使随机敌方单位共计获得(3+消耗风灵层数×0.5)层“雾杀”效果。\n3.该技能不触发“重光”。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x281E732A
			jns[8] = 0x281E732A
			jns[12] = "冷却8回合"
	elseif jn == "画地为牢" then
			jns[1] = "天宫经脉介绍：天宫弟子随手布下的囚牢，却是无数穷凶极恶之徒的饮恨之所。对敌方使用后，降低敌方1个单位18%的抵抗封印能力以及24%的封印能力，持续5回合"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBAF731FA
			jns[8] = 0xBAF731FA
			jns[12] = "冷却8回合"
	elseif jn == "碎玉弄影" then
			jns[1] = "“宁为玉碎，不为瓦全”，又有多少敌方可以从女儿村弟子曼妙的舞姿身影中体味那一份决绝呢？连续对敌方使用2次似玉生香。"
			jns[3] = 4
			jns[4] = "40点愤怒,技能消耗"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x347D755D
			jns[8] = 0x347D755D
			jns[12] = "冷却5回合"
	elseif jn == "妙悟" then
			jns[1] = "回复目标一定气血（效果与等级、治疗能力相关)"
			jns[3] = 5
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2F3B9A81
			jns[8] = 0x2F3B9A81
			jns[12] = "冷却2回合"
	elseif jn == "清风望月" then
			jns[1] = "五庄观的弟子可以于乾坤腾挪之中领悟妙法，吸收2个队友身上的封印效果，但会使自己进入疯狂状态2回合。"
			jns[3] = 5
			jns[4] = "40点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8FE977C4
			jns[8] = 0x8FE977C4
			jns[12] = "冷却4回合"
	elseif jn == "钟馗论道" then
			jns[1] = "为自己附加“钟馗论道”状态，获得下述效果，持续5回合：\n1.五雷咒伤害提高70%；\n2.该效果不会被驱散；\n3.回合结束时减少自身“锢魂术”“死亡禁锢”1回台持续时间。"
			jns[3] = 66
			jns[4] = "80点魔法法"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB7CDB6AA
			jns[8] = 0xB7CDB6AA
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "渡劫金身" then
			jns[1] = "进给目标附加一个状态，持续2个回合或目标死亡。状态消失时，恢复目标一定气血、气血上限(效果与等级、治疗能力相关)。"
			jns[3] = 5
			jns[4] = "10点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x3819B112
			jns[8] = 0x3819B112
			jns[12] = "冷却4回合"
	elseif jn == "诸天看护" then
			jns[1] = "虔诚的信仰会带来更强大的力量。移除目标身上的来自于你的“金刚护法、金刚护体、一苇渡江”效果，增加目标单位1.5%×(1+被移除的状态数量)的物法伤害，持续到战斗结束。（最多增加12%)"
			jns[3] = 5
			jns[4] = "100点魔法，10点愤怒怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xED073209
			jns[8] = 0xED073209
			jns[12] = "冷却8回合"
	elseif jn == "真君显灵" then
			jns[1] = "敲动战鼓，一鼓作气拿下敌人。消耗自身所有（≥1）战意进入“真君显灵”状态，持续3回合（不可驱散）：使自己造成的物理伤害增加(20%×使用时消耗战意数)；消耗的超级战意使该效果翻倍。回合结束时获得1点战意"
			jns[3] = 66
			jns[4] = "100点魔法，自身所有战意"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4017404F
			jns[8] = 0x4017404F
			jns[12] = "冷却8回合"
	elseif jn == "波澜不惊" then
			jns[1] = "移普陀山弟子由于精通五行造化，方可布下这吸收一切伤害的结界阵法。为目标吸收受到的前4次攻击的伤害，持续2回合；并且将吸收的伤害转化为目标的当前气血回复，最高可吸收（普度众生首回合治疗量×2)点气血伤害。这亦是五行学派的不传之秘，只有核心弟子方能习得。"
			jns[3] = 5
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xAED0F931
			jns[8] = 0xAED0F931
	elseif jn == "莲心剑意" then
			jns[1] = "普陀山的弟子情系众生、虔心不染，如一朵莲花绽放在凡尘中。但江湖险恶、妖风魔雨，为了护佑苍生，她们也不得不常怀剑意，惩恶除奸。使用此法术后进入进攻状态，增加（法术修炼等级×3%）的固定伤害结果（只对首目标有效）， 降低10%的回复效果。(再次使用此技能进入正常状态)"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xC2D6BBD3
			jns[8] = 0xC2D6BBD3
	elseif jn == "同舟共济" then
			jns[1] = "为目标友方分担前6次受到的伤害，持续到本回合结束。目标友方承受25%伤害，你承受25%伤害。"
			jns[3] = 5
			jns[4] = "200点魔法"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x57365436
			jns[8] = 0x57365436
			jns[12] = "冷却4回合"
	elseif jn == "心随意动" then
			jns[1] = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另一个世界。激活后（再次使用关闭此状态），持续8回合后自动关闭。\n清心羽客:增加（七星遁等级×2.2）的封印命中等级\n乾坤力士:持续回合内增加（七星遁等级×2.2)的伤害力。"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFD5AC0B0
			jns[8] = 0xFD5AC0B0

	elseif jn == "莲花心音" then
			jns[1] = "普陀弟子以莲花苞为躯，引魂入体，则可以复活在战斗中死亡的鬼魂幻兽。复活场上一个处于死亡状态的鬼魂宠，被复活目标获得60%的气血上限与当前48%的魔法。"
			jns[3] = 5
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x07DEBF4F
			jns[8] = 0x07DEBF4F

	----------------------------------------------------------------------------------------空
	elseif jn == "毒萃" then
			jns[1] = "使用后你的蛊树迷瘴附加“雾杀”的几率提高100%，持续5回合（包括当前回合）。"
			jns[3] = 66
			jns[4] = "300点魔法，1点风灵"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4935E53B
			jns[8] = 0x4935E53B
	elseif jn == "电光火石" then
			jns[1] = "使使用后同时获得“霹雳弦惊”和“雷怒霆激”状态。"
			jns[3] = 66
			jns[4] = "140点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x0A9E4158
			jns[8] = 0x0A9E4158
			jns[12] = "冷却9回合，死亡后冷却重置为9回合"
	elseif jn == "魍魉追魂" then
			jns[1] = "地府弟子可以招来地狱深处的魑魅魍魉协助队友进行攻击。对本方一个死亡的单位附加“魍魉追魂”\n造成的物理法术伤害提高(4+2×N)%,N为本方带有“魍魉追魂”的单位数，持续到战斗结束（不可驱散）。"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDAA0F7D4
			jns[8] = 0xDAA0F7D4
			jns[12] = "冷却4回合"
	elseif jn == "噬毒" then
			jns[1] = "净化一个敌方单位带有的“尸腐毒”，受到（人物等级×10）点伤害，但是你的下一个六道无量造成伤害提高60%，下一个百爪狂杀造成伤害提高60%；若目标不带有“尸腐毒”效果，你随机获得其中一个增益状态且不会受到伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBF44D568
			jns[8] = 0xBF44D568
			jns[12] = "冷却8回合"
	elseif jn == "雷霆汹涌" then
			jns[1] = "消耗“天雷灌注”对多个目标进行法术攻击(最多6个目标)"
			jns[3] = 4
			jns[4] = "35点魔法*作用人数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000153
			jns[8] = 0x00000153
	elseif jn == "最佳搭档" then-------主动没写
			jns[1] = "消耗1层“狮魂”，对一个目标发动一次物理攻击，这次攻击无法被保护。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "“变身”状态，“狮魂”层数≥1"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000379
			jns[8] = 0x00000379
			jns[12] = "冷却8回合"
	elseif jn == "困兽之斗" then-------主动没写
			jns[1] = "进行一次猛烈的物理攻击，伤害倍率为110%。若处于“狂怒”状态，有50%的几率额外攻击一次。若击倒了玩家单位，则获得5回合的“狂怒”状态。"
			jns[3] = 4
			jns[4] = "10%当前气血、100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000149
			jns[8] = 0x00000149
			jns[12] = "冷却8回合"
	elseif jn == "威仪九霄" then
			jns[1] = "被动】每回合开始时，威仪九霄的伤害倍率增加3%，魔法消耗增加100点（最多叠加30次)\n对所有目标造成10%的物理伤害，使用后清空叠加次数。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000292
		    jns[8] = 0x00000292
			jns[12] = "冷却6回合,战斗开始具有3回合冷却"
	elseif jn == "牵魂蛛丝" then
			jns[1] = "对目标附加持续1回合的“天罗地网”状态，随后对所有带有你“天罗地网”的单位发动1次攻击。"
			jns[3] = 4
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000233
	     	jns[8] = 0x00000233
			jns[12] = "冷却8回合"
	elseif jn == "绝处逢生" then
			jns[1] = "恢复自身损失的50%气血及自身损失的50%气血上限，速度增加10%，持续3回合。（不可驱散)"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000129
			jns[8] = 0x00000129
			jns[12] = "冷却5回合,战斗开始时具有5回合冷却"
	elseif jn == "耳目一新" then
			jns[1] = "移除当前天眼神通的增益效果，并再次使用天眼神通，至少获得2种效果并且会优先获得不同的增益效果。"
			jns[3] = 66
			jns[4] = "300点魔法、1点战意法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000048
			jns[8] = 0x00000048
			jns[12] = "冷却24回合"
	elseif jn == "五雷挪移" then
			jns[1] = "进入雷法真身，将你的“雷法”强化光“五雷正法”：使用雷法时，五雷咒会消耗已有的雷法强化效果，再转化当前符咒，持续10回合"
			jns[3] = 66
			jns[4] = "50点魔法法"
			jns[5] = "仅能在5枚符咒时使用"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000302
			jns[8] = 0x00000302
	elseif jn == "潜龙在渊" then
			jns[1] = "移除自身“龙魂”和“龙骇”状态，每个被移除状态使你获得1层以下对应增益，持续到战斗结束：\n龙魂：造成的法术伤害提高1%。\n龙骇：对应被增益的龙腾或龙卷雨击伤害提高2%。(不可驱散)"
			jns[3] = 66
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000235
			jns[8] = 0x00000235
			jns[12] = "冷却8回合"
	elseif jn == "无赦咒令" then
			jns[1] = "对目标发起物理攻击，伤害为普通攻击的110%，随机驱散目标1个增益状态，如果目标带毒类异常，则驱散2个。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000300
			jns[8] = 0x00000300
	elseif jn == "生杀予夺" then
			jns[1] = "对一个目标发起一次物理攻击，伤害为普通攻击的230%：\n1.若目标带毒，此次攻击暴击伤害倍率增加60%；\n2.队伍中只有一个 弟子时：回合结束时额外减少（敌方场上尸腐毒数量×2）的冷却回合。"
			jns[3] = 4
			jns[4] = "100点魔法血"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000256
			jns[8] = 0x00000256
			jns[12] = "冷却36回合"
	elseif jn == "雷法翻天" then
			jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对召唤兽造成的伤害提高35%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000151
			jns[8] = 0x00000151
	elseif jn == "雷法倒海" then
			jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对玩家单位造成的伤害提高8%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000150
			jns[8] = 0x00000150
	elseif jn == "秘传三昧真火" then
			jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对单个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与目标当前气血和目标最大气血有关。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000194
			jns[8] = 0x00000194
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "秘传飞砂走石" then
			jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对多个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与目标当前气血和目标最大气血有关。"
			jns[3] = 4
			jns[4] = "60点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000193
			jns[8] = 0x00000193
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "摧枯拉朽" then
			jns[1] = "替换天赋：翩鸿一击:对目标发动一次必定触发套装追加法术的物理攻击。"
			jns[3] = 4
			jns[4] = "300点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000023
			jns[8] = 0x00000023
			jns[12] = "冷却30回合,战斗开始具有15回合冷却。"
	elseif jn == "披挂上阵" then
			jns[1] = "连续攻击同一个目标3次，每次攻击均有几率触发套装追加法术。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000219
			jns[8] = 0x00000219
			jns[12] = "冷却10回合,战斗开始具有5回合冷却 "
	elseif jn == "绝命毒牙" then
			jns[1] = "对目标发动一次致命攻击。\n1.对目标造成150%的伤害；\n2.激发目标身上的“天罗地网”状态， 提高（天罗地网剩余回合数×50%)的伤害，使用后休息1回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000131
			jns[8] = 0x00000131
			jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
	-----女儿村改版的技能
	elseif jn == "嫣然曼舞" then
			jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击不增加目标的愤怒，且减少目标8点愤怒。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000322
			jns[8] = 0x00000322
	elseif jn == "惊鸿起舞" then
			jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，首目标的伤害提高50%(10%)。（括号里为目标为NPC时的效果）"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000115
			jns[8] = 0x00000115
	elseif jn == "风回旋舞" then
			jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击有50%几率额外造成50%伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000056
			jns[8] = 0x00000056
	elseif jn == "映日妙舞" then
			jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，受到你的伤害的敌人本回合对你造成的伤害降低15%"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000337
			jns[8] = 0x00000337
	elseif jn == "余韵索心" then
			jns[1] = "余韵萦心，最完美的谢幕：\n1.仅能在“重拍”使用，攻击敌方单个目标，伤害倍率为220%，使用后进入休息状态。\n2.若学习了“天籁”，乐韵提高伤害的效果增加至50%。\n3.若学习了“即兴”，该技能可在“轻拍”起舞\n4.若学习了“夺目”，使用技能前会先将“夺目”转化为“返场”，持续回合与夺目层数相同。\n返场回合内，使用该技能不会进入休息状态但也不再会获得“夺目”，且可无视音律使用。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000343
			jns[8] = 0x00000343
    elseif jn == "百草神木复苏" then-------------------------神木林
			jns[1] = "复活所有队友并恢复全体气血和气血上限。红黄蓝灵药各5颗"
			jns[3] = 66
			jns[4] = "300点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1A899ACD
			jns[8] = 0x1A899ACD
	elseif jn == "百草复苏" then
			jns[1] = "复活队友并恢复气血和气血上限。红黄蓝灵药各1颗"
			jns[3] = 5
			jns[4] = "150点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x9769021C
			jns[8] = 0x9769021C
    elseif jn == "百草古树长青" then
			jns[1] = "为友方单位回复气血\n#Y附加万灵诸念×8加上自身法伤10%的治疗能力,按等级提升治疗能力系数，并施加等值的护盾。"
			jns[3] = 5
			jns[4] = "100点魔法，红黄蓝药灵各1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000137
			jns[8] = 0x00000137
			jns[12] = "冷却10回合"
	elseif jn == "百草十香" then
			jns[1] = "解除友方目标酒类异常状态"
			jns[3] = 5
			jns[4] = "50点魔法，红色药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
	elseif jn == "百草定神" then
			jns[1] = "解除友方目标经脉产生的异常状态。"
			jns[3] = 5
			jns[4] = "50点魔法，蓝色药灵1颗"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
    elseif jn == "百草红雪" then
			jns[1] = "解除友方目标毒类异常状态。"
			jns[3] = 5
			jns[4] = "50点魔法，黄色药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
    elseif jn == "百草回春龙沙" then
			jns[1] = "解除全体友方目标非经脉、非封类、非酒类、非毒类的常规异常状态"
			jns[3] = 5
			jns[4] = "100点魔法，红黄蓝药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000122
		    jns[8] = 0x00000122


--九黎城
	elseif jn == "九黎战歌" then
			jns[1] = "战鼓坚将，战魂不息，九黎之歌荡碲天地，激昂族人之志。效果：提高角色的气血"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000717  ---大
			jns[8] = 0x10000718
	elseif jn == "魂枫战舞" then
			jns[1] = "魂枫翩扦，弈弈如战，英气磅礴，永不息止。 效果：提高角色的伤害"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000714  ---大
			jns[8] = 0x10000715
	elseif jn == "兵铸乾坤" then
			jns[1] = "九黎魔息，燎天之焰，铸魂成兵。乾坤在握。效果：提高角色的灵力"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000750  ---大
			jns[8] = 0x10000751
	elseif jn == "燃铁飞花" then
			jns[1] = "战意如火，叱咤生花，九黎之子，铁士无畏。效果：提高角色的命中"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000732  ---大
			jns[8] = 0x10000733
	elseif jn == "战火雄魂" then
			jns[1] = "九黎之魂，犹燎原之火，燃万丈烈焰，直胜利之巅。效果：提高角色的防御"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000746 ---大
			jns[8] = 0x10000747
	elseif jn == "魔神降世" then
			jns[1] = "聆听兵主密命，得赐魔神之力，战无不胜，天地可征。效果：提高角色的魔法"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000724  ---大
			jns[8] = 0x10000725
	elseif jn == "风行九黎" then
			jns[1] = "风所行处，九黎无阻，越古穿今，无迹不至。效果：提高角色的速度"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000756  ---大
			jns[8] = 0x10000757


	elseif jn == "黎魂" then
			jns[1] = "每回合可以释放2-3个师门技能。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000015
			jns[8] = 0x10000016
	elseif jn == "战鼓" then
			jns[1] = "使用师门技能攻击敌人时会累加连击值，连击值越大，下回合离魂触发3个技能概率越高。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000017
			jns[8] = 0x10000018
	elseif jn == "怒哮" then
			jns[1] = "使用一斧开天后如果目标没用处于浮空状态。45%概率获得怒哮，下一次使用一斧开天和三荒尽灭令目标进入浮空成功率大幅增加，当使用一斧开天或三荒尽灭令目标成功浮空时。移除该效果，自身到底时移除该效果。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000019
			jns[8] = 0x10000020
	elseif jn == "炎魂" then
			jns[1] = "属性点加成统一按照魔族成长。与玩家战斗时，使用师门技能会临时将自身防御的5%-10%转为伤害力。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000021
			jns[8] = 0x10000022
	elseif jn == "枫影二刃" then
			jns[1] = "战歌鸣。怒啸起，枫林迎战舞，英魂影重重。\n#Y对敌方单个目标连续发动2次物理攻击，使用后自己有概率获得怒啸。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "魂枫战舞技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000023
			jns[8] = 0x10000024
	elseif jn == "一斧开天" then
			jns[1] = "一斧开天，气魄乾坤，以往昔之魄，凝今时之至。\n#Y对敌方单个目标连续发动2次物理攻击，使用后有概率令目标进入浮空状态，持续到你的行动结束。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "兵铸乾坤技能达到30级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000027
			jns[8] = 0x10000028
	elseif jn == "三荒尽灭" then
			jns[1] = "横空霹雳。惊三荒。煞四野。昭吾九黎之威。\n#Y对敌方3个目标发动物理攻击，并令所有目标有概率进入浮空状态，持续到你的行动结束。"
			jns[3] = 4
			jns[4] = "150点魔法"
			jns[5] = "燃铁飞花技能达到30级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000025
			jns[8] = 0x10000026
	elseif jn == "铁火双扬" then
			jns[1] = "炼铁之势，破云千里，战魄凌空，独步天下。\n#Y令敌方2个目标浮空。"
			jns[3] = 4
			jns[4] = "20点魔法*目标数"
			jns[5] = "燃铁飞花技能达到120级，且人物飞升"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000025
			jns[8] = 0x10000026
			jns[12] = "8回合"
	elseif jn == "铁血生风" then
			jns[1] = "铁血凝咦，颊风而起。敌逢吾威，食尘饮悔。\n#Y对敌人单个目标发动物理攻击，如果目标处于浮空状态，额外发动1-2次物理攻击。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "战火雄魂技能达到60级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000029
			jns[8] = 0x10000030
	elseif jn == "力劈苍穹" then
			jns[1] = "魔神垂止，上古魔息浩若狂澜。兵主赐威，穹顶之下唯吾独行。\n#Y对敌方全部处于浮空状态的目标连续发动2-3次物理攻击，然后取消全部目标的浮空状态。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "魔神降世技能达到50级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000031
			jns[8] = 0x10000032
	elseif jn == "故壤归心" then
			jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
			jns[3] = 0
			jns[4] = "10点气血、10点魔法"
			jns[5] = "风行九黎技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000033
			jns[8] = 0x10000034
	elseif jn == "魔神之刃" then--写完ok
			jns[1] = "使用一次特殊的力辟苍穹，造成的伤害提高10%并且暴击伤害倍率增加100%，但仅作用1个浮空目标。（战斗开始时具有2回合冷却）"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000071
			jns[8] = 0x10000072
			jns[12] = "8回合"


	elseif jn == "偷龙转凤" then
		jns[1] = "对单个目标造成10%当前气血,并恢复自己目标损失的气血,使用偷龙转凤后本方所有单位将免除治疗削弱,持续3回合。"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC3BF2DE7
		jns[8] = 0xC3BF2DE7
		jns[12] = "5回合"







	else
		jns[1] = "无图片报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA209C3C2
		jns[8] = 0xA209C3C2
	end
	return jns
end












function 引擎.取奇经八脉技能(jn)

local jns = {}
---------------------------------------------------------------------------------------------------------------------------奇经八脉主动技能
if jn == "亢龙归海" then
		jns[1] = "矫健的神龙翻腾四海的英姿很少有人目睹，而之后更无人能够道出其中的神威。\n使用龙腾连续攻击2次目标，每次造成龙腾伤害的95%，使用后息1回合。"
		jns[3] = 4
		jns[4] = "200点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCE07792D
		jns[8] = 0xCE07792D
		jns[12] = "冷却6回合"
elseif jn == "魔焰滔天" then
		jns[1] = "为了能给敌人造成更大的伤害，的弟子是不怕赌上自己运气的。\n使用法术攻击目标，70%几率造成三昧真火法术伤害×175%，30%几率造成三昧真火法术伤害×25%。不受佛法无边影响。"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x525B9DB0
		jns[8] = 0x525B9DB0
		jns[12] = "冷却6回合，战斗开始时具有3回合冷却"
elseif jn == "风卷残云" then
		jns[1] = "神木林在觉醒，风在咆哮！大风带着神木林弟子的怒意无情的打击面前的敌人。\n消耗所有风灵使用一次落叶萧萧，伤害结果提高（消耗风灵数×16%)。该技能不触发“重光”，但佩戴“月影”时额外提高12%伤害并消耗1点灵气。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3778487D
		jns[8] = 0x3778487D
		jns[12] = "冷却6回合，战斗开始时具有3回合冷却却"
elseif jn == "风雷韵动" then
		jns[1] = "以法术攻击敌方单体目标，造成110%的法术伤害。对带有“电芒”的单位额外提高40%的伤害。"
		jns[3] = 4
		jns[4] = "60点魔法，10点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x169010C9
		jns[8] = 0x169010C9
elseif jn == "长驱直入" then
		jns[1] = "替换天赋：翩鸿一击:使用该技能攻击时,目标无法被保护。\n伤害结果为普通攻击的110%；同时60%几率对目标附加“重创”\n状态:回复效果降低30%并且受到施法者的伤害增加10%。法术驱动的物理攻击,持续2回合。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAB6EA7B4
		jns[8] = 0xAB6EA7B4
		jns[12] = "冷却6回合"
elseif jn == "天神怒斩" then
		jns[1] = "天神盛怒，以开天辟地之势，挥刀怒斩：\n1.增加25%暴击几率、忽略目标25%防御发动一次物理攻击，\n命中后驱散目标随机一个增益状态。\n2.若自身战意为1，造成额外50%伤害，否则造成25%额外伤害。\n3.每次使用后本场战斗该技能伤害永久提高25%（目标为NPC时为50%）。\n4.使用天崩地裂和翻江搅海会减少这个技能1回合的冷却回合。"
		jns[3] = 4
		jns[4] = "300点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA8AF3DC0
		jns[8] = 0xA8AF3DC0
		jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
elseif jn == "天命剑法" then
		jns[1] = "率意而行、道法自然，在五庄弟子出手之际，他自身也道不出这—招之中蕴含了多少剑意。或许，只有冥冥之中的三清可知吧？\n以无人能够预知的剑术攻击目标，对其随机发动1~7次物理攻击。\n使用后下回合不能行动。"
		jns[3] = 4
		jns[4] = "（最大气血的2%×攻击次数）点气血"
		jns[5] = "当前气血比例≥70%"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x30EA31AF
		jns[8] = 0x30EA31AF
		jns[12] = "冷却4回合"
elseif jn == "鸿渐于陆" then
		jns[1] = "对一伤其十指，不如断其一指，必要的时刻可以将伤害凝聚起来，给予敌方一次致命的攻击。附加（武器伤害×130%）的伤害，对敌方单体进行攻击，使目标100%几率中暗器毒"
		jns[3] = 4
		jns[4] = "100点魔法血"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x18D93692
		jns[8] = 0x18D93692
		jns[12] = "冷却4回合"
elseif jn == "百爪狂杀" then
		jns[1] = "【被动】你被封印的几率增加20%\n法术驱动的必中物理攻击，可攻击4个目标；每增加1个攻击目标，对所有目标的伤害结果降低10%。作用目标按速度排序选择。如果你的武器带有“必中”特效，则提升10%(3%)的伤害结果。（括号内为目标为NPC时的效果）"
		jns[3] = 4
		jns[4] = "35点魔法*目标数"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8FCE05BE
		jns[8] = 0x8FCE05BE
elseif jn == "顺势而为" then
		jns[1] = "精于封印的方寸弟子可以耗费一定的愤怒值对目标施加强大的法力，100%封印目标的法术能力，封印效果持续2回合。"
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9E6FFF66
		jns[8] = 0x9E6FFF66
		jns[12] = "冷却6回合"
elseif jn == "落花成泥" then
		jns[1] = "靡靡之音进入敌人耳际，使目标下回合彷徨不知所措、额外受到24%伤害，同时100%几率无法进行除灵宝以外的任何行动。（不受化生寺门派特色影响)"
		jns[3] = 4
		jns[4] = "20点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4D94B673
		jns[8] = 0x4D94B673
		jns[12] = "冷却4回合"
elseif jn == "妖风四起" then
		jns[1] = "驱动妖风封印敌人，使其不能使用法术，持续2回合。成功率与成功率上限为（夺魄令成功率+40%）；该封印不能被水清、冰清、玉清、晶清解除（对NPC时该效果无效)"
		jns[3] = 4
		jns[4] = "（当前气血×40%）点气血，100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8295E360
		jns[8] = 0x8295E360
		jns[12] = "冷却4回合"
elseif jn == "雷浪穿云" then
		jns[1] = "当那天地间卷起的白浪与电闪中的云彩揉成一片，任谁都无力承担神龙见首不见尾的后续打击。对目标使用后，目标在5回合内受到的所有法术伤害提高30%，使用法术技能消耗魔法增加(100%+30)点。"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x77EC444B
		jns[8] = 0x77EC444B
elseif jn == "凋零之歌" then
		jns[1] = "歌声飘进敌人的耳中，颤动着敌人心窝，在无形中侵袭着敌阵的斗志，埋下毁灭之种。消耗所有风灵，获得下述效果：\n1.使目标接下来2回合受到的法术伤害增加16+(2×消耗风灵层数)%。\n2.使随机敌方单位共计获得(3+消耗风灵层数×0.5)层“雾杀”效果。\n3.该技能不触发“重光”。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x281E732A
		jns[8] = 0x281E732A
		jns[12] = "冷却8回合"
elseif jn == "画地为牢" then
		jns[1] = "天宫经脉介绍：天宫弟子随手布下的囚牢，却是无数穷凶极恶之徒的饮恨之所。对敌方使用后，降低敌方1个单位18%的抵抗封印能力以及24%的封印能力，持续5回合"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBAF731FA
		jns[8] = 0xBAF731FA
		jns[12] = "冷却8回合"
elseif jn == "碎玉弄影" then
		jns[1] = "“宁为玉碎，不为瓦全”，又有多少敌方可以从女儿村弟子曼妙的舞姿身影中体味那一份决绝呢？连续对敌方使用2次似玉生香。"
		jns[3] = 4
		jns[4] = "40点愤怒,技能消耗"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x347D755D
		jns[8] = 0x347D755D
		jns[12] = "冷却5回合"
elseif jn == "妙悟" then
		jns[1] = "回复目标一定气血（效果与等级、治疗能力相关)"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2F3B9A81
		jns[8] = 0x2F3B9A81
		jns[12] = "冷却2回合"
elseif jn == "莲花心音" then
		jns[1] = "普陀弟子以莲花苞为躯，引魂入体，则可以复活在战斗中死亡的鬼魂幻兽。复活场上一个处于死亡状态的鬼魂宠，被复活目标获得60%的气血上限与当前48%的魔法。"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x07DEBF4F
		jns[8] = 0x07DEBF4F
elseif jn == "清风望月" then
		jns[1] = "五庄观的弟子可以于乾坤腾挪之中领悟妙法，吸收2个队友身上的封印效果，但会使自己进入疯狂状态2回合。"
		jns[3] = 5
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8FE977C4
		jns[8] = 0x8FE977C4
		jns[12] = "冷却4回合"
elseif jn == "钟馗论道" then
		jns[1] = "为自己附加“钟馗论道”状态，获得下述效果，持续5回合：\n1.五雷咒伤害提高70%；\n2.该效果不会被驱散；\n3.回合结束时减少自身“锢魂术”“死亡禁锢”1回台持续时间。"
		jns[3] = 66
		jns[4] = "80点魔法法"
		jns[5] = "当前气血比例≥50%"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB7CDB6AA
		jns[8] = 0xB7CDB6AA
		jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
elseif jn == "渡劫金身" then
		jns[1] = "进给目标附加一个状态，持续2个回合或目标死亡。状态消失时，恢复目标一定气血、气血上限(效果与等级、治疗能力相关)。"
		jns[3] = 5
		jns[4] = "10点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3819B112
		jns[8] = 0x3819B112
		jns[12] = "冷却4回合"
elseif jn == "诸天看护" then
		jns[1] = "虔诚的信仰会带来更强大的力量。移除目标身上的来自于你的“金刚护法、金刚护体、一苇渡江”效果，增加目标单位1.5%×(1+被移除的状态数量)的物法伤害，持续到战斗结束。（最多增加12%)"
		jns[3] = 5
		jns[4] = "100点魔法，10点愤怒怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xED073209
		jns[8] = 0xED073209
		jns[12] = "冷却8回合"
elseif jn == "真君显灵" then
		jns[1] = "敲动战鼓，一鼓作气拿下敌人。消耗自身所有（≥1）战意进入“真君显灵”状态，持续3回合（不可驱散）：使自己造成的物理伤害增加(20%×使用时消耗战意数)；消耗的超级战意使该效果翻倍。回合结束时获得1点战意"
		jns[3] = 66
		jns[4] = "100点魔法，自身所有战意"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4017404F
		jns[8] = 0x4017404F
		jns[12] = "冷却8回合"
elseif jn == "波澜不惊" then
		jns[1] = "移普陀山弟子由于精通五行造化，方可布下这吸收一切伤害的结界阵法。为目标吸收受到的前4次攻击的伤害，持续2回合；并且将吸收的伤害转化为目标的当前气血回复，最高可吸收（普度众生首回合治疗量×2)点气血伤害。这亦是五行学派的不传之秘，只有核心弟子方能习得。"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAED0F931
		jns[8] = 0xAED0F931
elseif jn == "莲心剑意" then
		jns[1] = "普陀山的弟子情系众生、虔心不染，如一朵莲花绽放在凡尘中。但江湖险恶、妖风魔雨，为了护佑苍生，她们也不得不常怀剑意，惩恶除奸。使用此法术后进入进攻状态，增加（法术修炼等级×3%）的固定伤害结果（只对首目标有效）， 降低10%的回复效果。(再次使用此技能进入正常状态)"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC2D6BBD3
		jns[8] = 0xC2D6BBD3
elseif jn == "同舟共济" then
		jns[1] = "为目标友方分担前6次受到的伤害，持续到本回合结束。目标友方承受25%伤害，你承受25%伤害。"
		jns[3] = 5
		jns[4] = "200点魔法"
		jns[5] = "当前气血比例≥50%"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x57365436
		jns[8] = 0x57365436
		jns[12] = "冷却4回合"
elseif jn == "心随意动" then
		jns[1] = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另一个世界。激活后（再次使用关闭此状态），持续8回合后自动关闭。\n清心羽客:增加（七星遁等级×2.2）的封印命中等级\n乾坤力士:持续回合内增加（七星遁等级×2.2)的伤害力。"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD5AC0B0
		jns[8] = 0xFD5AC0B0
----------------------------------------------------------------------------------------空
elseif jn == "毒萃" then
		jns[1] = "使用后你的蛊树迷瘴附加“雾杀”的几率提高100%，持续5回合（包括当前回合）。"
		jns[3] = 66
		jns[4] = "300点魔法，1点风灵"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4935E53B
		jns[8] = 0x4935E53B
elseif jn == "电光火石" then
		jns[1] = "使使用后同时获得“霹雳弦惊”和“雷怒霆激”状态。"
		jns[3] = 66
		jns[4] = "140点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0A9E4158
		jns[8] = 0x0A9E4158
		jns[12] = "冷却9回合，死亡后冷却重置为9回合"
elseif jn == "魍魉追魂" then
		jns[1] = "地府弟子可以招来地狱深处的魑魅魍魉协助队友进行攻击。对本方一个死亡的单位附加“魍魉追魂”\n造成的物理法术伤害提高(4+2×N)%,N为本方带有“魍魉追魂”的单位数，持续到战斗结束（不可驱散）。"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDAA0F7D4
		jns[8] = 0xDAA0F7D4
		jns[12] = "冷却4回合"
elseif jn == "噬毒" then
		jns[1] = "净化一个敌方单位带有的“尸腐毒”，受到（人物等级×10）点伤害，但是你的下一个六道无量造成伤害提高60%，下一个百爪狂杀造成伤害提高60%；若目标不带有“尸腐毒”效果，你随机获得其中一个增益状态且不会受到伤害。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBF44D568
		jns[8] = 0xBF44D568
		jns[12] = "冷却8回合"
elseif jn == "雷霆汹涌" then
		jns[1] = "消耗“天雷灌注”对多个目标进行法术攻击(最多6个目标)。"
		jns[3] = 4
		jns[4] = "35点魔法*作用人数"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000153
		jns[8] = 0x00000153
elseif jn == "最佳搭档" then-------主动没写
		jns[1] = "消耗1层“狮魂”，对一个目标发动一次物理攻击，这次攻击无法被保护。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“变身”状态，“狮魂”层数≥1"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000379
		jns[8] = 0x00000379
		jns[12] = "冷却8回合"
elseif jn == "困兽之斗" then-------主动没写
		jns[1] = "进行一次猛烈的物理攻击，伤害倍率为110%。若处于“狂怒”状态，有50%的几率额外攻击一次。若击倒了玩家单位，则获得5回合的“狂怒”状态。"
		jns[3] = 4
		jns[4] = "10%当前气血、100点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000149
		jns[8] = 0x00000149
		jns[12] = "冷却8回合"
elseif jn == "威仪九霄" then
		jns[1] = "被动】每回合开始时，威仪九霄的伤害倍率增加3%，魔法消耗增加100点（最多叠加30次)\n对所有目标造成10%的物理伤害，使用后清空叠加次数。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000292
		jns[8] = 0x00000292
		jns[12] = "冷却6回合,战斗开始具有3回合冷却"
elseif jn == "牵魂蛛丝" then
		jns[1] = "对目标附加持续1回合的“天罗地网”状态，随后对所有带有你“天罗地网”的单位发动1次攻击。"
		jns[3] = 4
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000233
		jns[8] = 0x00000233
		jns[12] = "冷却8回合"
elseif jn == "绝处逢生" then
		jns[1] = "恢复自身损失的50%气血及自身损失的50%气血上限，速度增加10%，持续3回合。（不可驱散)"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000129
		jns[8] = 0x00000129
		jns[12] = "冷却5回合,战斗开始时具有5回合冷却"
elseif jn == "耳目一新" then
		jns[1] = "移除当前天眼神通的增益效果，并再次使用天眼神通，至少获得2种效果并且会优先获得不同的增益效果。"
		jns[3] = 66
		jns[4] = "300点魔法、1点战意法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000048
		jns[8] = 0x00000048
		jns[12] = "冷却24回合"
elseif jn == "五雷挪移" then
		jns[1] = "进入雷法真身，将你的“雷法”强化光“五雷正法”：使用雷法时，五雷咒会消耗已有的雷法强化效果，再转化当前符咒，持续10回合"
		jns[3] = 66
		jns[4] = "50点魔法法"
		jns[5] = "仅能在5枚符咒时使用"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000302
		jns[8] = 0x00000302
elseif jn == "潜龙在渊" then
		jns[1] = "移除自身“龙魂”和“龙骇”状态，每个被移除状态使你获得1层以下对应增益，持续到战斗结束：\n龙魂：造成的法术伤害提高1%。\n龙骇：对应被增益的龙腾或龙卷雨击伤害提高2%。(不可驱散)"
		jns[3] = 66
		jns[4] = "100点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000235
		jns[8] = 0x00000235
		jns[12] = "冷却8回合"
elseif jn == "无赦咒令" then
		jns[1] = "对目标发起物理攻击，伤害为普通攻击的110%，随机驱散目标1个增益状态，如果目标带毒类异常，则驱散2个。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000300
		jns[8] = 0x00000300
elseif jn == "生杀予夺" then
		jns[1] = "对一个目标发起一次物理攻击，伤害为普通攻击的230%：\n1.若目标带毒，此次攻击暴击伤害倍率增加60%；\n2.队伍中只有一个 弟子时：回合结束时额外减少（敌方场上尸腐毒数量×2）的冷却回合。"
		jns[3] = 4
		jns[4] = "100点魔法血"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000256
		jns[8] = 0x00000256
		jns[12] = "冷却36回合"
elseif jn == "雷法翻天" then
		jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对召唤兽造成的伤害提高35%。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000151
		jns[8] = 0x00000151
elseif jn == "雷法倒海" then
		jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对玩家单位造成的伤害提高8%。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000150
		jns[8] = 0x00000150
elseif jn == "秘传三昧真火" then
		jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对单个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与法术伤害和目标当前气血值有关。"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000194
		jns[8] = 0x00000194
		jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
elseif jn == "秘传飞砂走石" then
		jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对多个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与法术伤害和目标当前气血值有关。"
		jns[3] = 4
		jns[4] = "60点魔法*目标数"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000193
		jns[8] = 0x00000193
		jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
elseif jn == "摧枯拉朽" then
		jns[1] = "替换天赋：翩鸿一击:对目标发动一次必定触发套装追加法术的物理攻击。"
		jns[3] = 4
		jns[4] = "300点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000023
		jns[8] = 0x00000023
		jns[12] = "冷却30回合,战斗开始具有15回合冷却。"
elseif jn == "披挂上阵" then
		jns[1] = "连续攻击同一个目标3次，每次攻击均有几率触发套装追加法术。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000219
		jns[8] = 0x00000219
		jns[12] = "冷却10回合,战斗开始具有5回合冷却 "
elseif jn == "绝命毒牙" then
		jns[1] = "对目标发动一次致命攻击。\n1.对目标造成150%的伤害；\n2.激发目标身上的“天罗地网”状态， 提高（天罗地网剩余回合数×50%)的伤害，使用后休息1回合。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000131
		jns[8] = 0x00000131
		jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
elseif jn == "偷龙转凤" then
		jns[1] = "对单个目标造成10%当前气血,并恢复自己目标损失的气血,使用偷龙转凤后本方所有单位将免除治疗削弱,持续3回合。"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC3BF2DE7
		jns[8] = 0xC3BF2DE7
		jns[12] = "5回合"
-----女儿村改版的技能
elseif jn == "嫣然曼舞" then
		jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击不增加目标的愤怒，且减少目标8点愤怒。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000322
		jns[8] = 0x00000322
elseif jn == "惊鸿起舞" then
		jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，首目标的伤害提高50%(10%)。（括号里为目标为NPC时的效果）"
		jns[3] = 4
		jns[4] = "30点魔法*目标数"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000115
		jns[8] = 0x00000115
elseif jn == "风回旋舞" then
		jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击有50%几率额外造成50%伤害。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000056
		jns[8] = 0x00000056
elseif jn == "映日妙舞" then
		jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，受到你的伤害的敌人本回合对你造成的伤害降低15%"
		jns[3] = 4
		jns[4] = "30点魔法*目标数"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000337
		jns[8] = 0x00000337
elseif jn == "余韵索心" then
		jns[1] = "余韵萦心，最完美的谢幕：\n1.仅能在“重拍”使用，攻击敌方单个目标，伤害倍率为220%，使用后进入休息状态。\n2.若学习了“天籁”，乐韵提高伤害的效果增加至50%。\n3.若学习了“即兴”，该技能可在“轻拍”起舞\n4.若学习了“夺目”，使用技能前会先将“夺目”转化为“返场”，持续回合与夺目层数相同。\n返场回合内，使用该技能不会进入休息状态但也不再会获得“夺目”，且可无视音律使用。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000343
		jns[8] = 0x00000343
 elseif jn == "百草古树长青" then
			jns[1] = "为友方单位回复（万灵诸念×8+治疗能力×2）的气血，并施加等值的护盾，且获得一回合的百草·木化效果。"
			jns[3] = 5
			jns[4] = "100点魔法，红黄蓝药灵。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000137
			jns[8] = 0x00000137
			jns[12] = "冷却10回合"
--------------------------------------------------------------------------------奇经八脉其他效果------------这里底下开始
-------------------------------大唐官府
elseif jn == "目空" then
		jns[1] = "使用翩鸿一击、后发制人时,忽略目标10%防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x72ED61A1
		jns[8] = 0x72ED61A1
elseif jn == "勇武" then
		jns[1] = "你的后发制人获得下列额外效果：\n1.伤害结果增加（目标防御值*40%）；\n2.不再消耗气血,而是回复（气血上限*15%）点气血（不超过等级*8）；\n3.使用后回复10点愤怒；\n4.攻击后使得目标受到来自你的伤害提高10%,持续到目标倒地"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x265842A6
		jns[8] = 0x265842A6
elseif jn == "贪心" then
		jns[1] = "攻击目标为玩家且目标召唤兽未在场时,暴击几率增加12%。（鬼魂倒地视为不在场）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAB64E8CF
		jns[8] = 0xAB64E8CF
elseif jn == "静岳" then
		jns[1] = "带有护盾时,暴击几率提高4%。回合结束时,若不带有护盾,则获得（等级*1）点护盾。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB363459E
		jns[8] = 0xB363459E
elseif jn == "干将" then
		jns[1] = "干将莫邪效果提高30%,但不再提供抗封效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x01C779BC
		jns[8] = 0x01C779BC
elseif jn == "勇念" then
		jns[1] = "使用横扫千军时,忽略目标15%防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2EF39CEC
		jns[8] = 0x2EF39CEC
elseif jn == "神凝" then
		jns[1] = "干将莫邪额外增加300抵抗封印等级,并且取消横扫千军、破釜沉舟的气血消耗和气血需求"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9640C6B0
		jns[8] = 0x9640C6B0
elseif jn == "不惊" then
		jns[1] = "武器未锻造太阳石、红玛瑙以外的宝石时,你额外忽略目标（宝石锻数*0.5+3）%的防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8F6C13D3
		jns[8] = 0x8F6C13D3
elseif jn == "风刃" then
		jns[1] = "普通攻击时可以对其他随机3个单位造成（等级*3）的伤害；主动使用杀气诀后,必定获得“风魂”;主动使用横扫千军或破釜沉舟后,有50%几率获得“风魂”；风魂：以一个风刃伤害增加1000点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF97A7093
		jns[8] = 0xF97A7093
elseif jn == "扶阵" then
		jns[1] = "队伍每个人的阵法加成基础效果增加3%（不可叠加）。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD5131E6F
		jns[8] = 0xD5131E6F
elseif jn == "杀意" then
		jns[1] = "触发物理暴击时,伤害倍率增加20%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBB962DBE
		jns[8] = 0xBB962DBE
elseif jn == "狂狷" then
		jns[1] = "伤害增加（力量属性%耐力属性）*16。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAFA63BA0
		jns[8] = 0xAFA63BA0
elseif jn == "傲视" then
		jns[1] = "击倒玩家单位后,你造成的物理伤害提高36%，持续3回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB6C48838
		jns[8] = 0xB6C48838
elseif jn == "破空" then
		jns[1] = "攻击被保护时,被保护者所受伤害提高15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0821ADC7
		jns[8] = 0x0821ADC7
elseif jn == "历战" then
		jns[1] = "破釜沉舟额外攻击1-4个单位。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x438B3BD1
		jns[8] = 0x438B3BD1
elseif jn == "无敌" then
		jns[1] = "横扫千军变为4此攻击,分别使用75%|85%|95%|105%的伤害力进行攻击。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4640D75C
		jns[8] = 0x4640D75C
elseif jn == "突进" then
		jns[1] = "每次造成物理伤害,你的伤害力增加2点,持续战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA839BBD0
		jns[8] = 0xA839BBD0
elseif jn == "破军" then
		jns[1] = "使用横扫千军后,获得一层“剑意”，根据“剑意”层数获得：\n2层以上：攻击被保护,被保护者受伤害结果增加5%；\n5层以上：造成伤害增加5%；\n11层以上：使用横扫千军时目标不会被保护且会对额外3个单位造成45%溅射伤害；\n23层以上：不会受到无法复活的效果影响。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDC241728
		jns[8] = 0xDC241728

---------------------------------------------------------------------------------空
elseif jn == "执剑" then
		jns[1] = "队伍中只有一个大唐官府弟子时：每场战斗的第一次破釜沉舟作用人数增加3"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000394
		jns[8] = 0x00000394
elseif jn == "翩鸿" then
		jns[1] = "翩鸿一击伤害提高35%，且随机驱散目标一个增益状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000220
		jns[8] = 0x00000220
elseif jn == "安神" then
		jns[1] = "安神诀使你受到法术伤害额外降低50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000382
		jns[8] = 0x00000382
elseif jn == "勇进" then
		jns[1] = "与玩家战斗时,第一次横扫千军必定触发连破。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000338
		jns[8] = 0x00000338
elseif jn == "突刺" then
		jns[1] = "当前气血≥90%时,你的横扫千军造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000286
		jns[8] = 0x00000286
elseif jn == "亢强" then
		jns[1] = "使用特技后,每点原始愤怒消耗使你下个横扫千军触发连破的几率增加0.3%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000134
		jns[8] = 0x00000134
elseif jn == "乘胜" then
		jns[1] = "回合开始时，如果对方有玩家单位倒地，你触发连破的几率增加40%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000013
		jns[8] = 0x00000013
elseif jn == "孤勇" then
		jns[1] = "队伍中只有一个大唐官府弟子时：主动使用横扫千军击倒召唤兽和召唤物时,你触发连破的几率增加25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000071
		jns[8] = 0x00000071
elseif jn == "熟练" then
		jns[1] = "队伍中只有一个大唐官府弟子时：你触发连破的几率增加17%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000268
		jns[8] = 0x00000268
elseif jn == "潜心" then
		jns[1] = "使用披坚执锐后,法术追加套装的触发几率提高100%,持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000236
		jns[8] = 0x00000236
elseif jn == "笃志" then
		jns[1] = "法术追加套装的基础触发几率提高15%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000041
		jns[8] = 0x00000041
elseif jn == "昂扬" then
		jns[1] = "每8回合自动释放1次披坚执锐,并使法术追加套装的触发几率提高50%。不能主动使用披坚执锐。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000384
		jns[8] = 0x00000384
elseif jn == "效法" then
		jns[1] = "触发的追加法术伤害提高4%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000306
		jns[8] = 0x00000306
elseif jn == "追戮" then
		jns[1] = "携带的某种法术追加套装件数≥2时,其触发时伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000374
		jns[8] = 0x00000374
elseif jn == "烈光" then
		jns[1] = "每携带一种不同的法术追加套装,触发追加法术的伤害提高1.5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000166
		jns[8] = 0x00000166
elseif jn == "肃杀" then
		jns[1] = "处于杀气诀状态时,你的法术追加套装基础触发几率提高32%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000274
		jns[8] = 0x00000274
elseif jn == "历兵" then
		jns[1] = "每次使用或触发追加法术后,玩家伤害提升0.3%,持续战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000155
		jns[8] = 0x00000155
elseif jn == "怒伤" then
		jns[1] = "主动使用披坚执锐时,你回复10愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000212
		jns[8] = 0x00000212
elseif jn == "奉还" then
		jns[1] = "触发追加法术时,对和该法术所属门派相同的玩家的伤害提高20%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000058
		jns[8] = 0x00000058
elseif jn == "催迫" then
		jns[1] = "使用原始愤怒消耗≥120点的特技后,你的下个追加法术伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000022
		jns[8] = 0x00000022
elseif jn == "攻伐" then
		jns[1] = "触发套装追加法术后,你造成的所有伤害提高6%,持续3回合（不可驱散）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000069
		jns[8] = 0x00000069
elseif jn == "暴突" then
		jns[1] = "造成的所有伤害提高3%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000001
		jns[8] = 0x00000001
elseif jn == "诛伤" then
		jns[1] = "每种追加法术在战斗内被首次触发时,其他伤害提高10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000370
		jns[8] = 0x00000370
elseif jn == "破刃" then
		jns[1] = "50%几率使你的法术追加套装的触发几率提高20%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000224
		jns[8] = 0x00000224
elseif jn == "奋战" then
		jns[1] = "干将莫邪增加40%的基础物理连击几率，持续回合数增加2,但不再增加伤害力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000054
		jns[8] = 0x00000054
----------------------------------------------------------------------------------------方寸山
elseif jn == "雷动" then
		jns[1] = "使用落雷符时首目标法术暴击几率增加15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD2180C25
		jns[8] = 0xD2180C25
elseif jn == "吐纳" then
		jns[1] = "乾天罡气将消耗自身超过50%的所有气血，额外回复（消耗气血×25%）的魔法。主动使用的归元咒将额外回复至多（气血上限×50%）的气海血，但额外消耗对应值×25%的魔法。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x47BCA30B
		jns[8] = 0x47BCA30B
elseif jn == "化身" then
		jns[1] = "“分身术”持续回合数增加1"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE950182D
		jns[8] = 0xE950182D
elseif jn == "摧心" then
		jns[1] = "本回合被你法术攻击命中过的敌方单位死亡后，会在之后的3回合内进入虚弱状态：降低12%的伤害力、法术伤害力、法术防御和物理防御。（效果可刷新，不可叠加)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF2BAFEF2
		jns[8] = 0xF2BAFEF2
elseif jn == "批亢" then
		jns[1] = "“分身术”状态下，造成的法术伤害提高20%，受到的伤害降低15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x200F0880
		jns[8] = 0x200F0880
elseif jn == "苦缠" then
		jns[1] = "失魂符、失心符、定身符降低属性的效果增加5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE99E9C96
		jns[8] = 0xE99E9C96
elseif jn == "黄粱" then
		jns[1] = "敌方单位被你催眠时，必须受到30点以上的伤害才会苏醒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD3CF1A9E
		jns[8] = 0xD3CF1A9E
elseif jn == "补缺" then
		jns[1] = "回合开始时，若自身气血<气血上限30%,有35%几率自动使用凝神术。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3A33F2CD
		jns[8] = 0x3A33F2CD
elseif jn == "不倦" then
		jns[1] = "增加救命毫毛15%的基础成功率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA2F9E185
		jns[8] = 0xA2F9E185
elseif jn == "斗法" then
		jns[1] = "增加（武器伤害×18%）的封印命中等级，但不再增加法术伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1EEA41F8
		jns[8] = 0x1EEA41F8
elseif jn == "鬼念" then
		jns[1] = "可以封印鬼魂目标，降低鬼魂类单位对自身20%的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x173015AE
		jns[8] = 0x173015AE
elseif jn == "碎甲" then
		jns[1] = "你的碎甲符首回合效果提高100%，每回合降低20%，但具有6回合的冷却时间。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF701C5B5
		jns[8] = 0xF701C5B5
--------------------------------------------------------------------------空
elseif jn == "穿透" then
		jns[1] = "琴音三叠对召唤兽和召唤物造成的伤害提高30%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000017
		jns[8] = 0x00000017
elseif jn == "宝诀" then
		jns[1] = "佩戴“救命毫毛”时，造成的法术伤害结果增加（救命毫毛层数%2）%。进入战斗时增加救命毫毛80%的基础成功率，每回合减少10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000388
		jns[8] = 0x00000388
elseif jn == "妙用" then
		jns[1] = "佩戴“救命毫毛”时，造成的法术伤害结果增加（救命毫毛层数%2）%；增加“救命毫毛”15%的基础成功率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000198
		jns[8] = 0x00000198
elseif jn == "顺势" then
		jns[1] = "对没有召唤兽的玩家单位造成的法术伤害提高10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000271
		jns[8] = 0x00000271
elseif jn == "囚笼" then
		jns[1] = "对被封印的敌方单位，造成的法术伤害提高5%。" ----官服已改
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000241
		jns[8] = 0x00000241
elseif jn == "天箓" then
		jns[1] = "有≥3种的雷法加持时，五雷正法造成的伤害提高16%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000282
		jns[8] = 0x00000282
elseif jn == "咒诀" then
		jns[1] = "没有任何雷法加持时，至少会出现3枚符咒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000367
		jns[8] = 0x00000367
elseif jn == "符威" then
		jns[1] = "转化符咒时，每枚符咒使你回复1点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000064
		jns[8] = 0x00000064
elseif jn == "雷鸣" then
		jns[1] = "对气血≤50%的单位造成的伤害提高3%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000152
		jns[8] = 0x00000152
elseif jn == "神机" then
		jns[1] = "如果你的雷法击飞了目标，立即获得1枚符咒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000251
		jns[8] = 0x00000251
elseif jn == "造化" then
		jns[1] = "法术技能有几率提升20%伤害"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000354
		jns[8] = 0x00000354
elseif jn == "奇门" then
		jns[1] = "道法的最高境界天人合一，领悟天地浩气。\n造成法术伤害提高3%，雷法技能转化符咒有50%效果加1"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000228
		jns[8] = 0x00000228
elseif jn == "驱雷" then
		jns[1] = "增加五雷咒3%的基础暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000242
		jns[8] = 0x00000242
elseif jn == "策电" then
		jns[1] = "五雷咒对首目标提高5%的伤害，在霹雳咒等级≥125时，额外提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000012
		jns[8] = 0x00000012
elseif jn == "鬼恸" then
		jns[1] = "法术防御所减免的法术伤害只对五雷咒第二目标起效10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000077
		jns[8] = 0x00000077
elseif jn == "余悸" then
		jns[1] = "被五雷咒攻击过的召唤兽，受到“悲恸”的伤害加成增加至40%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000342
		jns[8] = 0x00000342
elseif jn == "怒霆" then
		jns[1] = "替换技能：分身术：使用5次五雷咒后，下个五雷咒额外作用3个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000213
		jns[8] = 0x00000213
elseif jn == "炼魂" then
		jns[1] = "队伍中只有一个方寸山弟子时，当回合被自己法术攻击过的敌方玩家死亡后，目标获得状态炼魂”：\n1.“炼魂”状态持续到战斗结束，无法被移除；\n2.你对不带有“炼魂”的玩家单位伤害提高(5%×敌方场上“炼魂”状态数目）；\n3.当敌方所有玩家单位都带有“炼魂”时，你的五雷咒额外作用2个单位"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000161
		jns[8] = 0x00000161
elseif jn == "灵咒" then
		jns[1] = "失魂符、失心符、定身符降低属性的效果增加5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000180
		jns[8] = 0x00000180
elseif jn == "制约" then
		jns[1] = "你的催眠符成功率减少基础值的5%，但你的其他封印法术成功率增加基础值的5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000364
		jns[8] = 0x00000364
elseif jn == "必果" then
		jns[1] = "每场战斗中，你的第一次封印技能对等级不大于你的玩家单位70%封印成功。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000004
		jns[8] = 0x00000004
elseif jn == "精炼" then
		jns[1] = "进入战斗时增加救命毫毛80%的基础成功率，每回合减少10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000120
		jns[8] = 0x00000120
elseif jn == "调息" then
		jns[1] = "“分身术”状态下，回合结束回复（气血上限×5%)的气血与（魔法上限×3%）的魔法。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000283
		jns[8] = 0x00000283
elseif jn == "幻变" then
		jns[1] = "“分身术”额外使你受到的伤害降低20%,但有8回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000089
		jns[8] = 0x00000089
elseif jn == "专神" then--官服已改
		jns[1] = "若目标阵亡时带有来自你的封印，你的封印命中等级增加100点，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000372
		jns[8] = 0x00000372
elseif jn == "灵威" then
		jns[1] = "每次回合结束有20%几率增加12点怒气"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000176
		jns[8] = 0x00000176
---------------------------------------------------------------------------化生寺
elseif jn == "销武" then
		jns[1] = "与NPC战斗时，唧唧歪歪、谆谆教诲造成的伤害提高（人物等级×0.08）%。但使用后造成的治疗降低50%，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9A717CB4
		jns[8] = 0x9A717CB4
elseif jn == "仁心" then
		jns[1] = "替换天赋：佛眷：你的活血可以使你获得状态“仁心”：使你使用活血|推拿的效果增加80%，但耗魔增加140。效果持续到使用推气过宫|救死扶伤为止。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x265842A6
		jns[8] = 0x265842A6
elseif jn == "佛显" then
		jns[1] = "每3次活血可以使你下一次推气过宫或救死扶伤必定触发明光。（不可驱散）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8D52FE90
		jns[8] = 0x8D52FE90
elseif jn == "心韧" then
		jns[1] = "你的救死扶伤效果提高100%，但具有8回合的冷却回合。（战斗开始时具有4回合的冷却回合)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x823DD991
		jns[8] = 0x823DD991
elseif jn == "归气" then
		jns[1] = "明光将会进行2次判定，但每次判定只增加60%治疗。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x369BD94B
		jns[8] = 0x369BD94B
elseif jn == "佛性" then
		jns[1] = "我佛慈悲回复的气血及气血上限提高120%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5D47F1F4
		jns[8] = 0x5D47F1F4
elseif jn == "慈心" then
		jns[1] = "回合结束且自身未死亡时：移除己方死亡单位≤2回合的无法复活效果，自身增加5回合对应效果。(对带有鬼魂类召唤师无效)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5816C756
		jns[8] = 0x5816C756
elseif jn == "舍利" then
		jns[1] = "死亡后，回复本方其他单位增加20到100的愤怒，每场战斗限1次。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xEE1C323A
		jns[8] = 0xEE1C323A
elseif jn == "止戈" then
		jns[1] = "增加（武器伤害×18%）的治疗能力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x96670F08
		jns[8] = 0x96670F08
elseif jn == "天照" then
		jns[1] = "推气过宫和救死扶伤会使得目标当前回合受到的法术伤害结果减少40点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE1910A2F
		jns[8] = 0xE1910A2F
elseif jn == "佛屠" then
		jns[1] = "金刚护法的效果提高（武器伤害x9%）。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x32BE260B
		jns[8] = 0x32BE260B
elseif jn == "映法" then
		jns[1] = "金刚护法、金刚护体、一苇渡江有50%几率对所有单位起效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC8D9EE20
		jns[8] = 0xC8D9EE20
elseif jn == "流刚" then
		jns[1] = "金刚护法、金刚护体、一苇渡江的效果提高18%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x067D652B
		jns[8] = 0x067D652B
--------------------------------------------------------------空
elseif jn == "佛法" then
		jns[1] = "队伍中只有一个化生寺弟子时：自身带有“佛法无边“会使你造成的所有治疗增加30%提高抗封能力10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000060
		jns[8] = 0x00000060
elseif jn == "圣手" then
		jns[1] = "对气血>70%的单位，治疗效果提高3%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000257
		jns[8] = 0x00000257
elseif jn == "妙手" then
		jns[1] = "你的活血效果提高25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000197
		jns[8] = 0x00000197
elseif jn == "化瘀" then
		jns[1] = "替换天赋：佛眷：你的活血效果提高120%，但有8回合冷却时间；使用推气过宫会立即重置冷却。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000088
		jns[8] = 0x00000088
elseif jn == "佛佑" then
		jns[1] = "每场战斗的第一次推气过宫额外给目标附加2回合的“金刚护体”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000061
		jns[8] = 0x00000061
elseif jn == "虔诚" then
		jns[1] = "你的推气过宫有50%几率额外作用1个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000234
		jns[8] = 0x00000234
elseif jn == "佛缘" then
		jns[1] = "自身武器五行与友方目标武器或者衣服五行相生时，治疗效果提高2%。（可叠加）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000062
		jns[8] = 0x00000062
elseif jn == "施他" then
		jns[1] = "如果自身带有任意增益状态，增加40点治疗能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000262
		jns[8] = 0x00000262
elseif jn == "聚念" then
		jns[1] = "你的“聚气”效果增加至75%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000128
		jns[8] = 0x00000128
elseif jn == "磅礴" then
		jns[1] = "你的“聚气”触发几率提升至60%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000387
		jns[8] = 0x00000387
elseif jn == "无碍" then
		jns[1] = "你的“韦陀护法”效果提高100%，但作用目标变为1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000295
		jns[8] = 0x00000295
elseif jn == "诵律" then
		jns[1] = "唧唧歪歪对召唤兽造成的伤害增加100点"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000273
		jns[8] = 0x00000273
elseif jn == "授业" then
		jns[1] = "唧唧歪歪、谆谆教诲的法术伤害结果增加30点。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000267
		jns[8] = 0x00000267
elseif jn == "修习" then
		jns[1] = "增加唧唧歪歪25%的法术连击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000314
		jns[8] = 0x00000314
elseif jn == "诵经" then
		jns[1] = "使用谆谆教诲使你使用唧唧歪歪效果提高16%，效果持续到唧唧歪歪为止。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000272
		jns[8] = 0x00000272
elseif jn == "悲悯" then
		jns[1] = "佩戴“慈悲”时，造成的法术伤害提高(慈悲层数%1.5)%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000002
		jns[8] = 0x00000002
elseif jn == "解惑" then
		jns[1] = "使用唧唧歪歪后，你的谆谆教诲减少3回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000109
		jns[8] = 0x00000109
elseif jn == "生花" then
		jns[1] = "渡世步等级≥人物等级时，增加60点法术伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000255
		jns[8] = 0x00000255
elseif jn == "悟彻" then
		jns[1] = "若谆谆教诲击飞目标，则立即取消冷却回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000303
		jns[8] = 0x00000303
elseif jn == "抚琴" then
		jns[1] = "琴音三叠造成的伤害提高15%（20%）。(括号内为目标为魔王寨弟子时的效果)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000065
		jns[8] = 0x00000065
elseif jn == "静气" then
		jns[1] = "你的罗汉金钟所需愤怒减少15点"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000121
		jns[8] = 0x00000121
elseif jn == "自在" then
		jns[1] = "佛法无边不再消耗魔法值。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000378
		jns[8] = 0x00000378
elseif jn == "无量" then
		jns[1] = "队伍中仅有1个化生寺弟子时：你带有佛法无边时，唧唧歪歪有35%几率重复释放一次。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000299
		jns[8] = 0x00000299
elseif jn == "慧定" then
		jns[1] = "佛法无边仅能对自己释放，但触发法术连击的几率增加25%，持续回合减少1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000093
		jns[8] = 0x00000093
elseif jn == "金刚" then
		jns[1] = "增加80点防御。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000110
		jns[8] = 0x00000110
elseif jn == "达摩" then
		jns[1] = "增加320点气血上限。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000028
		jns[8] = 0x00000028
elseif jn == "韦陀" then
		jns[1] = "增加30点速度。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000293
		jns[8] = 0x00000293
elseif jn == "坐禅" then
		jns[1] = "每带有1个增益状态，造成的法术伤害提高1%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000380
		jns[8] = 0x00000380
-----------------------------------------------------------------------------凌波城
elseif jn == "山破" then
		jns[1] = "使用天崩地裂与翻江搅海后，有45%-64%的几率获得1点战意"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x673833C4
		jns[8] = 0x673833C4
elseif jn == "战诀" then
		jns[1] = "对自身使用碎星诀和镇魂诀后，额外获得1点战意。浪涌造成的伤害增加，但不再获得战意。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB97A5577
		jns[8] = 0xB97A5577
elseif jn == "魂聚" then
		jns[1] = "使用消耗战意的技能后，回复10点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB7BD0013
		jns[8] = 0xB7BD0013
elseif jn == "神躯" then
		jns[1] = "受到物理暴击和法术暴击的倍率降低20%。复活时，若自身战意≤1，则额外获得1点战意。 "
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCF5AD689
		jns[8] = 0xCF5AD689
elseif jn == "不动" then
		jns[1] = "队伍中只有一个凌波城弟子时：额外忽略目标(1-自身气血%气血上限)×10%的防御。死亡时战意≤3将额外保留1点战意。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9769021C
		jns[8] = 0x9769021C
elseif jn == "海沸" then
		jns[1] = "增加（人物力量×10%+40）的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBCE3BB39
		jns[8] = 0xBCE3BB39
elseif jn == "煞气" then
		jns[1] = "风云战将:使用破血狂攻后获得1点战意。\n九天武圣:凌霄斗士:使用消耗战意的技能时，增加150点伤害力并提高6%的物理伤害结果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x338B3040
		jns[8] = 0x338B3040
elseif jn == "再战" then
		jns[1] = "每次使用断岳势或惊涛怒造成一个单位的死亡，都会使下一个的断岳势或惊涛怒伤害提高15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x606669C9
		jns[8] = 0x606669C9
elseif jn == "聚气" then  ---和化生寺特效重名
		jns[1] = "使用消耗愤怒≥60的特技时，获得1点战意。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x86873B99
		jns[8] = 0x86873B99
elseif jn == "威震" then
		jns[1] = "天眼神通状态下，造成的伤害提高4%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9D1ABD9E
		jns[8] = 0x9D1ABD9E
elseif jn == "力战" then
		jns[1] = "天崩地裂额外忽略目标12%防御且造成的伤害提高12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0E10688C
		jns[8] = 0x0E10688C
elseif jn == "破击" then
		jns[1] = "物理暴击几率翻倍，但暴击伤害倍率变为原来的65%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6E010D11
		jns[8] = 0x6E010D11
elseif jn == "强袭" then
		jns[1] = "使用天崩地裂和翻江搅海后，造成的物理伤害提高16%，持续3回合。（效果可刷新，不可叠加)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC6AD7685
		jns[8] = 0xC6AD7685
--------------------------------------------------------------------------------------空
elseif jn == "贯通" then
		jns[1] = "本方玩家单位造成的物理和法术伤害提高4%。（不可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000073
		jns[8] = 0x00000073
elseif jn == "拍岸" then
		jns[1] = "使用浪涌与裂石后，有40%几率额外获得1点战意。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000215
		jns[8] = 0x00000215
elseif jn == "怒眼" then
		jns[1] = "怒眼效果提高30%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000214
		jns[8] = 0x00000214
elseif jn == "砥石" then
		jns[1] = "50%几率裂石、断岳势、天崩地裂忽略目标10%的防御。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000032
		jns[8] = 0x00000032
elseif jn == "盛势" then
		jns[1] = "你的天眼神通获得≥2种增益状态的几率提高50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000259
		jns[8] = 0x00000259
elseif jn == "天眼" then
		jns[1] = "你的天眼神通同时获得3种增益状态的几率提高80%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000280
		jns[8] = 0x00000280
elseif jn == "蓄势" then
		jns[1] = "使用天眼神通后，有50%几率回复1点战意。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000316
		jns[8] = 0x00000316
elseif jn == "杀罚" then
		jns[1] = "天眼神通状态下造成目标死亡时，60%的几率附加持续3回合的“腾雷”：受到的治疗效果降低50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000246
		jns[8] = 0x00000246
elseif jn == "无双" then
		jns[1] = "天崩地裂暴击几率增加12%；翻江搅海伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000301
		jns[8] = 0x00000301
elseif jn == "冰暴" then
		jns[1] = "50%几率浪涌、惊涛怒、翻江搅海增加10%的暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000005
		jns[8] = 0x00000005
elseif jn == "巧变" then
		jns[1] = "带有“镇魂诀”时，每次暴击你获得1点战意，但减少镇魂诀1回合持续时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000237
		jns[8] = 0x00000237
elseif jn == "石摧" then
		jns[1] = "使用天崩地裂与翻江搅海后，有32%几率获得1点超级战意。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000263
		jns[8] = 0x00000263
elseif jn == "天泽" then
		jns[1] = "使用技能消耗战意至战意为0时，有18%几率获得1点战意。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000281
		jns[8] = 0x00000281
elseif jn == "涡流" then
		jns[1] = "回合开始时有8%几率会将你的所有战意转变为“超级战意”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000294
		jns[8] = 0x00000294
elseif jn == "妙得" then
		jns[1] = "消耗超级战意时，不再增加伤害，而是增加等额暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000196
		jns[8] = 0x00000196
elseif jn == "闪雷" then
		jns[1] = "但腾雷会额外消耗所有非超级战意，每点战意将使腾雷的伤害提高40%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000248
		jns[8] = 0x00000248
elseif jn == "惊涛" then
		jns[1] = "自身武器或者衣服五行为水时，每点消耗的超级战意将使本次攻击的伤害额外提高4%。（可叠加)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000116
		jns[8] = 0x00000116
elseif jn == "乘势" then
		jns[1] = "使用技能消耗超级战意后，获得持续3回合的“强袭”：物理伤害提高16%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000014
		jns[8] = 0x00000014
elseif jn == "追袭" then
		jns[1] = "消耗超级战意的技能攻击的目标如果在本回合死亡，附加持续3回合的“腾雷”：受到的治疗效果降低50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000376
		jns[8] = 0x00000376
-------------------------------------------------------------------------------------------龙宫
elseif jn == "波涛" then
		jns[1] = "龙腾对玩家单位造成的伤害提高10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4714CA13
		jns[8] = 0x4714CA13
elseif jn == "踏涛" then
		jns[1] = "破浪诀等级≥人物等级时，增加60点法术伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x45238FC3
		jns[8] = 0x45238FC3
elseif jn == "龙珠" then
		jns[1] = "法宝“镇海珠”效果提高10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF4F33841
		jns[8] = 0xF4F33841
elseif jn == "龙慑" then
		jns[1] = "自身武器或者衣服五行为水时，对召唤兽增加120点法术伤害结果。（可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA9FDF759
		jns[8] = 0xA9FDF759
elseif jn == "傲翔" then
		jns[1] = "队伍中只有一个龙宫弟子时：增加（魔力点数×9%)的法术伤害结果，减少（魔力点数×20%)的防御力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA925D675
		jns[8] = 0xA925D675
elseif jn == "飞龙" then
		jns[1] = "受到≥（气血上限×20%）的伤害后，有75%的几率获得“神龙摆尾”效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x45A7F519
		jns[8] = 0x45A7F519
elseif jn == "月光" then
		jns[1] = "装备上的月亮石效果提高40% "
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000392
		jns[8] = 0x00000392
elseif jn == "骇浪" then
		jns[1] = "如果场上可被你攻击的目标数恰好为7你的龙卷雨击暴击几率增加7%(21%)。（括号里为与NPC战斗时的效果) "
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000396
		jns[8] = 0x00000396

elseif jn == "戏珠" then
		jns[1] = "二龙戏珠冷却回合为8，但击倒召唤兽后，额外触发一次龙卷雨击。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4B2FA59C
		jns[8] = 0x4B2FA59C
elseif jn == "破浪" then
		jns[1] = "每回合开始时，有33%几率使本回合所有造成的法术伤害提高6%、受到的法术伤害降低9%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA5F354BA
		jns[8] = 0xA5F354BA
elseif jn == "龙魄" then
		jns[1] = "你的龙卷雨击有20%几率额外作用3个单位 "
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x97C568AA
		jns[8] = 0x97C568AA
elseif jn == "逐浪" then
		jns[1] = "当目标处于法术减免状态时，龙卷雨击造成的伤害增加（破浪诀等级×0.8）。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x890B8397
		jns[8] = 0x890B8397
elseif jn == "汹涌" then
		jns[1] = "当目标处于法术减免状态时，忽视其8%的法术减免效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x773514B8
		jns[8] = 0x773514B8
elseif jn == "云霄" then
		jns[1] = "你的法术技能额外减少目标50点魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8A3EF0F0
		jns[8] = 0x8A3EF0F0
elseif jn == "清吟" then
		jns[1] = "龙腾对当前魔法百分比<30%的玩家单位造成伤害后，使其受到的法术伤害增加15%，持续3回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA135A426
		jns[8] = 0xA135A426
elseif jn == "摧意" then
		jns[1] = "龙腾造成的伤害≥（目标气血上限×8%)时，减少目标300点魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x13DFE838
		jns[8] = 0x13DFE838
-------------------------------------------------------------------------------空
elseif jn == "龙息" then
		jns[1] = "每回合开始时，增加0.2%法术暴击几率，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000185
		jns[8] = 0x00000185
elseif jn == "叱咤" then
		jns[1] = "触发“龙魂”提高的伤害增加至9%。 "
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000016
		jns[8] = 0x00000016
elseif jn == "傲岸" then
		jns[1] = "“龙骇”的触发几率提高60%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000385
		jns[8] = 0x00000385
elseif jn == "云魂" then
		jns[1] = "带有“龙魂”时，“龙骇”的触发几率提高100%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000352
		jns[8] = 0x00000352
elseif jn == "雨魄" then
		jns[1] = "“龙骇”的效果提高60%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000347
		jns[8] = 0x00000347
elseif jn == "盘龙" then
		jns[1] = "每次触发“龙魂”后，“龙魂”的效果增加2%，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000216
		jns[8] = 0x00000216
elseif jn == "凛然" then
		jns[1] = "每个“龙魂”或“龙骇”状态将临时增加你80点抵抗封印等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000170
		jns[8] = 0x00000170
elseif jn == "回灵" then
		jns[1] = "“龙魂”和“龙骇”同时触发时，额外提高16%的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000092
		jns[8] = 0x00000092
elseif jn == "龙钩" then
		jns[1] = "消耗“龙骇”的龙卷雨击有40%几率额外作用3个单位"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000184
		jns[8] = 0x00000184
elseif jn == "琴魂" then
		jns[1] = "带有“龙魂”时琴音三叠忽视10%的法术减免效果。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000238
		jns[8] = 0x00000238
elseif jn == "惊鸿" then
		jns[1] = "消耗“龙骇”的龙腾忽视10%的法术减免效果。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000114
		jns[8] = 0x00000114
elseif jn == "狂浪" then
		jns[1] = "龙卷雨击有50%几率额外造成80点伤"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000141
		jns[8] = 0x00000141
elseif jn == "龙啸" then
		jns[1] = "替换天赋：龙魂：使用龙腾后，有20%几率使目标受到的法术伤害提高15%，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000186
		jns[8] = 0x00000186
elseif jn == "斩浪" then
		jns[1] = "队伍中只有一个弟子时：龙卷雨击有50%几率额外作用3个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000355
		jns[8] = 0x00000355
elseif jn == "呼风" then
		jns[1] = "对当前魔法百分比<30%的目标，增加6%法术暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000081
		jns[8] = 0x00000081
elseif jn == "唤雨" then
		jns[1] = "替换天赋：龙骇：造成的法术伤害增加(1-目标当前魔法%目标魔法上限)×8%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000090
		jns[8] = 0x00000090
elseif jn == "云变" then
		jns[1] = "二龙戏珠额外减少目标（带有异常状态数量×90)点魔法值。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000351
		jns[8] = 0x00000351
elseif jn == "沐雨" then
		jns[1] = "如果龙腾攻击后的目标魔法值为0，随机驱散其1个增益状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000205
		jns[8] = 0x00000205
-------------------------------------------------------------------------------------魔王寨
elseif jn == "充沛" then
		jns[1] = "你的牛劲效果增加20%且会附加“感知”状态。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8A07409C
		jns[8] = 0x8A07409C

elseif jn == "赤暖" then
		jns[1] = "使用飞砂走石有几率恢复单次伤害值10%的气血。(可叠加)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x36BEA656
		jns[8] = 0x36BEA656
elseif jn == "火神" then
		jns[1] = "佩戴“五火神焰印”法宝触发法术暴击时伤害倍率增加14%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBF44D568
		jns[8] = 0xBF44D568
elseif jn == "连营" then
		jns[1] = "你的摇头摆尾有30%几率对随机目标再使用一次摇头摆尾，但只造成40%的伤害，可重复触发。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x90EEA1F5
		jns[8] = 0x90EEA1F5
elseif jn == "神焰" then
		jns[1] = "增加五火神焰印6%的基础触发几率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9D84EC63
		jns[8] = 0x9D84EC63
elseif jn == "炙烤" then
		jns[1] = "你的牛劲持续回合减少3，但使用时额外获得“炙烤”状态：提高20%的“神焰”基础触发几率，持续回合与牛劲相同。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBAA64557
		jns[8] = 0xBAA64557
elseif jn == "蚀天" then
		jns[1] = "受到≥（气血上限×20%）的伤害则进入“蚀天”状态：造成的法术伤害增加15%，持续3回合。（不可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAC17A1D4
		jns[8] = 0xAC17A1D4
elseif jn == "燃魂" then
		jns[1] = "飞砂走石有50%几率使你的“三昧真火”造成的伤害提高150%，且增加20%的抵抗封印几率，持续2回合。（不可驱散,不可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x79602FB7
		jns[8] = 0x79602FB7
---------------------------------------------------------------------------------------------------------------空
elseif jn == "狂月" then
		jns[1] = "装备上的月亮石效果提高40% "
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000392
		jns[8] = 0x00000392
elseif jn == "震天" then
		jns[1] = "震天诀等级≥人物等级时，增加60点法术伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000393
		jns[8] = 0x00000393
elseif jn == "魔心" then
		jns[1] = "增加100点法术暴击等级 "
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000391
		jns[8] = 0x00000391
elseif jn == "邪火" then
		jns[1] = "三昧真火伤害提高4%，且目标处于休息状态时额外提高20%(300%)。（括号里为目标为NPC时的效果)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000310
		jns[8] = 0x00000310
elseif jn == "崩摧" then
		jns[1] = "造成的所有法术伤害增加5%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000003
		jns[8] = 0x00000003
elseif jn == "咆哮" then
		jns[1] = "每层魔冥的效果增加至7%（目标为玩家单位时增加至21%)。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000218
		jns[8] = 0x00000218
elseif jn == "烈焰" then
		jns[1] = "受到≥气血上限20%的伤害则进入“炙烤”状态：提高20%的“神焰”基础触发几率，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000169
		jns[8] = 0x00000169
elseif jn == "折服" then
		jns[1] = "触发“神焰”时，三昧真火会随机驱散目标一个增益状态、飞砂走石有25%几率随机驱散目标一个增益状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000360
		jns[8] = 0x00000360
elseif jn == "焰星" then
		jns[1] = "自身武器或者衣服五行为火时，增加五火神焰印5%的基础触发几率。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000324
		jns[8] = 0x00000324
elseif jn == "焰威" then
		jns[1] = "触发“神焰”时，回复3点愤怒；此效果每回合仅触发1次。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000323
		jns[8] = 0x00000323
elseif jn == "魔焱" then
		jns[1] = "使用飞砂走石后，50%几率获得“炙烤”状态：提高20%的“神焰”基础触发几率，持续4回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000201
		jns[8] = 0x00000201
elseif jn == "狂劲" then
		jns[1] = "你的摇头摆尾和三昧真火触发“神焰”的几率提高8%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000140
		jns[8] = 0x00000140
elseif jn == "升温" then
		jns[1] = "你每次使用飞砂走石，会增加“神焰”效果提升6%，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000254
		jns[8] = 0x00000254
elseif jn == "激怒" then
		jns[1] = "回合开始时，有10%几率进入“蚀天“状态：造成的法术伤害增加15%，持续4回合。（不可叠加)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000097
		jns[8] = 0x00000097
elseif jn == "真炎" then
		jns[1] = "三昧真火造成的伤害提高15%。——三昧真火，如何泼得？好一似火上浇油，越泼越灼。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000361
		jns[8] = 0x00000361
elseif jn == "焚尽" then
		jns[1] = "自身武器或者衣服五行为火时，法术暴击几率增加4%。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000053
		jns[8] = 0x00000053
elseif jn == "烈火真言" then
		jns[1] = "切换秘传法术时，不再替代法术“三昧真火”或“飞砂走石”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000167
		jns[8] = 0x00000167
elseif jn == "极炙" then
		jns[1] = "秘传三昧真火有25%几率额外造成50%的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000099
		jns[8] = 0x00000099
elseif jn == "咒言" then
		jns[1] = "使用三昧真火、飞砂走石后，秘传技能冷却回合减少1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000369
		jns[8] = 0x00000369
elseif jn == "摧山" then
		jns[1] = "秘传飞砂走石的伤害提升12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000024
		jns[8] = 0x00000024
elseif jn == "不忿" then
		jns[1] = "释放特技会使你下个秘传法术造成的伤害提高12%。（不可驱散）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000007
		jns[8] = 0x00000007
elseif jn == "融骨" then
		jns[1] = "秘传三昧真火会随机驱散目标一个增益状态；秘传飞砂走石有25%几率随机驱散目标一个增益状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000243
		jns[8] = 0x00000243
elseif jn == "焦土" then
		jns[1] = "自身武器或者衣服五行为土时，秘传三昧真火和秘传飞砂走石法术暴击几率提高50%。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000106
		jns[8] = 0x00000106
elseif jn == "烬藏" then
		jns[1] = "使用原始愤怒消耗≥120点的特技后，秘传技能减少1回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000113
		jns[8] = 0x00000113
elseif jn == "固基" then
		jns[1] = "秘传三昧真火和秘传飞砂走石基础冷却回合减少1回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000072
		jns[8] = 0x00000072
elseif jn == "惊悟" then
		jns[1] = "每20回合，秘传法术的基础冷却回合减少1回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000118
		jns[8] = 0x00000118
elseif jn == "旋阳" then
		jns[1] = "每次使用秘传法术后有50%几率减少他本身两回合冷却"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000319
		jns[8] = 0x00000319
elseif jn == "燎原" then
		jns[1] = "“牛劲”状态下，每回合结束时秘传法术减少1回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000165
		jns[8] = 0x00000165
---------------------------------------------------------------------------------------女儿村
elseif jn == "暗伤" then
		jns[1] = "花雨伊人:与NPC战斗时，雨落寒沙和子母神针增  加（武器伤害×18%）的固定伤害；你的封印命中率会下降10%。\n绝代妖娆:与NPC战斗时，雨落寒沙和子母神针增加（武器伤害×18%）的固定伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x50E3D938
		jns[8] = 0x50E3D938
elseif jn == "傲娇" then
		jns[1] = "使用特技时，愤怒消耗减少4点。使用笑里藏刀时，愤怒消耗额外减少4点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x53DABF54
		jns[8] = 0x53DABF54
elseif jn == "花护" then
		jns[1] = "使用水清诀、冰清诀、晶清诀、玉清诀时，愤怒消耗减少8点，并且可以使目标抵抗封印类法术的能力提高50%，持续1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC412A4C0
		jns[8] = 0xC412A4C0
elseif jn == "毒雾" then
		jns[1] = "使用封印法术成功时，有50%几率使目标中暗器毒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA3E0CA7F
		jns[8] = 0xA3E0CA7F
elseif jn == "轻霜" then
		jns[1] = "任何企图攻击你的敌方（包括对你施放封印、诅咒类法术)都有30%几率在攻击时受到毒的影响：每回合损失（毒经技能等级×3）的气血，持续4回合，该状态不可叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x848E3B4F
		jns[8] = 0x848E3B4F
elseif jn == "磐石" then
		jns[1] = "一个回合中，受到一个目标的伤害后，之后每次所受其他目标的伤害会递减55点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4F264E2A
		jns[8] = 0x4F264E2A
elseif jn == "毒引" then
		jns[1] = "敌方主动解除由女儿村弟子产生的毒时，会额外受到600点气血损失，但最低将敌方气血降为1点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x57BD8D19
		jns[8] = 0x57BD8D19
elseif jn == "倩影" then
		jns[1] = "每回合开始时增加自身速度2点,持续到回合结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x86C6B8EF
		jns[8] = 0x86C6B8EF
elseif jn == "国色" then
		jns[1] = "自身速度>=（召唤兽等级×5）的召唤兽进入战斗时自身速度提高12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0D719443
		jns[8] = 0x0D719443
elseif jn == "机巧" then
		jns[1] = "每次你的封印导致敌方行动失效（死亡不算)，敌方会受到毒的影响，每回合损失毒经技能等级×3的气血，持续4回合，该状态不可叠加。（仅封印回合有效)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE6EF1BBC
		jns[8] = 0xE6EF1BBC
elseif jn == "嫣然" then
		jns[1] = "一笑倾城对首目标的命中几率增加8%对每个目标的持续回合有40%的几率提高1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x463DBA13
		jns[8] = 0x463DBA13
elseif jn == "杏花" then
		jns[1] = "使用暗器时攻击时敌方中毒几率增加4%。并且你的暗器毒能对带有“高级毒”的单位起效(但命中率降低50%)；你的封印命中率会下降10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x30B186DD
		jns[8] = 0x30B186DD
elseif jn == "淬芒" then
		jns[1] = "每一次你使敌方中暗器毒，都可以为自己增加8%的封印命中率，效果持续3回合。（上限为16%,回合数可被刷新)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x20661796
		jns[8] = 0x20661796
elseif jn == "天香" then
		jns[1] = "每次使敌方中暗器毒，你回复6点愤怒"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2AD7F908
		jns[8] = 0x2AD7F908
elseif jn == "花殇" then
		jns[1] = "飞花摘叶作用人数增加6。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3590A7E4
		jns[8] = 0x3590A7E4
elseif jn == "花舞" then
	   jns[1] = "提高自身(4%+20)的初始速度\n绝代妖娆:额外提高2%的速度"
	   jns[3] = 8
	   jns[6] = "物品图标.wdf"
	   jns[7] = 0x25260F44
	   jns[8] = 0x25260F44
-------------------------------------------------------------------------------------------空
elseif jn == "独尊" then
		jns[1] = "你的自矜触发几率增加至100%，但你的暗器附加毒的几率减少4%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000040
		jns[8] = 0x00000040
elseif jn == "重明" then
		jns[1] = "使用特技后，获得自矜，但你的暗器附加毒的几率减少4%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000366
		jns[8] = 0x00000366
elseif jn == "风行" then
		jns[1] = "进入战斗后，队伍中所有玩家单位的速度增加8点。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000055
		jns[8] = 0x00000055
elseif jn == "空灵" then
		jns[1] = "使用特技后，自身抵抗封印几率临时增加14%，持续2回合。（状态可刷新，不可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000136
		jns[8] = 0x00000136
elseif jn == "叶护" then
		jns[1] = "自己的速度高于同队其他玩家时，受到的所有伤害降低2%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000327
		jns[8] = 0x00000327
elseif jn == "抑怒" then
		jns[1] = "娉婷袅娜的命中率增加10%，同时增加10%的基础封印命中。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000328
		jns[8] = 0x00000328
elseif jn == "倾国" then
		jns[1] = "一笑倾城对所有目标的命中率增加8%但有8回合的冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000239
		jns[8] = 0x00000239
elseif jn == "涂毒" then
		jns[1] = "使用暗器时攻击使敌方中毒几率增加6%；你的封印命中率下降10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000288
		jns[8] = 0x00000288
elseif jn == "暗刃" then
		jns[1] = "对带有暗器毒的玩家单位，造成的暗器伤害提高18%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000383
		jns[8] = 0x00000383
elseif jn == "花影" then
		jns[1] = "对带有暗器毒的单位，造成的伤害提高8%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000084
		jns[8] = 0x00000084
elseif jn == "百花" then
		jns[1] = "雨落寒沙有9%几率额外作用3人。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000386
		jns[8] = 0x00000386
elseif jn == "飞花" then
		jns[1] = "飞花摘叶吸取魔法的效果提高200%，但具有8回合冷却。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000051
		jns[8] = 0x00000051
elseif jn == "天籁" then
		jns[1] = "乐韵提高伤害的效果增加至40%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000277
		jns[8] = 0x00000277
elseif jn == "即兴" then
		jns[1] = "前4回合你可以自由使用轻拍和重拍舞步。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000100
		jns[8] = 0x00000100
elseif jn == "夺目" then
		jns[1] = "消耗“乐韵”的“重拍”舞步，会使你获得一层“夺目”，使你“重拍”舞步额外作用1个单位，持续3回合，重复获得时刷新持续时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000044
		jns[8] = 0x00000044
elseif jn == "独舞" then
		jns[1] = "轻歌飘舞对玩家单位造成的伤害提高15%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000038
		jns[8] = 0x00000038
elseif jn == "翻飞" then
		jns[1] = "翩跃飞舞每次攻击增加的伤害增加5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000050
		jns[8] = 0x00000050
elseif jn == "水漾" then
		jns[1] = "自身武器或衣服五行为水时，造成的伤害提高4%。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000270
		jns[8] = 0x00000270
elseif jn == "花雨" then
		jns[1] = "你的“满天花雨”也视作轻拍舞步，只在偶数回合增加乐韵(其他经脉作用对满天花雨无效)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000085
		jns[8] = 0x00000085
elseif jn == "跃动" then
		jns[1] = "“重拍”舞步击飞目标后，本回合后续攻击的伤害提高10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000350
		jns[8] = 0x00000350
elseif jn == "幽美" then
		jns[1] = "轻歌飘舞给队友增加伤害时，效果翻倍。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000340
		jns[8] = 0x00000340
elseif jn == "风姿" then
		jns[1] = "有50%几率造成的伤害提高10%，抗封几率提高20%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000057
		jns[8] = 0x00000057
elseif jn == "纷舞" then
		jns[1] = "翩跹飞舞对非玩家单位造成的伤害提高20%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000052
		jns[8] = 0x00000052
------------------------------------------------------------------------------盘丝洞
elseif jn == "粘附" then
		jns[1] = "与NPC战斗时，若自身敏捷≥等级×3或力量≥等级×3，使用天罗地网时，增加（武器伤害×18%）伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD2180C25
		jns[8] = 0xD2180C25
elseif jn == "妖气" then
		jns[1] = "增加（武器伤害×18%）的封印命中等级。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB3956495
		jns[8] = 0xB3956495
elseif jn == "怜心" then
		jns[1] = "姐妹同心的效果增加10%。队伍中只有一个弟子时效果增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x38D87BEB
		jns[8] = 0x38D87BEB
elseif jn == "迷瘴" then
		jns[1] = "天罗地网异常状态命中率增加20%；且额外减少目标5%速度(等级×1.5)的伤害力、法术伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x661970E1
		jns[8] = 0x661970E1
elseif jn == "鼓乐" then
		jns[1] = "魔音摄魂的命中率增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC17A7A56
		jns[8] = 0xC17A7A56
elseif jn == "安抚" then
		jns[1] = "“回合结束时，每个带有你的“含情脉脉”“魔音摄魂”状态的单位会为你回复4点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x756CE723
		jns[8] = 0x756CE723
elseif jn == "忘川" then
		jns[1] = "你的“瘴气”的持续回合数增加3。当目标带有“瘴气”效果时，含情脉脉、魔音摄魂增加10%封印命中率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBAA9AF30
		jns[8] = 0xBAA9AF30
elseif jn == "情劫" then
		jns[1] = "对带有你异常状态玩家在解除异常时本次获得的气血回复效果降低50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x949B1634
		jns[8] = 0x949B1634
elseif jn == "意乱" then
		jns[1] = "你的瘴气作用人数调整为（迷情大法等级%20+1)，但持续回合数减少1。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B95DA6D
		jns[8] = 0x0B95DA6D
elseif jn == "迷梦" then
		jns[1] = "每当你被他人封印或封印他人时，若敌方未带有“瘴气”效果，则60%几率对其附加“瘴气”效果。（需已习得瘴气法术）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD713CFD8
		jns[8] = 0xD713CFD8
elseif jn == "绝殇" then
		jns[1] = "带有“瘴气”的目标回合结束时减少1点愤怒。你的瘴气、魔音摄魂使用的当前回合无法被晶清诀、玉清诀解除。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x72B48AE0
		jns[8] = 0x72B48AE0
elseif jn == "结阵" then
		jns[1] = "敌方阵营所有玩家单位每回合结束损失2点速度。（降低的总速度不会超过初始速度的20%）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x93AE3E78
		jns[8] = 0x93AE3E78
elseif jn == "媚态" then
		jns[1] = "你使用瘴气时，移除目标身上的“寡欲令”。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x26A40C6E
		jns[8] = 0x26A40C6E
elseif jn == "忘忧" then
		jns[1] = "成功封印目标后，每回合开始时目标减少90点魔法值，直到封印解除。若因此效果导致魔法值为0，则额外受到（目标等级×4）的气血伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x59ED800F
		jns[8] = 0x59ED800F
elseif jn == "倾情" then
		jns[1] = "使用姐妹同心成功后，如果目标的魔法值为0，则有50%的几率额外施放一次含情脉脉法术。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF28C8F12
		jns[8] = 0xF28C8F12
elseif jn == "迷意" then
		jns[1] = "带有“瘴气”的目标受到的回魔效果降低30%并且回合开始时减少40点魔法值。使用魔音摄魂命中目标时，目标不能回复魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1A6D023E
		jns[8] = 0x1A6D023E
elseif jn == "利刃" then
		jns[1] = "敌方所有单位每回合结束时减少30点魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8282C7D1
		jns[8] = 0x8282C7D1

-------------------------------------------------------------------------------------------空
elseif jn == "连绵" then
		jns[1] = "你的“瘴气”持续回合数增加4"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000156
		jns[8] = 0x00000156
elseif jn == "玲珑" then
		jns[1] = "受到伤害时，有20%几率减少12%伤害并回复自身10点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000181
		jns[8] = 0x00000181
elseif jn == "绝媚" then
		jns[1] = "你的勾魂、摄魄技能效果增加90%，但会有8回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000130
		jns[8] = 0x00000130
elseif jn == "魔音" then
		jns[1] = "受到处于“魔音摄魂”状态单位的伤害降低18%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000202
		jns[8] = 0x00000202
elseif jn == "丹香" then
		jns[1] = "使用三级药品后，回复2点愤怒"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000029
		jns[8] = 0x00000029
elseif jn == "绵密" then
		jns[1] = "你的“魔音摄魂”被解除时，将会给目标附加“瘴气”效果，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000195
		jns[8] = 0x00000195
elseif jn == "魔瘴" then
		jns[1] = "姐妹同心对带有“瘴气”效果的目标效果增加12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000203
		jns[8] = 0x00000203
elseif jn == "杀戮" then
		jns[1] = "攻击带有“天罗地网”的单位时，造成的物理伤害提高10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000247
		jns[8] = 0x00000247
elseif jn == "罗网" then
		jns[1] = "你的普通攻击伤害提高10%，且有100%几率使目标附加“天罗地网”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000190
		jns[8] = 0x00000190
elseif jn == "天网" then
		jns[1] = "千蛛噬魂每次攻击都有15%几率对目标附加“天罗地网”状态（已有该状态则刷新为4回合)。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000278
		jns[8] = 0x00000278
elseif jn == "凌弱" then
		jns[1] = "物理攻击负面状态数量≥2的目标时，伤害力增加80点。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000182
		jns[8] = 0x00000182
elseif jn == "制怒" then
		jns[1] = "破血狂攻对带有“天罗地网”的单位使用后，你回复15点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000363
		jns[8] = 0x00000363
elseif jn == "狂击" then
		jns[1] = "使用千蛛噬魂时，物理暴击几率增加10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000139
		jns[8] = 0x00000139
elseif jn == "千蛛" then
		jns[1] = "千蛛噬魂对召唤兽的伤害结果提高30%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000231
		jns[8] = 0x00000231
elseif jn == "引诛" then
		jns[1] = "蛛丝缠绕对玩家单位造成的伤害提高6%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000332
		jns[8] = 0x00000332
elseif jn == "附骨" then
		jns[1] = "你的天罗地网有50%几率不会被玉清诀、晶清诀解除。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000066
		jns[8] = 0x00000066
elseif jn == "亡缚" then
		jns[1] = "增加100点物理暴击等级"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000290
		jns[8] = 0x00000290
elseif jn == "罗刹" then
		jns[1] = "蛛丝缠绕附加“天罗地网”状态时，“天罗地网”的持续回合数有30%几率增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000188
		jns[8] = 0x00000188
elseif jn == "障眼" then
		jns[1] = "回合结束时若敌方单位带有“瘴气”，该单位来自你的“天罗地网”状态有32%几率延长1回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000358
		jns[8] = 0x00000358
elseif jn == "扑袭" then
		jns[1] = "队伍中仅有一个弟子时：进入战斗的首次造成的伤害提高40%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000226
		jns[8] = 0x00000226
--------------------------------------------------------------------------------------------------普陀山
elseif jn == "推衍" then
		jns[1] = "增加40点治疗能力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x7D712683
		jns[8] = 0x7D712683
elseif jn == "普渡" then
		jns[1] = "“普渡”基础几率增加20%且“普渡会对紧箍咒起效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9110FB84
		jns[8] = 0x9110FB84
elseif jn == "灵动" then
		jns[1] = "灵动九天效果增加30点，持续回合数增加2。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4DCD5F44
		jns[8] = 0x4DCD5F44
elseif jn == "道衍" then
		jns[1] = "队伍中只有一个普陀山弟子时：你的自在心法效果提高（N×6%）,并为目标附加一个持续N回合的“普渡众生”，N为我方带有“普渡众生”的单位数。但自在心法会附加新增“普渡众生”回合数+1的冷却时间\n莲台仙子:附加“普渡众生”的回合数增加n+1。(回合数不超过8) \n五行咒师:处于“莲心剑意”状态下时，N额外计算对方带有“紧箍咒”的单位数。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCE18F021
		jns[8] = 0xCE18F021
elseif jn == "化戈" then
		jns[1] = "普渡众生气血回复效果增加（武器伤害×18%）。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8FE4B9FF
		jns[8] = 0x8FE4B9FF
elseif jn == "劳心" then
		jns[1] = "目标当前气血≤（气血上限×30%）时，使用普渡众生带来的气血回复效果额外提高100%,首选目标有效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9110FB84
		jns[8] = 0x9110FB84
elseif jn == "甘露" then
		jns[1] = "成功对目标使用杨柳甘露时，有50%的几率附带“普渡众生”4回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAF6FDE97
		jns[8] = 0xAF6FDE97
elseif jn == "玉帛" then
		jns[1] = "普渡众生技能增加金刚护法技能等级的气血回复效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA96E7A76
		jns[8] = 0xA96E7A76
elseif jn == "雨润" then
		jns[1] = "当本方玩家单位的“普渡众生”被驱散时，下回合开始时获得气血回复，效果等同于自在心法结算效果的80%。(如本回合死亡状态延续，该效果不可叠加)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4290BCBB
		jns[8] = 0x4290BCBB
elseif jn == "借灵" then
		jns[1] = "武器伤害的24%转化为五行法术伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9C0D1C5B
		jns[8] = 0x9C0D1C5B
elseif jn == "默诵" then
		jns[1] = "紧箍咒造成的基础伤害加倍且受固定伤害能力影响，造成的伤害100%不会产生愤怒，同时额外每回合减少目标6点愤怒，持续时间增加3回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6AB318F7
		jns[8] = 0x6AB318F7
elseif jn == "秘术" then
		jns[1] = "使用五行法术攻击过的目标当前回合死亡，当前回合不能被复活。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF109AB4C
		jns[8] = 0xF109AB4C
elseif jn == "法咒" then
		jns[1] = "五行法术有15%的几率对目标造成1.5倍的暴击效果；“莲心剑意”状态下，首目标触发率增加至40%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2A398778
		jns[8] = 0x2A398778
elseif jn == "五行制化" then
		jns[1] = "普陀弟子可以在临敌之际运用五行之力，其所耗不过一个手印口诀，而随之而来的自然生克之力却往往令人绝望。你的“颠倒五行”获得下述加成:\n1.法术躲避率增加15%；\n2.带有该状态的单位不会被五行克制；\n3.持续回合数增加3。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF46EB09D
		jns[8] = 0xF46EB09D
----------------------------------------------------------------------------------------------空
elseif jn == "清净" then
		jns[1] = "你的颠倒五行额外附带效果“清净”：增加30%抵抗封印类法术的能力，持续2回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000240
		jns[8] = 0x00000240
elseif jn == "普照" then
		jns[1] = "每有一个本方单位带有“普渡众生”，你增加15点防御和法术防御。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000227
		jns[8] = 0x00000227
elseif jn == "慈佑" then
		jns[1] = "若召唤兽带有来自你的“普渡众生”，其受到的伤害降低12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000018
		jns[8] = 0x00000018
elseif jn == "度厄" then
		jns[1] = "“普渡”基础几率减少10%，但触发“普渡”时作用目标增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000042
		jns[8] = 0x00000042
elseif jn == "莲动" then
		jns[1] = "每场战斗第一个杨柳甘露的恢复效果提高300%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000157
		jns[8] = 0x00000157
elseif jn == "法华" then
		jns[1] = "灵动九天额外提高6%法术伤害。但作用人数变为1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000049
		jns[8] = 0x00000049
elseif jn == "庄严" then
		jns[1] = "敌方每有一个单位带有“紧箍咒”，你增加15点防御和法术防御。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000373
		jns[8] = 0x00000373
elseif jn == "赐咒" then
		jns[1] = "敌方没有单位带有“紧箍咒”时，你的紧箍咒有56%几率额外随机作用1个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000021
		jns[8] = 0x00000021
elseif jn == "慧眼" then
		jns[1] = "敌方不是玩家单位时,有50%几率伤害增加60%且有60%几率使其本回合无法使用物理和法术攻击。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000094
		jns[8] = 0x00000094
elseif jn == "无怖" then
		jns[1] = "如果你的紧箍咒导致目标死亡，有35%几率增加40点固定伤害，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000296
		jns[8] = 0x00000296
elseif jn == "缘起" then
		jns[1] = "队伍中只有一个普陀山弟子时：五行法术有（敌方带有“紧箍咒”单位数量×8%）几率额外施放1次。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000349
		jns[8] = 0x00000349
elseif jn == "湛然" then
		jns[1] = "五行珠数量=5时，“剑意莲心”造成的伤害提高6%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000356
		jns[8] = 0x00000356
elseif jn == "因缘" then
		jns[1] = "造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000329
		jns[8] = 0x00000329
elseif jn == "莲音" then
		jns[1] = "使用剑意莲心后，有50%几率使你造成的物理伤害提高20%，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000159
		jns[8] = 0x00000159
elseif jn == "安忍" then
		jns[1] = "受到伤害降低（当前五行珠数量×1%）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000381
		jns[8] = 0x00000381
elseif jn == "低眉" then
		jns[1] = "队伍中只有1个普陀山弟子时：增加（莲花宝座等级×2)的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000031
		jns[8] = 0x00000031
elseif jn == "顿悟" then
		jns[1] = "使用五行攻击获得新的五行珠后，额外回复（当前五行珠数量）的愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000043
		jns[8] = 0x00000043
elseif jn == "怒目" then
		jns[1] = "破血狂攻忽视目标10%的防御；若当前拥有的五行珠，破血狂攻造成的伤害提高五行珠数量*10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000211
		jns[8] = 0x00000211
elseif jn == "馀威" then
		jns[1] = "破血狂攻造成的伤害提高50%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000345
		jns[8] = 0x00000345
elseif jn == "业障" then
		jns[1] = "对召唤兽造成的伤害提高20%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000326
		jns[8] = 0x00000326
elseif jn == "困兽" then
		jns[1] = "如果你的五行攻击克制目标五行且导致目标死亡，目标本回合将无法被复活"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000148
		jns[8] = 0x00000148
elseif jn == "无尽" then
		jns[1] = "使用五行攻击获得新的五行珠后，增加6点伤害力，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000298
		jns[8] = 0x00000298
elseif jn == "抖擞" then
		jns[1] = "增加（力量点数×10%+40）的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000035
		jns[8] = 0x00000035
elseif jn == "莲华" then
		jns[1] = "使用“剑意莲心”时，增加150点伤害力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000158
		jns[8] = 0x00000158
elseif jn == "化用" then
		jns[1] = "“剑意莲心”击倒目标有20%几率随机获得一种五行珠"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000087
		jns[8] = 0x00000087
elseif jn == "智念" then
		jns[1] = "佩戴“普渡”时，五行攻击有（法宝层数×2%)的几率额外获得一颗其他属性五行珠"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000365
		jns[8] = 0x00000365
elseif jn == "执念" then
		jns[1] = "使用3级药（金创药、百炼金乌丸除外)时，你将获得1枚五行珠。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000362
		jns[8] = 0x00000362
elseif jn == "万象" then
		jns[1] = "你的“颠倒五行”对自己释放时，获得以下效果：\n1.造成伤害提高8%；\n2.法术躲避率增加15%；\n3.持续回合增加3。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000289
		jns[8] = 0x00000289
---------------------------------------------------------------------------------------------------------------------神木林
elseif jn == "祛除" then
			jns[1] = "获得三个百草法术:\n百草十香：解除友方目标酒类异常状态。【消耗】50点魔法，红色药灵\n百草定神：解除友方目标经脉产生的异常状态。【消耗】50点魔法，蓝色药灵\n百草红雪：解除友方目标毒类异常状态。【消耗】50点魔法，黄色药灵。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
 elseif jn == "净化" then
			jns[1] = "百草回春龙沙：解除全体友方目标非经脉、非封类、非酒类、非毒类的常规异常状态【消耗】100点魔法，红黄蓝药灵。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000122
		    jns[8] = 0x00000122
elseif jn == "木魂" then
		jns[1] = "与NPC战斗时，造成的法术伤害不再降低，但施加的治疗和护盾效果降低50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000177
		jns[8] = 0x00000177
elseif jn == "绿茵" then
		jns[1] = "增加武器伤害*18%的治疗能力"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000074
		jns[8] = 0x00000074
elseif jn == "滋润" then
		jns[1] = "对气血>70%的单位，治疗效果提高3%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000010
		jns[8] = 0x00000010
elseif jn == "明心" then
		jns[1] = "场上存在护盾的友方玩家抗封能力提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000091
		jns[8] = 0x00000091
elseif jn == "反哺" then
		jns[1] = "对友方玩家使用单体回复气血的百草法术时，你也获得相应回复量10%的气血回复。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000335
		jns[8] = 0x00000335
elseif jn == "药颂" then
		jns[1] = "战斗开始时将获得6个药灵。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000059
		jns[8] = 0x00000059

elseif jn == "补血" then
		jns[1] = "每场战斗第一次使用百草法术时对点选目标额外附加一次滋养。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000315
		jns[8] = 0x00000315
elseif jn == "风神" then
		jns[1] = "你的物理暴击几率和法术暴击几率提高20%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000162
		jns[8] = 0x00000162
elseif jn == "转化" then
		jns[1] = "增加5*装备镶嵌光芒石数量的治疗能力"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000207
		jns[8] = 0x00000207
elseif jn == "灵精" then
		jns[1] = "使用百草法术时有30%几率返还一颗消耗的药灵。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000173
		jns[8] = 0x00000173
elseif jn == "润泽" then
		jns[1] = "你的百草复苏和百草神木复苏可以提前2回合复活处于“锢魂术”与“死亡召唤”状态下的目标"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000101
		jns[8] = 0x00000101
elseif jn == "木精" then
		jns[1] = "你自身武器或衣服五行为木时，治疗效果提高3%。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000070
		jns[8] = 0x00000070
elseif jn == "残余" then
		jns[1] = "百草诀现在仅凝萃8颗药灵，但药灵数目≤2时使用百草诀可保留剩余药灵。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000304
		jns[8] = 0x00000304
elseif jn == "法身" then
		jns[1] = "替换天赋：风灵：偶数回合不再获得风灵，但每层风灵额外增加2%法术暴击几率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC3E2C628
		jns[8] = 0xC3E2C628
elseif jn == "冰锥" then
		jns[1] = "冰川怒对召唤兽及召唤物使用时，若有风灵，会消耗一层风灵并获得下列效果：\n1.封印几率提升40%；\n2.伤害结果提高30%；\n3.驱散目标1个增益状态。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x83D1EA06
		jns[8] = 0x83D1EA06
elseif jn == "风魂" then
		jns[1] = "消耗风灵时，获得（消耗数量×等级×2）的护盾。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD53A237C
		jns[8] = 0xD53A237C
elseif jn == "咒法" then
		jns[1] = "巫咒等级≥人物等级时，增加60点法术伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE17F1C2E
		jns[8] = 0xE17F1C2E
elseif jn == "月影" then
		jns[1] = "增加月影6%的基础法术连击几率"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x95F03B6B
		jns[8] = 0x95F03B6B
elseif jn == "蔓延" then
		jns[1] = "使用荆棘舞、冰川怒、尘土刃造成的伤害提高10%，并且会使得你造成的所有伤害提高15%,持续3回合。（效果不可叠加，可刷新）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDA21274D
		jns[8] = 0xDA21274D
elseif jn == "滋养" then
		jns[1] = "你的蜜润只能作用于自己，但是会额外获得下述效果：\n1.额外使你造成的所有法术伤害提高15%。\n2.被驱散时回复（剩余回合数×驭灵咒等级）的气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x82DE1BB0
		jns[8] = 0x82DE1BB0
elseif jn == "寄生" then
		jns[1] = "尘土刃对带有异常状态单位使用时会消耗最多2层风灵，每层风灵提高35%伤害结果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x92FE057C
		jns[8] = 0x92FE057C
elseif jn == "追击" then
		jns[1] = "使用落叶萧萧时，若有风灵，会消耗1层风灵并使得伤害提高30%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCE2EEB29
		jns[8] = 0xCE2EEB29
---------------------------------------------------------------------------------------------空
elseif jn == "破杀" then
		jns[1] = "荆棘舞、冰川怒、尘土刃增加12%暴击几率和20%暴击伤害倍率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000399
		jns[8] = 0x00000399
elseif jn == "纯净" then
		jns[1] = "装备上的光芒石效果提高70%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000400
		jns[8] = 0x00000400
elseif jn == "神木" then
		jns[1] = "自身武器或者衣服五行为木时，造成的法术伤害提高4%（可叠加）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000252
		jns[8] = 0x00000252
elseif jn == "薪火" then
		jns[1] = "自身武器或者衣服五行为火时，每回合结束增加自己2点法伤，持续到战斗结束。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000311
		jns[8] = 0x00000311
elseif jn == "星光" then
		jns[1] = "消耗风灵的技能将使自身恢复10点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000312
		jns[8] = 0x00000312
elseif jn == "迷缚" then
		jns[1] = "带有来自你“雾杀”的单位对你造成的伤害降低3%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000192
		jns[8] = 0x00000192
elseif jn == "伏毒" then
		jns[1] = "使用蛊树迷瘴时，若有风灵，会消耗一层风灵并增加5%的附加雾杀几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000063
		jns[8] = 0x00000063
elseif jn == "灵木" then
		jns[1] = "佩戴“月影”时，雾杀有（月影层数2%)的几率附加3层“雾杀”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000174
		jns[8] = 0x00000174
elseif jn == "绞藤" then
		jns[1] = "触发鞭挞时，有（消耗风灵数量×10%)的几率为目标附加1层雾杀。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000107
		jns[8] = 0x00000107
elseif jn == "激活" then
		jns[1] = "每8回合，有100%的几率获得1层“催化”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000096
		jns[8] = 0x00000096
elseif jn == "灵佑" then
		jns[1] = "带有风灵时，受到的所有伤害降低2%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000178
		jns[8] = 0x00000178
elseif jn == "狂叶" then
		jns[1] = "当你没有风灵时，你的落叶萧萧增加90点法术伤害力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000146
		jns[8] = 0x00000146
elseif jn == "劲草" then
		jns[1] = "触发“鞭挞”时，每层风灵提升的伤害增加至20%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000111
		jns[8] = 0x00000111
elseif jn == "苍埃" then
		jns[1] = "替换天赋：鞭挞：尘土刃对玩家使用时，若有风灵，会消耗一层风灵并获得以下效果:\n1.造成伤害提高10%；\n2.额外减少目标受到伤害×50%的气血上限。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000009
		jns[8] = 0x00000009
elseif jn == "灵归" then
		jns[1] = "回合开始有50%会获得风灵"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000172
		jns[8] = 0x00000172
---------------------------------------------------------------------------------------------------------------------------------------狮驼岭
elseif jn == "魔息" then
		jns[1] = "你的魔息术会使你所有技能魔法耗费减少至1。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC84857CA
		jns[8] = 0xC84857CA
elseif jn == "狂袭" then
		jns[1] = "攻击时若被反震导致气血损失，获得气血损失的4%加成至伤害力，持续1回合，可叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5154ED66
		jns[8] = 0x5154ED66
elseif jn == "羁绊" then
		jns[1] = "你每次回复气血值，回合结束时你的召唤兽也会回复该数值的15%；你的召唤兽每次回复气血值，回合结束时你也会回复该数值的15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5C170F92
		jns[8] = 0x5C170F92
elseif jn == "爪印" then
		jns[1] = "每次攻击敌人或被敌人攻击后，在敌人身上留下“爪印”。每个“爪印”使你在下次攻击此目标时增加（人物等级×1）伤害结果。持续5回合或至敌方死亡。（效果可叠加5层，可刷新，且不会被水清、冰清、玉清、晶清诀解除。)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6E34D2AA
		jns[8] = 0x6E34D2AA
elseif jn == "驭兽" then
		jns[1] = "本方的所有召唤兽造成的伤害提高3%，受到的伤害降低3%。 （不可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x97EF1BE4
		jns[8] = 0x97EF1BE4
elseif jn == "化血" then
		jns[1] = "在攻击中有30%几率吸收（造成伤害×16%)的气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBE24B04C
		jns[8] = 0xBE24B04C
elseif jn == "宁息" then
		jns[1] = "变身持续回合数增加1。击倒目标有15%几率使自己的“变身”状态延长1回合"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF0B320B8
		jns[8] = 0xF0B320B8
elseif jn == "兽王" then
		jns[1] = "受到封印时，临时减少该次封印（本方召唤兽数×2)%的封印命中率上限。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x287A0188
		jns[8] = 0x287A0188
elseif jn == "鹰啸" then
		jns[1] = "你的鹰击额外造成5%的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1D7F1771
		jns[8] = 0x1D7F1771
elseif jn == "怒象" then
		jns[1] = "当气血小于上限的30%时，有70%的几率在使用象形时保留变身状态并延长变身2回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x7CDE78AD
		jns[8] = 0x7CDE78AD
elseif jn == "死地" then
		jns[1] = "死亡时将增加你下一次鹰击200伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x143A6B82
		jns[8] = 0x143A6B82
elseif jn == "乱击" then
		jns[1] = "你的连环击不再取消“变身”而是减少变身2回合，使用连环击时临时增加（狂兽决等级×1)的伤害力且造成的伤害提高10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x28EFDCA8
		jns[8] = 0x28EFDCA8
elseif jn == "肝胆" then
		jns[1] = "当你没有召唤兽在场时，鹰击伤害提高15%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x04600746
		jns[8] = 0x04600746
elseif jn == "背水" then
		jns[1] = "自身异常状态被五龙丹或水清诀解除时，获得状态“背水”：下次鹰击额外作用1个单位，持续2回合。（可刷新，不可驱散）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B171EFB
		jns[8] = 0x0B171EFB
elseif jn == "狩猎" then
		jns[1] = "你的攻击造成玩家单位死亡后，本场战斗你对其召唤兽和孩子造成的伤害永久提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000397
		jns[8] = 0x00000397

------------------------------------------------------------------------------------------------空
elseif jn == "九天" then
		jns[1] = "队伍中只有一个狮驼岭弟子时:增加（大鹏展翅等级×2)的伤害，且你的鹰击造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000124
		jns[8] = 0x00000124
elseif jn == "协战" then
		jns[1] = "召唤兽在场时，自身造成的所有物理伤害提高7%。（鬼魂倒地视为未在场）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000309
		jns[8] = 0x00000309
elseif jn == "狂化" then
		jns[1] = "狂怒斗兽：主动使用狂怒时，“变身”和“狂怒的持续回合额外增加1。\n万兽之王:处于变身状态时，你的召唤兽攻击时有12%几率造成双倍伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000138
		jns[8] = 0x00000138
elseif jn == "狮王" then
		jns[1] = "狮魂的效果提高25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000261
		jns[8] = 0x00000261
elseif jn == "健壮" then
		jns[1] = "召唤兽的最大生命值提高10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000105
		jns[8] = 0x00000105
elseif jn == "图腾" then
		jns[1] = "召唤兽存活时，你的狮搏也受到“狮魂的加成，增加伤害5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000287
		jns[8] = 0x00000287
elseif jn == "急救" then
		jns[1] = "使用鹰击长空后你的召唤兽会恢复5%最大气血。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000101
		jns[8] = 0x00000101
elseif jn == "饮血" then
		jns[1] = "你和召唤兽造成物理伤害后，有30%几率吸取(16%×造成伤害)的气血。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000334
		jns[8] = 0x00000334
elseif jn == "守势" then
		jns[1] = "你的召唤师每回合受到第一次伤害降低10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000265
		jns[8] = 0x00000265
elseif jn == "护盾" then
		jns[1] = "获得“狮魂”时，你的召唤兽还将获得(狂兽诀等级×12)的护盾。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000082
		jns[8] = 0x00000082
elseif jn == "协同" then
		jns[1] = "队伍中只有一个狮驼岭弟子时：召唤兽对处于封印状态的目标造成的伤害提高25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000308
		jns[8] = 0x00000308
elseif jn == "嗜血" then
		jns[1] = "“幼狮之搏”击倒玩家单位后，召唤兽造成的伤害提高30%，持续3回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000264
		jns[8] = 0x00000264
elseif jn == "獠牙" then
		jns[1] = "造成的伤害提供5%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000164
		jns[8] = 0x00000164
elseif jn == "钢牙" then
		jns[1] = "自身武器或者衣服五行为金时，“狮搏”和“幼狮之搏”造成的伤害提高5%。（可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000068
		jns[8] = 0x00000068
elseif jn == "复仇" then
		jns[1] = "你阵亡后，召唤兽在下回合开始时对伤害来源使用一次“幼狮之搏”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000067
		jns[8] = 0x00000067
elseif jn == "逞凶" then
		jns[1] = "你或召唤兽攻击造成玩家单位死亡后，本场战斗你和召唤兽对其召唤兽和孩子造成的伤害永久提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000015
		jns[8] = 0x00000015
elseif jn == "狂躁" then
		jns[1] = "“变身”的持续回合减少3，你主动使用变身时，获得相同回合数的“狂怒”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000147
		jns[8] = 0x00000147
elseif jn == "狂啸" then
		jns[1] = "攻击非玩家单位死亡，获得3回合的“狂怒”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000143
		jns[8] = 0x00000143
elseif jn == "攫取" then
		jns[1] = "“狂怒”状态下造成物理伤害后，有50%几率吸取(16%×造成伤害)的气血。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000132
		jns[8] = 0x00000132
elseif jn == "屏息" then
		jns[1] = "回合结束时若处于倒地状态，有70%几率不减少“变身”和“狂怒”的剩余回合数。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000222
		jns[8] = 0x00000222
elseif jn == "不羁" then
		jns[1] = "“狂怒”状态下，你的抵抗封印几率增加10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000008
		jns[8] = 0x00000008
elseif jn == "狮噬" then
		jns[1] = "“狂怒”状态下，你的狮搏有35%几率额外释放一次。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000260
		jns[8] = 0x00000260
elseif jn == "象踏" then
		jns[1] = "“狂怒”状态下，你使用象形时不再取消“变身”，但会取消“狂怒”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000305
		jns[8] = 0x00000305
elseif jn == "长啸" then
		jns[1] = "召唤召唤兽会使你获得3回合的“狂怒”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000357
		jns[8] = 0x00000357
elseif jn == "狂血" then
		jns[1] = "使用破血狂攻或破碎无双后，获得3回合的“狂怒”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000144
		jns[8] = 0x00000144
elseif jn == "狂乱" then
		jns[1] = "“狂怒”状态下，你的鹰击有40%几率额外作用1个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000142
		jns[8] = 0x00000142
elseif jn == "雄风" then
		jns[1] = "“狂怒”状态下，你使用连环击时保留“变身”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000313
		jns[8] = 0x00000313
elseif jn == "迅捷" then
		jns[1] = "回合开始时如果没有变身状态，有20%几率自动释放变身"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000321
		jns[8] = 0x00000321
elseif jn == "威压" then
		jns[1] = "狮搏对召唤兽伤害提高20%并有30%几率附带持续2回合的“威慑”效果。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000291
		jns[8] = 0x00000291
elseif jn == "癫狂" then
		jns[1] = "天魔解体会使你额外增加12%的暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000033
		jns[8] = 0x00000033
-------------------------------------------------------------------------天宫
elseif jn == "神念" then
		jns[1] = "使用法宝时，额外回复10点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA79CD890
		jns[8] = 0xA79CD890
elseif jn == "疾雷" then
		jns[1] = "使用天雷斩攻击NPC时，额外增加0.6×(敏捷点数-人物等级)的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x67324D63
		jns[8] = 0x67324D63
elseif jn == "神律" then
		jns[1] = "天神护体法防效果提高100%，额外增加(云霄步等级×0.3)的速度，但不再增加法伤。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xEA46BD71
		jns[8] = 0xEA46BD71
elseif jn == "伏魔" then
		jns[1] = "伏魔天书的效果提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x7D54F95D
		jns[8] = 0x7D54F95D
elseif jn == "苏醒" then
		jns[1] = "在一回合内掉血量达到自身气血上限的30%,回合结束时自动移除自身封印类异常状态，自身死亡时不生效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC8EF7B06
		jns[8] = 0xC8EF7B06
elseif jn == "洞察" then
		jns[1] = "你的知己知彼额外增加（自身等级×2）的伤害、防御、法伤、法防、封印等级、抗封等级，持续3回合。（效果可刷新，不可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8660A7C9
		jns[8] = 0x8660A7C9
elseif jn == "轰鸣" then
		jns[1] = "踏雷天尊:混天术≥人物等级时，你增加60点法术伤害。\n镇妖神使:使用五雷轰顶成功时，使目标减少（等级×1.6）点物理防御，持续3回合。（效果不可叠加和刷新)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x11DBB164
		jns[8] = 0x11DBB164
elseif jn == "趁虚" then
		jns[1] = "使用特技之后，封印命中率增加8%，持续3回合。（效果可刷新，不可叠加）"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x54E910DB
		jns[8] = 0x54E910DB
elseif jn == "震慑" then
		jns[1] = "使用错乱成功封印目标后，使目标无法使用法宝；但你的法术伤害降低10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC5CB9BBB
		jns[8] = 0xC5CB9BBB
elseif jn == "护佑" then
		jns[1] = "增加50点防御及法术防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFEAD9161
		jns[8] = 0xFEAD9161
elseif jn == "月桂" then
		jns[1] = "增加（武器伤害×18%）的封印命中等级，但不再增加法术伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x71D17EEA
		jns[8] = 0x71D17EEA
elseif jn == "驭意" then
		jns[1] = "增加自身（魔力属性点×5%）的速度和(魔力属性点×10%)的法术伤害、减少（魔力属性点×24%)的法术防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2CBA65C0
		jns[8] = 0x2CBA65C0
elseif jn == "雷波" then
		jns[1] = "雷霆万钧对首目标造成的伤害提高8%，带有“电芒”的非召唤物单位死亡时，所有敌方存活单位附加“电芒”效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA7603CC9
		jns[8] = 0xA7603CC9
elseif jn == "灵光" then
		jns[1] = "装备上的宝石舍利子效果提高25%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9571F0A2
		jns[8] = 0x9571F0A2
----------------------------------------------------------------------------------空
elseif jn == "电掣" then
		jns[1] = "对敌方非玩家单位造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000034
		jns[8] = 0x00000034
elseif jn == "霆震" then
		jns[1] = "造成的伤害提高(6-霹雳弦惊或雷怒霆激剩余回合数)×1%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000284
		jns[8] = 0x00000284
elseif jn == "激越" then
		jns[1] = "“霹雳弦惊”和“雷怒霆激”持续时间减少2回合，但持续回合内你造成的物理伤害提高15%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000098
		jns[8] = 0x00000098
elseif jn == "存雄" then
		jns[1] = "使用特技后，造成的物理伤害提高10%,持续3回合。（效果可刷新，不可叠加）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000027
		jns[8] = 0x00000027
elseif jn == "慨叹" then
		jns[1] = "破碎无双伤害提高42%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000133
		jns[8] = 0x00000133
elseif jn == "惊霆" then
		jns[1] = "进入战斗时，获得4回合霹雳弦惊”状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000117
		jns[8] = 0x00000117
elseif jn == "雷吞" then
		jns[1] = "自身武器或者衣服五行为金时，造成的伤害提高5%(可叠加)"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000154
		jns[8] = 0x00000154
elseif jn == "神采" then
		jns[1] = "气血≥70%时，造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000250
		jns[8] = 0x00000250
elseif jn == "劲健" then
		jns[1] = "增加50点伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000112
		jns[8] = 0x00000112
elseif jn == "啸傲" then
		jns[1] = "使用霹雳弦惊或雷怒霆激后，增加15点伤害力，持续到战斗结束，最多叠加20次。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000307
		jns[8] = 0x00000307
elseif jn == "气势" then
		jns[1] = "战斗中首次主动使用的“霹雳弦惊”和“雷怒霆激”持续回合提高50%。（分别计算）"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000230
		jns[8] = 0x00000230
elseif jn == "天威" then
		jns[1] = "使用消耗愤怒技能时，愤怒消耗减少8点。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000279
		jns[8] = 0x00000279
elseif jn == "藏招" then
		jns[1] = "你的雷霆万钧额外作用1个单位"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000011
		jns[8] = 0x00000011
elseif jn == "坚壁" then
		jns[1] = "战斗中首次使用“苍白纸人”和“混元伞”时，持续回合增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000102
		jns[8] = 0x00000102
elseif jn == "套索" then
		jns[1] = "你的“金刚镯”额外使目标造成的物理伤害降低10%，且持续回合增加1回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000275
		jns[8] = 0x00000275
elseif jn == "神尊" then
		jns[1] = "你的天神护体额外增加物理防御，效果和法防相同，但不再增加法伤。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000253
		jns[8] = 0x00000253
elseif jn == "频变" then
		jns[1] = "“电芒”持续回合增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000221
		jns[8] = 0x00000221
elseif jn == "惊曜" then
		jns[1] = "带有“电芒”的单位再次受到雷霆万钧攻击时，额外受到的伤害增加至10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000119
		jns[8] = 0x00000119
elseif jn == "霜雷" then
		jns[1] = "你造成的法术伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000269
		jns[8] = 0x00000269
elseif jn == "天劫" then
		jns[1] = "你造成的法术伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000276
		jns[8] = 0x00000276
elseif jn == "怒电" then
		jns[1] = "使用原始愤怒消耗≥120点的特技后，有50%几率使你的下一个“雷霆万钧”额外作用1个单位。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000209
		jns[8] = 0x00000209
elseif jn == "共鸣" then
		jns[1] = "你的召唤兽使用的奔雷咒和雷击伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000070
		jns[8] = 0x00000070
elseif jn == "仙音" then
		jns[1] = "琴音三叠对带有“电芒”的单位额外造成16%的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000304
		jns[8] = 0x00000304
-------------------------------------------------------------------------------------------------------------无底洞
elseif jn == "风墙" then
		jns[1] = "使用地涌金莲时，30%几率为目标附加护盾附加数值为当前恢复气血50%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA35299B7
		jns[8] = 0xA35299B7
elseif jn == "精进" then
		jns[1] = "明光宝烛、金身舍利效果增加50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3AC8DBC2
		jns[8] = 0x3AC8DBC2
elseif jn == "救人" then
		jns[1] = "明光宝烛、金身舍利作用人数固定为1且持续回合数减少1，但效果增加160%。被驱散后，目标增加（剩余回合数×目标等级）的护盾值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD01D3AD
		jns[8] = 0xFD01D3AD
elseif jn == "忍辱" then
		jns[1] = "每当你被敌方封印时，无论是否成功都有100%几率回复15点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB1254F74
		jns[8] = 0xB1254F74
elseif jn == "暗潮" then
		jns[1] = "你的玉清诀愤怒消耗减少10点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x26A40C6E
		jns[8] = 0x26A40C6E
elseif jn == "噬魂" then
		jns[1] = "队伍中只有1个无底洞弟子时：你的水清诀、冰清诀消耗减半且解除封印时会使目标造成的物法伤害提高10%，持续1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x173015AE
		jns[8] = 0x173015AE
elseif jn == "御兽" then
		jns[1] = "自身携带的召唤兽和孩子进入战斗时，如果速度≥（召唤兽等级×3），则增加召唤兽（等级×0.7)的速度和（召唤兽等级×1）的法术防御。（含初始进场及召唤进场)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4972C591
		jns[8] = 0x4972C591
elseif jn == "陷阱" then
		jns[1] = "你的夺魄令被解除时，目标当前回合减少（阴风绝章等级×1.5）的物法伤害；同时使你下次地涌金莲额外作用1个单位。（不可驱散)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3E7BB1D9
		jns[8] = 0x3E7BB1D9
elseif jn == "灵身" then
		jns[1] = "受到物理暴击和法术暴击伤害倍率减少40%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x90622900
		jns[8] = 0x90622900
-------------------------------------------------------------------------空
elseif jn == "罗汉" then
		jns[1] = "你使用罗汉金钟所需愤怒减少4点，持续回合数增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000189
		jns[8] = 0x00000189

elseif jn == "分魄" then
		jns[1] = "你的追魂刺所造成的伤害增加10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000126
		jns[8] = 0x00000126


elseif jn == "血潮" then
		jns[1] = "“燃血术”消耗翻倍，但使用后你会获得2层状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000320
		jns[8] = 0x00000320
elseif jn == "灵照" then
		jns[1] = "场上友方每个带有增益状态的单位，增加你（武器伤害×3%）的治疗能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000179
		jns[8] = 0x00000179
elseif jn == "秉幽" then
		jns[1] = "增加（武器伤害×18%）的治疗能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000006
		jns[8] = 0x00000006
elseif jn == "护法" then
		jns[1] = "场上每个带有护盾友方单位，增加你（武器伤害×4%）的治疗能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000083
		jns[8] = 0x00000083
elseif jn == "涌泉" then
		jns[1] = "地涌金莲首目标额外回复（地冥妙法等级×6)点气血。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000339
		jns[8] = 0x00000339
elseif jn == "烛照" then
		jns[1] = "你和你的召唤兽使用药品时，触发特性“藏神”的几率提高16%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000371
		jns[8] = 0x00000371
elseif jn == "华光" then
		jns[1] = "燃血术强化的地涌金莲额外作用1个目标。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000086
		jns[8] = 0x00000086
elseif jn == "疗愈" then
		jns[1] = "你的“地涌金莲”对其他与你衣服五行相同的单位的气血回复效果提高8%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000163
		jns[8] = 0x00000163
elseif jn == "灵通" then
		jns[1] = "“由己渡人”可提前2回合复活处于“锢魂术”与“死亡禁锢”状态的目标。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000175
		jns[8] = 0x00000175
elseif jn == "阴魅" then
		jns[1] = "若敌方场上无处于封类异常的单位，增加（武器伤害×18%）的封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000330
		jns[8] = 0x00000330
elseif jn == "诡印" then
		jns[1] = "增加（武器伤害×18%）封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000076
		jns[8] = 0x00000076
elseif jn == "萦魄" then
		jns[1] = "带有>2个增益状态时，增加（武器伤害×15%)的封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000336
		jns[8] = 0x00000336
elseif jn == "椎骨" then
		jns[1] = "燃血术强化的夺魄令增加120点封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000377
		jns[8] = 0x00000377
elseif jn == "妖法" then
		jns[1] = "进入战斗时“宝烛”会使你的速度提高（法宝层数*1%）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000325
		jns[8] = 0x00000325
elseif jn == "烈煞" then
		jns[1] = "增加100点封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000168
		jns[8] = 0x00000168
elseif jn == "弥愤" then
		jns[1] = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“追魂刺”不再消耗愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000191
		jns[8] = 0x00000191
elseif jn == "魂守" then
		jns[1] = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“裂魂”产生的伤害加成提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000095
		jns[8] = 0x00000095
elseif jn == "刺骨" then
		jns[1] = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“追魂刺”对玩家伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000019
		jns[8] = 0x00000019
elseif jn == "余咒" then
		jns[1] = "与玩家战斗时：夺命咒也有几率触发“裂魂”，几率为25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000344
		jns[8] = 0x00000344
elseif jn == "鬼袭" then
		jns[1] = "追魂刺对召唤兽造成的伤害提高50%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000078
		jns[8] = 0x00000078
elseif jn == "羽裂" then
		jns[1] = "“裂魂”追加的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000346
		jns[8] = 0x00000346
elseif jn == "夺血" then
		jns[1] = "使用燃血术时，获得8点固定伤害能力，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000045
		jns[8] = 0x00000045
elseif jn == "盛怒" then
		jns[1] = "燃血术不再有气血限制也不消耗气血，使用后你回复20点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000258
		jns[8] = 0x00000258
elseif jn == "灵变" then
		jns[1] = "与玩家战斗时：增加50点固定伤害能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000171
		jns[8] = 0x00000171
elseif jn == "深刻" then
		jns[1] = "与玩家战斗时：使用追魂刺将使下一个夺命咒增加70点固定伤害能力，使用夺命咒将使下一个追魂刺增加70点固定伤害能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000249
		jns[8] = 0x00000249
elseif jn == "牵动" then
		jns[1] = "追魂刺造成玩家单位死亡时，必定触发“裂魂”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000232
		jns[8] = 0x00000232
elseif jn == "独一" then
		jns[1] = "队伍中只有1个弟子时：增加100点固定伤害能力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000039
		jns[8] = 0x00000039
elseif jn == "纠缠" then
		jns[1] = "使用“追魂刺”时，50%几率回复4点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000123
		jns[8] = 0x00000123
elseif jn == "踏魄" then
		jns[1] = "敌方单位带有裂魂状态时造成的物理法术伤害降低6%，持续到其裂魂状态消失。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000389
		jns[8] = 0x00000389
elseif jn == "冥煞" then
		jns[1] = "造成固定伤害时，有5%几率造成双倍伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000199
		jns[8] = 0x00000199
----------------------------------------------------------------------------------------五庄观
elseif jn == "体恤" then
		jns[1] = "生命之泉的对气血≤30%的目标，效果增加150点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF19C2D33
		jns[8] = 0xF19C2D33
elseif jn == "养生" then
		jns[1] = "当你气血<70%、且不处于生命之泉状态时，获得生命之泉状态。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCF2DA86F
		jns[8] = 0xCF2DA86F
elseif jn == "意境" then
		jns[1] = "回合结束时，本方所有单位回复24点魔法值、1点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC5AFBFE0
		jns[8] = 0xC5AFBFE0
elseif jn == "心浪" then
		jns[1] = "回合结束时，若你愤怒<50点，随机回复1~15点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x284FBFEC
		jns[8] = 0x284FBFEC
elseif jn == "修心" then
		jns[1] = "使用除慈航普度以外的特技时，若愤怒不足则将消耗（所需愤怒×20点魔法代替。（每场战斗限一次) "
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x151405E2
		jns[8] = 0x151405E2
elseif jn == "修身" then
		jns[1] = "力量、体质、魔力、耐力、敏捷均增加14点 "
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x47BCA30B
		jns[8] = 0x47BCA30B
elseif jn == "致命" then
		jns[1] = "被你攻击的目标在回合结束时，若目标气血<（其气血上限×8%）则直接死亡。（对NPC最多造成等级×8点伤害)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8C44F88C
		jns[8] = 0x8C44F88C
elseif jn == "锤炼" then
		jns[1] = "武器耐久损失速度降低40%，增加4%武器伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x18172D37
		jns[8] = 0x18172D37
elseif jn == "神附" then
		jns[1] = "增加（人物力量×8%）的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x43F66789
		jns[8] = 0x43F66789
elseif jn == "强击" then
		jns[1] = "破血狂攻、破碎无双伤害提高32%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA88BC46C
		jns[8] = 0xA88BC46C
elseif jn == "雨杀" then
		jns[1] = "攻击目标为非玩家单位时，烟雨剑法第二次攻击的暴击几率提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA88BC46C
		jns[8] = 0xB6C48838
elseif jn == "归本" then
		jns[1] = "你的日月乾坤命中目标时，有60%几率随机驱散一个目标增益效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x736BD2FA
		jns[8] = 0x736BD2FA
elseif jn == "同辉" then
		jns[1] = "天地同寿持续回合数增加2，但是被玩家单位攻击时额外降低15%防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xBF6B4C8C
		jns[8] = 0xBF6B4C8C
elseif jn == "乾坤" then
		jns[1] = "日月乾坤的成功率提高5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x86543FA8
		jns[8] = 0x86543FA8
elseif jn == "陌宝" then
		jns[1] = "增加80点封印命中等级，日月乾坤对命中目标额外附加无法使用道具的效果，但你的物理伤害结果降低15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA88BC46C
		jns[8] = 0xA88BC46C
--------------------------------------------------------------------------空
elseif jn == "无极" then
		jns[1] = "同时处于生命之泉、炼气化神状态时，提高9%的伤害力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000297
		jns[8] = 0x00000297
elseif jn == "剑势" then
		jns[1] = "对气血>90%的单位造成的伤害提高9%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000104
		jns[8] = 0x00000104
elseif jn == "剑气" then
		jns[1] = "回合结束时，获得4点物理暴击等级，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000103
		jns[8] = 0x00000103
elseif jn == "起雨" then
		jns[1] = "当你的“骤雨”叠加至3层时，下一次烟雨剑法会消耗所有的“骤雨层数，额外增加1次攻击次数。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000390
		jns[8] = 0x00000390
elseif jn == "滂沱" then
		jns[1] = "每层“骤雨”的效果增加至5%伤害和5%暴击几率，且最多叠加5层。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000217
		jns[8] = 0x00000217
elseif jn == "木摧" then
		jns[1] = "敲金击玉伤害结果增加5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000204
		jns[8] = 0x00000204
elseif jn == "道果" then
		jns[1] = "进入战斗时默认携带1个人参娃娃，但人参娃娃增加的基础伤害减少10%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000030
		jns[8] = 0x00000030
elseif jn == "饮露" then
		jns[1] = "每个人参娃娃增加4%的基础伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000333
		jns[8] = 0x00000333
elseif jn == "炼果" then
		jns[1] = "使用破血狂攻、破碎无双、弱点击破后，会获得1个人参娃娃。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000160
		jns[8] = 0x00000160
elseif jn == "聚力" then
		jns[1] = "每个人参娃娃使你的破血狂攻、破碎无双、弱点击破额外造成15%的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000127
		jns[8] = 0x00000127
elseif jn == "刺果" then
		jns[1] = "敲金击玉对召唤兽的伤害提高21%"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000020
		jns[8] = 0x00000020
elseif jn == "三元" then
		jns[1] = "当你带有3个人参娃娃时，抵抗封印几率增加15%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000245
		jns[8] = 0x00000245
elseif jn == "凝神" then
		jns[1] = "带有人参娃娃时，你的伤害力增加120点。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000208
		jns[8] = 0x00000208
elseif jn == "纳气" then
		jns[1] = "增加（人物力量×10%+40）的伤害。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000206
		jns[8] = 0x00000206
elseif jn == "气盛" then
		jns[1] = "每个人参娃娃使你增加60点伤害力。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000229
		jns[8] = 0x00000229
elseif jn == "还元" then
		jns[1] = "带有3个人参娃娃时，敲金击玉将增加6%的基础暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000079
		jns[8] = 0x00000079
elseif jn == "归真" then
		jns[1] = "带有3个人参娃娃时，你的敲金击玉增加5%的物理暴击几率,造成的伤害提高25%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000075
		jns[8] = 0x00000075
elseif jn == "运转" then
		jns[1] = "生命之泉持续回合减少3，但回复量提高30%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000353
		jns[8] = 0x00000353
elseif jn == "行气" then
		jns[1] = "以自身为目标释放炼气化神时，其持续回合增加3。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000080
		jns[8] = 0x00000080
elseif jn == "蓄志" then
		jns[1] = "你同时处于炼气化神和生命之泉状态时，每回合回复3点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000317
		jns[8] = 0x00000317
elseif jn == "存思" then
		jns[1] = "回合数为3的倍数时，日月乾坤增加150点封印命中等级。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000026
		jns[8] = 0x00000026
elseif jn == "守中" then
		jns[1] = "替换技能：天地同寿：受到的所有法术伤害降低6%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000266
		jns[8] = 0x00000266
elseif jn == "存神" then
		jns[1] = "有35%的几率使你的日月乾坤命中几率翻倍。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000025
		jns[8] = 0x00000025
elseif jn == "玄机" then
		jns[1] = "日月乾坤对带有异常状态的单位，封印命中基础几率增加5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000318
		jns[8] = 0x00000318
----------------------------------------------------------------------------------------------------------地府
elseif jn == "夜行" then
		jns[1] = "夜间增加人物40点速度、40点伤害、50点阎罗令伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6CB4C5F1
		jns[8] = 0x6CB4C5F1
elseif jn == "索魂" then
		jns[1] = "锢魂术命中率增加(6+当前回合数×0.1)%,(最高12%)。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF259DD30
		jns[8] = 0xF259DD30
elseif jn == "伤魂" then
		jns[1] = "六道魍魉:对带有异常状态的单位，造成的物理伤害提高5%。\n勾魂阎罗:对带有毒类异常的单位，锢魂术命中率增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xEDAB40CF
		jns[8] = 0xEDAB40CF
elseif jn == "泉暴" then
		jns[1] = "队伍中只有一个阴曹地府弟子时：每场战斗的第一次黄泉之息将造成400%的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x14AB7311
		jns[8] = 0x14AB7311
elseif jn == "回旋" then
		jns[1] = "受到包括固定伤害在内的所有法术伤害减少65点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x299CC362
		jns[8] = 0x299CC362
elseif jn == "鬼火" then
		jns[1] = "使用原始愤怒消耗≤90的特技后，回复16点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x93AE3E78
		jns[8] = 0x93AE3E78
elseif jn == "汲魂" then
		jns[1] = "每次敌方单位死亡时，回复（自身等级×6)的气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x808E00C5
		jns[8] = 0x808E00C5
elseif jn == "入骨" then
		jns[1] = "尸腐毒被解除时，使目标减少5%当前气血。"
		jns[3] = 8
	    jns[6] = "物品图标.wdf"
		jns[7] = 0xB9D06801
		jns[8] = 0xB9D06801
elseif jn == "黄泉" then
		jns[1] = "黄泉之息的减速效果提高50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x11A0C1AE
		jns[8] = 0x11A0C1AE
elseif jn == "幽光" then
		jns[1] = "九幽的每回合回复当前气血值的上限增加120点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x337664F3
		jns[8] = 0x337664F3
elseif jn == "魂飞" then
		jns[1] = "你的魂飞魄散对目标附加锢魂术，持续2回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC415DB52
		jns[8] = 0xC415DB52
elseif jn == "百炼" then
		jns[1] = "使用百爪狂杀附加20%的武器伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2197928B
		jns[8] = 0x2197928B
elseif jn == "夜之王者" then
		jns[1] = "百爪狂杀额外提高14%伤害结果；夜晚增加10%暴击几率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5192EAE6
		jns[8] = 0x5192EAE6
-------------------------------------------------------------------------空
elseif jn == "阎罗" then
		jns[1] = "与NPC战斗时，阎罗令伤害增加（武器伤害×15%)；你的下一个判官令或六道无量伤害提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC4A24497
		jns[8] = 0xC4A24497
elseif jn == "幽冥" then
		jns[1] = "幽冥鬼眼持续回合数增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000341
		jns[8] = 0x00000341
elseif jn == "追命" then
		jns[1] = "队伍中只有一个阴曹地府弟子时：击倒玩家单位时，将附加3回合“锢魂术”。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000375
		jns[8] = 0x00000375
elseif jn == "恶焰" then
		jns[1] = "攻击目标死亡时带有尸腐毒时，你获得恶焰：造成的物理伤害提高12%，持续6回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000047
		jns[8] = 0x00000047
elseif jn == "毒炽" then
		jns[1] = "攻击带有尸腐毒的单位时，临时增加12%暴击几率。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000036
		jns[8] = 0x00000036
elseif jn == "阴翳" then
		jns[1] = "百鬼噬魂造成的伤害提高10%，血影蚀心造成的伤害提高5%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000331
		jns[8] = 0x00000331
elseif jn == "破毒" then
		jns[1] = "破血狂攻会给目标附加尸腐毒；若目标已有尸腐毒，破血狂攻造成的伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000223
		jns[8] = 0x00000223
elseif jn == "入魂" then
		jns[1] = "使用“摄魂”后，下回合造成的物理伤害提高15%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000244
		jns[8] = 0x00000244
elseif jn == "毒慑" then
		jns[1] = "攻击带有尸腐毒的单位时，你造成的伤害提高4%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000037
		jns[8] = 0x00000037
elseif jn == "破印" then
		jns[1] = "对召唤兽的伤害提高15%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000225
		jns[8] = 0x00000225
elseif jn == "瘴幕" then
		jns[1] = "受到带有“尸腐毒”单位的攻击时，受到的伤害降低4%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000359
		jns[8] = 0x00000359
elseif jn == "通暝" then
		jns[1] = "幽冥鬼眼仅对自己起效，但持续回合增加（释放时敌方场上带有尸腐毒的单位数量）。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000285
		jns[8] = 0x00000285
elseif jn == "狂宴" then
		jns[1] = "攻击附带“尸腐毒”的单位后，回复2点愤怒。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000145
		jns[8] = 0x00000145
elseif jn == "轮回" then
		jns[1] = "队伍中只有一个 弟子时：若回合结束时，敌方场上有6个中“尸腐毒”的单位，你获得60点伤害、暴击等级、穿刺等级、狂暴等级、抗封等级、格挡值，持续6回合。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000187
		jns[8] = 0x00000187
elseif jn == "拘魄" then
		jns[1] = "摄魂的所有基础效果增加6%，但冷却回合增加至10。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000126
		jns[8] = 0x00000126
elseif jn == "克敌" then
		jns[1] = "锢魂术持续回合数增加1。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000135
		jns[8] = 0x00000135
elseif jn == "冥视" then
		jns[1] = "幽冥鬼眼额外增加2%的抗封。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000200
		jns[8] = 0x00000200
elseif jn == "扼命" then
		jns[1] = "魂飞魄散命中处于封印状态的单位时，额外随机驱散3个增益状态。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000046
		jns[8] = 0x00000046
elseif jn == "狱火" then
		jns[1] = "攻击带有来自你的“摄魂”的单位时，造成的伤害提高12%。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000348
		jns[8] = 0x00000348
elseif jn == "六道" then
		jns[1] = "六道无量的伤害结果额外增加（六道轮回技能等级×4)。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000183
		jns[8] = 0x00000183
elseif jn == "咒令" then
		jns[1] = "判官令伤害提高50%，但增加4回合冷却时间。"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000368
		jns[8] = 0x00000368
--------------------------------------------------------九黎城






elseif jn == "枫魂" then--写完ok
		jns[1] = "使用枫影二刃必定获得“怒哮”；若已有“怒哮”，枫影二刃对非角色单位造成的伤害提高20%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000035
		jns[8] = 0x10000036
	elseif jn == "怒刃" then--写完ok
		jns[1] = "与NPC战斗时，枫影二刃造成的伤害提高25%,如果携带了铸斧，额外提高25%。"--与NPC战斗时，枫影二刃造成的伤害提高25%，如果同时携带两件相同造型巨斧，额外提高25%
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000037
		jns[8] = 0x10000038
	elseif jn == "俾睨" then--写完ok
		jns[1] = "使用三荒尽灭造成的伤害提高10%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000041
		jns[8] = 0x10000042
	elseif jn == "识破" then--写完ok
		jns[1] = "一斧开天和三荒尽灭的浮空概率增加5%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000043
		jns[8] = 0x10000044
	elseif jn == "得势" then--写完ok
		jns[1] = "使用一斧开天造成的伤害提高15%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000045
		jns[8] = 0x10000046
	elseif jn == "飞扬" then--写完ok
		jns[1] = "如果你使用“三荒尽灭、三荒尽灭、力辟苍穹”技能组合造成≥5个目标同时浮空，你造成的所有伤害提高6%，每场战斗最多叠加3次。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000047
		jns[8] = 0x10000048

	elseif jn == "凌人" then--写完ok
		jns[1] = "黎魂触发3个技能概率增加8%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000049
		jns[8] = 0x10000050


	elseif jn == "生风" then--写完ok
		jns[1] = "使用铁血生风时如果目标处于浮空状态，有8%概率再释放一次铁血生风，可重复触发。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000051
		jns[8] = 0x10000052
	elseif jn == "蛮横" then--写完ok
		jns[1] = "物理暴击几率提升3%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000053
		jns[8] = 0x10000054
	elseif jn == "难保" then
		jns[1] = "攻击浮空单位时，目标无法被保护，且目标被保护的概率减少20%。"--攻击浮空单位时，目标被保护的概率减少20%。
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000055
		jns[8] = 0x10000056
	elseif jn == "乘风" then--写完ok
		jns[1] = "一斧开天必定令目标浮空。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000057
		jns[8] = 0x10000058
	elseif jn == "擎天" then
		jns[1] = "铁火双扬作用目标数增加1，但具有12回合的冷却回合（战斗开始时具有6回合冷却）。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000059
		jns[8] = 0x10000060
	elseif jn == "族魂" then--写完ok
		jns[1] = "队伍中只有1名九黎城玩家时，造成的伤害提高20%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000061
		jns[8] = 0x10000062

	elseif jn == "魂力" then--写完ok
		jns[1] = "炎魂的伤害力增加效果提高60%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000063
		jns[8] = 0x10000064


	elseif jn == "狂暴" then--写完ok
		jns[1] = "你的攻击触发暴击时，额外增加一点连击值。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000065
		jns[8] = 0x10000066
	elseif jn == "驭魔" then -----
		jns[1] = "驭魔笼效果提高25%。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000067
		jns[8] = 0x10000068
	elseif jn == "野蛮" then--写完ok
		jns[1] = "击杀召唤物或孩子单位时，下回合“黎魂”必定触发3个技能。"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000069
		jns[8] = 0x10000070
	elseif jn == "魔神之刃" then--写完ok
		jns[1] = "使用一次特殊的力劈苍穹，造成的伤害提高10%并且暴击伤害倍率增加100%，但仅作用1个浮空目标。（战斗开始时具有2回合冷却）"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[6] = "jmtb.wdf"
		jns[7] = 0x10000071
		jns[8] = 0x10000072
		jns[12] = "8回合"

	--



elseif jn == "不灭" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAE728B11
		jns[8] = 0xAE728B11
elseif jn == "感念" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDC31E128
		jns[8] = 0xDC31E128
elseif jn == "静心" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000122
		jns[8] = 0x00000122
elseif jn == "矫健" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000108
		jns[8] = 0x00000108
elseif jn == "怒火" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000210
		jns[8] = 0x00000210
elseif jn == "威吓" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3816E2FC
		jns[8] = 0x3816E2FC
elseif jn == "余韵" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8009DFB1
		jns[8] = 0x8009DFB1
elseif jn == "持戒" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x7B3ACA53
		jns[8] = 0x7B3ACA53
elseif jn == "混元" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x03636ACD
		jns[8] = 0x03636ACD
elseif jn == "聚魂" then--无底洞
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0EF6D102
		jns[8] = 0x0EF6D102
elseif jn == "救主" then---狮驼岭
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "经脉修复.wdf"
		jns[7] = 0x00000125
		jns[8] = 0x00000125
elseif jn == "灵能" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF316F196
		jns[8] = 0xF316F196
elseif jn == "震怒" then
		jns[1] = "无介绍报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0x403FE10F
		jns[8] = 0x403FE10F
	else
	    jns[1] = "无图片报错管理员"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA209C3C2
		jns[8] = 0xA209C3C2
	end
	return jns
end


function 引擎.取状态图标(jn)
	local jns = {}
	if jn == "毒" then
	   jns[1] = 0xE2C478F8
	   jns[2] = "物品图标.wdf"
	elseif jn == "逆鳞" then
		   jns[1] = 0xE2C973B2
		   jns[2] = "物品图标.wdf"
    elseif jn == "牛劲" then
		   jns[1] = 0x4062BFE4
		   jns[2] = "物品图标.wdf"
    elseif jn == "血雨" then
		   jns[1] = 0x7D52C301
		   jns[2] = "物品图标.wdf"
	elseif jn == "雾杀" then
		   jns[1] = 0x0DA2D8DF
		   jns[2] = "物品图标.wdf"
    elseif jn == "炎护" then
		   jns[1] = 0xC5D73984
		   jns[2] = "物品图标.wdf"
    elseif jn == "变身" then
		   jns[1] = 0xDA9CD712
		   jns[2] = "物品图标.wdf"
    elseif jn == "鹰击" then
		   jns[1] = 0x56070FE9
		   jns[2] = "物品图标.wdf"
    elseif jn == "威慑" then
		   jns[1] = 0x35532015
		   jns[2] = "物品图标.wdf"
    elseif jn == "蓝灯" then
		   jns[1] = 0x6484CE2C
		   jns[2] = "物品图标.wdf"
    elseif jn == "红灯" then
		   jns[1] = 0xA4558B86
		   jns[2] = "物品图标.wdf"
	elseif jn == "宁心" then
		   jns[1] = 0x74B29E7D
		   jns[2] = "物品图标.wdf"
	elseif jn == "错乱" then
		   jns[1] = 0xFFB5624B
		   jns[2] = "物品图标.wdf"
    elseif jn == "腾雷" then
		   jns[1] = 0x956BA0A2
		   jns[2] = "物品图标.wdf"
    elseif jn == "智眼" then
		   jns[1] = 0xA7592BE7
		   jns[2] = "物品图标.wdf"
    elseif jn == "怒眼" then
		   jns[1] = 0xA7592BE7
		   jns[2] = "物品图标.wdf"
    elseif jn == "天眼" then
		   jns[1] = 0xA7592BE7
		   jns[2] = "物品图标.wdf"
    elseif jn == "返场" then
		   jns[1] = 0xA7592BE7
		   jns[2] = "物品图标.wdf"
	elseif jn == "疯狂" then
		   jns[1] = 0xABF46236
		   jns[2] = "物品图标.wdf"
    elseif jn == "复苏" then
		   jns[1] = 0xAB18B4B0
		   jns[2] = "物品图标.wdf"
    elseif jn == "瘴气" then
		   jns[1] = 0xE63FB407
		   jns[2] = "物品图标.wdf"
    elseif jn == "安神诀" then
		   jns[1] = 0x8368E31C
		   jns[2] = "物品图标.wdf"
    elseif jn == "杀气诀" then
		   jns[1] = 0x4F10E7C8
		   jns[2] = "物品图标.wdf"
    elseif jn == "修罗咒" then
		   jns[1] = 0x14FF0C1F
		   jns[2] = "物品图标.wdf"
	elseif jn == "火甲术" then
		   jns[1] = 0xC02762DD
		   jns[2] = "物品图标.wdf"
    elseif jn == "魔息术" then
		   jns[1] = 0x2EEC86A4
		   jns[2] = "物品图标.wdf"
    elseif jn == "连环击" then
		   jns[1] = 0x28256D06
		   jns[2] = "物品图标.wdf"
    elseif jn == "碎星诀" then
		   jns[1] = 0x5F8D7935
		   jns[2] = "物品图标.wdf"
    elseif jn == "镇魂诀" then
		   jns[1] = 0xF808DCC6
		   jns[2] = "物品图标.wdf"
    elseif jn == "煞气诀" then
		   jns[1] = 0x28D6DCD8
		   jns[2] = "物品图标.wdf"
    elseif jn == "摧心术" then
		   jns[1] = 0xD6A5B20C
		   jns[2] = "物品图标.wdf"
    elseif jn == "惊魂掌" then
		   jns[1] = 0x71307D22
		   jns[2] = "物品图标.wdf"
    elseif jn == "夺魄令" then
		   jns[1] = 0x076EA85A
		   jns[2] = "物品图标.wdf"
    elseif jn == "锢魂术" then
		   jns[1] = 0x2EC10ADD
		   jns[2] = "物品图标.wdf"
    elseif jn == "寡欲令" then
		   jns[1] = 0x1CC4C18F
		   jns[2] = "物品图标.wdf"
    elseif jn == "凝神术" then
		   jns[1] = 0xB76A6542
		   jns[2] = "物品图标.wdf"
    elseif jn == "分身术" then
		   jns[1] = 0x559B2E13
		   jns[2] = "物品图标.wdf"
    elseif jn == "离魂符" then
		   jns[1] = 0xC7FE7637
		   jns[2] = "物品图标.wdf"
    elseif jn == "失魂符" then
		   jns[1] = 0x8FF10842
		   jns[2] = "物品图标.wdf"
	elseif jn == "定身符" then
		   jns[1] = 0x975DA9B5
		   jns[2] = "物品图标.wdf"
    elseif jn == "碎甲符" then
		   jns[1] = 0xBD46AEDE
		   jns[2] = "物品图标.wdf"
    elseif jn == "失心符" then
		   jns[1] = 0xCB1E4D52
		   jns[2] = "物品图标.wdf"
    elseif jn == "落魄符" then
		   jns[1] = 0x795E9104
		   jns[2] = "物品图标.wdf"
    elseif jn == "失忆符" then
		   jns[1] = 0xA1343135
		   jns[2] = "物品图标.wdf"
    elseif jn == "追魂符" then
		   jns[1] = 0x8F4B3740
		   jns[2] = "物品图标.wdf"
    elseif jn == "暗器毒" then
		   jns[1] = 0x8AC6F05B
		   jns[2] = "物品图标.wdf"
    elseif jn == "尸腐毒" then
		   jns[1] = 0x8AC6F05B
		   jns[2] = "物品图标.wdf"
    elseif jn == "尸腐毒 " then
		   jns[1] = 0x8AC6F05B
		   jns[2] = "物品图标.wdf"
    elseif jn == "紧箍咒" then
		   jns[1] = 0x3908C648
		   jns[2] = "物品图标.wdf"
    elseif jn == "盘丝阵" then
		   jns[1] = 0x6974146E
		   jns[2] = "物品图标.wdf"
    elseif jn == "幻镜术" then
		   jns[1] = 0x241E44A3
		   jns[2] = "物品图标.wdf"
    elseif jn == "冰川怒" then
		   jns[1] = 0x3B12CD18
		   jns[2] = "物品图标.wdf"
    elseif jn == "冰川怒伤" then
		   jns[1] = 0x3B12CD18
		   jns[2] = "物品图标.wdf"
    elseif jn == "其疾如风" then
		   jns[1] = 0x184E7180
		   jns[2] = "物品图标.wdf"
    elseif jn == "不动如山" then
		   jns[1] = 0x02662BEE
		   jns[2] = "物品图标.wdf"
    elseif jn == "侵掠如火" then
		   jns[1] = 0x625EABBA
		   jns[2] = "物品图标.wdf"
    elseif jn == "太极护法" then
		   jns[1] = 0x00000010
		   jns[2] = "物品图标.wdf"
   elseif jn == "菩提心佑" then
		  jns[1] = 0x00000010
		  jns[2] = "物品图标.wdf"
	elseif jn == "身似菩提" then
		jns[1] = 0x00000012
		jns[2] = "物品图标.wdf"
	elseif jn == "先发制人" then
		jns[1] = 0x00000014
		jns[2] = "物品图标.wdf"
	elseif jn == "北冥之渊" then--
		jns[1] = 0X00000032
		jns[2] = "素材修复.wdf"
    elseif jn == "无畏布施" then
   	    jns[1] = 0X00000275
   	    jns[2] = "素材修复.wdf"
	elseif jn == "天衣无缝" then
		   jns[1] = 0x76F6DD9E
		   jns[2] = "物品图标.wdf"
    elseif jn == "光辉之甲" then
		   jns[1] = 0x00000008
		   jns[2] = "物品图标.wdf"
    elseif jn == "圣灵之甲" then
		   jns[1] = 0x00000004
		   jns[2] = "物品图标.wdf"
    elseif jn == "放下屠刀" then
		   jns[1] = 0x1A4D1A72
		   jns[2] = "物品图标.wdf"
    elseif jn == "河东狮吼" then
		   jns[1] = 0x52CE6E52
		   jns[2] = "物品图标.wdf"
    elseif jn == "破釜沉舟" then
		   jns[1] = 0x24E57349
		   jns[2] = "物品图标.wdf"
    elseif jn == "横扫千军" then
		   jns[1] = 0xB0E3E18B
		   jns[2] = "物品图标.wdf"
    elseif jn == "后发制人" then
		   jns[1] = 0x424D9459
		   jns[2] = "物品图标.wdf"
    elseif jn == "龙骇龙腾" then
		   jns[1] = 0xE2C973B2
		   jns[2] = "物品图标.wdf"
    elseif jn == "龙骇龙卷" then
		   jns[1] = 0xE2C973B2
		   jns[2] = "物品图标.wdf"
    elseif jn == "金刚护法" then
		   jns[1] = 0xDC94C31C
		   jns[2] = "物品图标.wdf"
    elseif jn == "金刚护体" then
		   jns[1] = 0xCDD65C55
		   jns[2] = "物品图标.wdf"
    elseif jn == "韦陀护法" then
		   jns[1] = 0xAC27CC91
		   jns[2] = "物品图标.wdf"
    elseif jn == "佛法无边" then
		   jns[1] = 0xB8C91B23
		   jns[2] = "物品图标.wdf"
    elseif jn == "达摩护体" then
		   jns[1] = 0xBAAB7B8B
		   jns[2] = "物品图标.wdf"
    elseif jn == "一苇渡江" then
		   jns[1] = 0x43C01A12
		   jns[2] = "物品图标.wdf"
    elseif jn == "神龙摆尾" then
		   jns[1] = 0x975B5587
		   jns[2] = "物品图标.wdf"
    elseif jn == "乘风破浪" then
		   jns[1] = 0xC06DBC74
		   jns[2] = "物品图标.wdf"
    elseif jn == "摇头摆尾" then
		   jns[1] = 0x69F9FFD0
		   jns[2] = "物品图标.wdf"
    elseif jn == "无敌牛妖" then
		   jns[1] = 0xA5385E3B
		   jns[2] = "物品图标.wdf"
    elseif jn == "无敌牛虱" then
		   jns[1] = 0x35C31747
		   jns[2] = "物品图标.wdf"
    elseif jn == "魔王回首" then
		   jns[1] = 0xB56E84D0
		   jns[2] = "物品图标.wdf"
    elseif jn == "天魔解体" then
		   jns[1] = 0x93A98451
		   jns[2] = "物品图标.wdf"
    elseif jn == "极度疯狂" then
		   jns[1] = 0xABF46236
		   jns[2] = "物品图标.wdf"
    elseif jn == "不动如山" then
		   jns[1] = 0x38C47290
		   jns[2] = "物品图标.wdf"
    elseif jn == "无穷妙道" then
		   jns[1] = 0x76FBBEEC
		   jns[2] = "物品图标.wdf"
	elseif jn == "金身舍利" then
		   jns[1] = 0xFE884980
		   jns[2] = "物品图标.wdf"
	elseif jn == "移魂化骨" then
		   jns[1] = 0x121AC8D4
		   jns[2] = "物品图标.wdf"
    elseif jn == "明光宝烛" then
		   jns[1] = 0x59D84304
		   jns[2] = "物品图标.wdf"
    elseif jn == "天地同寿" then
		   jns[1] = 0xC464481B
		   jns[2] = "物品图标.wdf"
    elseif jn == "乾坤妙法" then
		   jns[1] = 0xC464481B
		   jns[2] = "物品图标.wdf"
    elseif jn == "日月乾坤" then
		   jns[1] = 0xCFF9CA32
		   jns[2] = "物品图标.wdf"
    elseif jn == "炼气化神" then
		   jns[1] = 0x6484CE2C
		   jns[2] = "物品图标.wdf"
    elseif jn == "生命之泉" then
		   jns[1] = 0xA4558B86
		   jns[2] = "物品图标.wdf"
    elseif jn == "知己知彼" then
		   jns[1] = 0x91EC4841
		   jns[2] = "物品图标.wdf"
    elseif jn == "天神护体" then
		   jns[1] = 0xFA64E7B9
		   jns[2] = "物品图标.wdf"
    elseif jn == "天神护法" then
		   jns[1] = 0xDF877E23
		   jns[2] = "物品图标.wdf"
    elseif jn == "反间之计" then
		   jns[1] = 0x3225863C
		   jns[2] = "物品图标.wdf"
	elseif jn == "百万神兵" then
		   jns[1] = 0xFF5FCC5F
		   jns[2] = "物品图标.wdf"
    elseif jn == "修罗隐身" then
		   jns[1] = 0xB759D696
		   jns[2] = "物品图标.wdf"
    elseif jn == "黄泉之息" then
		   jns[1] = 0x70D5CD29
		   jns[2] = "物品图标.wdf"
    elseif jn == "幽冥鬼眼" then
		   jns[1] = 0xA7592BE7
		   jns[2] = "物品图标.wdf"
    elseif jn == "普渡众生" then
		   jns[1] = 0xCB1639D1
		   jns[2] = "物品图标.wdf"
    elseif jn == "灵动九天" then
		   jns[1] = 0x728DE1CD
		   jns[2] = "物品图标.wdf"
    elseif jn == "颠倒五行" then
		   jns[1] = 0xD78FBB42
		   jns[2] = "物品图标.wdf"
    elseif jn == "魔音摄魂" then
		   jns[1] = 0x5CACF37F
		   jns[2] = "物品图标.wdf"
    elseif jn == "含情脉脉" then
		   jns[1] = 0x9A5880DC
		   jns[2] = "物品图标.wdf"
    elseif jn == "天罗地网" then
		   jns[1] = 0x56DE11A1
		   jns[2] = "物品图标.wdf"
    elseif jn == "红袖添香" then
		   jns[1] = 0x68C68B02
		   jns[2] = "物品图标.wdf"
    elseif jn == "娉婷袅娜" then
		   jns[1] = 0x53B01707
		   jns[2] = "物品图标.wdf"
    elseif jn == "飞花摘叶" then
		   jns[1] = 0x74FF026F
		   jns[2] = "物品图标.wdf"
    elseif jn == "似玉生香" then
		   jns[1] = 0xD2123BE8
		   jns[2] = "物品图标.wdf"
    elseif jn == "楚楚可怜" then
		   jns[1] = 0x38C7C348
		   jns[2] = "物品图标.wdf"
    elseif jn == "一笑倾城" then
		   jns[1] = 0x1F215E91
		   jns[2] = "物品图标.wdf"
    elseif jn == "雨落寒沙" then
		   jns[1] = 0x21883613
		   jns[2] = "物品图标.wdf"
    elseif jn == "如花解语" then
		   jns[1] = 0x4C8034D4
		   jns[2] = "物品图标.wdf"
    elseif jn == "莲步轻舞" then
		   jns[1] = 0xFCF44944
		   jns[2] = "物品图标.wdf"
    elseif jn == "百毒不侵" then
		   jns[1] = 0x37F7C199
		   jns[2] = "物品图标.wdf"
    elseif jn == "法术防御" then
		   jns[1] = 0x00000022
		   jns[2] = "物品图标.wdf"
    elseif jn == "死亡召唤" then
		   jns[1] = 0xFF0E4570
		   jns[2] = "物品图标.wdf"
    elseif jn == "轰鸣" then
		   jns[1] = 0x00000022
		   jns[2] = "状态图标.wdf"
    elseif jn == "背水" then
		   jns[1] = 0x00000086
		   jns[2] = "状态图标.wdf"
    elseif jn == "汲魂" then
		   jns[1] = 0x00000028
		   jns[2] = "状态图标.wdf"
    elseif jn == "象形" then
		   jns[1] = 0x00000070
		   jns[2] = "状态图标.wdf"
    elseif jn == "龙魂" then
		   jns[1] = 0x00000042
		   jns[2] = "状态图标.wdf"
    elseif jn == "催化" then
		   jns[1] = 0x00000002
		   jns[2] = "状态图标.wdf"
    elseif jn == "狂怒" then
		   jns[1] = 0x00000034
		   jns[2] = "状态图标.wdf"
    elseif jn == "迷瘴" then
		   jns[1] = 0x00000045
		   jns[2] = "状态图标.wdf"
    elseif jn == "毒萃" then
		   jns[1] = 0x00000009
		   jns[2] = "状态图标.wdf"
    elseif jn == "自矜" then
		   jns[1] = 0x00000083
		   jns[2] = "状态图标.wdf"
    elseif jn == "花护" then
		   jns[1] = 0x00000025
		   jns[2] = "状态图标.wdf"
    elseif jn == "不灭" then
		   jns[1] = 0x00000088
		   jns[2] = "状态图标.wdf"
    elseif jn == "摧心" then
		   jns[1] = 0x00000004
		   jns[2] = "状态图标.wdf"
    elseif jn == "盾气" then
		   jns[1] = 0x00000012
		   jns[2] = "状态图标.wdf"
    elseif jn == "神焰" then
		   jns[1] = 0x00000055
		   jns[2] = "状态图标.wdf"
    elseif jn == "爪印" then
		   jns[1] = 0x00000076
		   jns[2] = "状态图标.wdf"
    elseif jn == "风灵" then
		   jns[1] = 0x00000016
		   jns[2] = "状态图标.wdf"
    elseif jn == "魔冥" then
		   jns[1] = 0x00000048
		   jns[2] = "状态图标.wdf"
    elseif jn == "风魂" then
		   jns[1] = 0x00000015
		   jns[2] = "状态图标.wdf"
    elseif jn == "定心术" then
		   jns[1] = 0x00000008
		   jns[2] = "状态图标.wdf"
    elseif jn == "催眠符" then
		   jns[1] = 0x00000003
		   jns[2] = "状态图标.wdf"
    elseif jn == "真君显灵" then
		   jns[1] = 0x00000077
		   jns[2] = "状态图标.wdf"
    elseif jn == "同舟共济" then
		   jns[1] = 0x00000064
		   jns[2] = "状态图标.wdf"
    elseif jn == "妖风四起" then
		   jns[1] = 0x00000074
		   jns[2] = "状态图标.wdf"
    elseif jn == "魍魉追魂" then
		   jns[1] = 0x00000065
		   jns[2] = "状态图标.wdf"
    elseif jn == "雷浪穿云" then
		   jns[1] = 0x00000037
		   jns[2] = "状态图标.wdf"
    elseif jn == "诸天看护" then
		   jns[1] = 0x00000082
		   jns[2] = "状态图标.wdf"
    elseif jn == "渡劫金身" then
		   jns[1] = 0x00000010
		   jns[2] = "状态图标.wdf"
    elseif jn == "四面埋伏" then
		   jns[1] = 0x00000059
		   jns[2] = "状态图标.wdf"
    elseif jn == "翩鸿一击" then
		   jns[1] = 0x00000050
		   jns[2] = "状态图标.wdf"
    elseif jn == "凋零之歌" then
		   jns[1] = 0x00000007
		   jns[2] = "状态图标.wdf"
    elseif jn == "六道无量" then
		   jns[1] = 0x00000041
		   jns[2] = "状态图标.wdf"
    elseif jn == "落花成泥" then
		   jns[1] = 0x00000044
		   jns[2] = "状态图标.wdf"
    elseif jn == "波澜不惊" then
		   jns[1] = 0x00000087
		   jns[2] = "状态图标.wdf"
    elseif jn == "莲心剑意" then
		   jns[1] = 0x00000039
		   jns[2] = "状态图标.wdf"
    elseif jn == "霹雳弦惊" then
		   jns[1] = 0x00000049
		   jns[2] = "状态图标.wdf"
    elseif jn == "雷怒霆激" then
		   jns[1] = 0x00000038
		   jns[2] = "状态图标.wdf"
    elseif jn == "心随意动" then
		   jns[1] = 0x00000073
		   jns[2] = "状态图标.wdf"
    elseif jn == "顺势而为" then
		   jns[1] = 0x00000058
		   jns[2] = "状态图标.wdf"
    elseif jn == "钟馗论道" then
		   jns[1] = 0x00000080
		   jns[2] = "状态图标.wdf"
    elseif jn == "超级战意" then
		   jns[1] = 0x00000090
		   jns[2] = "状态图标.wdf"
    elseif jn == "画地为牢" then
		   jns[1] = 0x00000026
		   jns[2] = "状态图标.wdf"
    elseif jn == "重创" then
		   jns[1] = 0x00000081
		   jns[2] = "状态图标.wdf"
    elseif jn == "摄魂" then
		   jns[1] = 0x00000054
		   jns[2] = "状态图标.wdf"
    elseif jn == "剑意" then
		   jns[1] = 0x00000029
		   jns[2] = "状态图标.wdf"
    elseif jn == "轮回" then
		   jns[1] = 0x00000043
		   jns[2] = "状态图标.wdf"
    elseif jn == "符咒" then
		   jns[1] = 0x00000017
		   jns[2] = "状态图标.wdf"
    elseif jn == "雷法" then
		   jns[1] = 0x00000036
		   jns[2] = "状态图标.wdf"
    elseif jn == "灵药" then
		   jns[1] = 0x00000040
		   jns[2] = "状态图标.wdf"
    elseif jn == "五行珠" then
		   jns[1] = 0x00000068
		   jns[2] = "状态图标.wdf"
    elseif jn == "无尘扇" then
		   jns[1] = 0x00000066
		   jns[2] = "状态图标.wdf"
    elseif jn == "混元伞" then
		   jns[1] = 0x00000027
		   jns[2] = "状态图标.wdf"
    elseif jn == "发瘟匣" then
		   jns[1] = 0x00000014
		   jns[2] = "状态图标.wdf"
    elseif jn == "碎甲刃" then
		   jns[1] = 0x00000060
		   jns[2] = "状态图标.wdf"
    elseif jn == "缚妖索" then
		   jns[1] = 0x00000019
		   jns[2] = "状态图标.wdf"
    elseif jn == "捆仙绳" then
		   jns[1] = 0x00000035
		   jns[2] = "状态图标.wdf"
    elseif jn == "缚龙索" then
		   jns[1] = 0x00000018
		   jns[2] = "状态图标.wdf"
	elseif jn == "苍白纸人" then
		   jns[1] = 0x00000089
		   jns[2] = "状态图标.wdf"
    elseif jn == "干将莫邪" then
		   jns[1] = 0x00000020
		   jns[2] = "状态图标.wdf"
    elseif jn == "金甲仙衣" then
		   jns[1] = 0x00000031
		   jns[2] = "状态图标.wdf"
    elseif jn == "无魂傀儡" then
		   jns[1] = 0x00000067
		   jns[2] = "状态图标.wdf"
    elseif jn == "断线木偶" then
		   jns[1] = 0x00000011
		   jns[2] = "状态图标.wdf"
    elseif jn == "降魔斗篷" then
		   jns[1] = 0x00000030
		   jns[2] = "状态图标.wdf"
    elseif jn == "人参娃娃" then
		   jns[1] = 0x00000053
		   jns[2] = "状态图标.wdf"
    elseif jn == "乾坤玄火塔" then
		   jns[1] = 0x00000051
		   jns[2] = "状态图标.wdf"
    elseif jn == "战意" then
		   jns[1] = 0x00000075
		   jns[2] = "状态图标.wdf"
    elseif jn == "护盾" then
		   jns[1] = 0x00000024
		   jns[2] = "状态图标.wdf"
    elseif jn == "清净" then
		   jns[1] = 0x00000052
		   jns[2] = "状态图标.wdf"
	elseif jn == "夺目" then
		   jns[1] = 0x00000013
		   jns[2] = "状态图标.wdf"
    elseif jn == "五雷挪移" then
		   jns[1] = 0x00000069
		   jns[2] = "状态图标.wdf"
	elseif jn == "绝处逢生" then
		   jns[1] = 0x00000033
		   jns[2] = "状态图标.wdf"
    else
	    jns[1] = 0xCFF9CA32
	    jns[2] = "物品图标.wdf"
	end

   return jns
end

------经脉修复  物品图标 素材修复 状态图标

