--======================================================================--
--	☆ 作者：飞蛾扑火 QQ：1415559882
--======================================================================--
local tp
local xys = 生成XY
local 场景类_特效点 = class()

function 场景类_特效点:初始化(x,y,切换,资源)
	tp = 引擎.场景
	self.坐标 = xys(x*20,y*20)
	self.特效点 =  tp.资源:载入(资源,"网易WDF动画",切换)-- self.特效点 =  tp.资源:载入('mapani.wdf',"网易WDF动画",0x082DB080)--荷花
end



function 场景类_特效点:显示(dt,x,y,pys,zb)
	if (tp.角色坐标.x >= self.坐标.x-1200-self.特效点:取高度()
		and tp.角色坐标.x <= self.坐标.x + 1200+self.特效点:取高度()
		and tp.角色坐标.y >= self.坐标.y-1200-self.特效点:取宽度()
		and tp.角色坐标.y <= self.坐标.y + 1000+self.特效点:取宽度()+200)
	then
	    self.特效点:显示(self.坐标.x + pys.x,self.坐标.y + pys.y,zb)
        self.特效点:更新(dt)
    end
end



function 取传特效表(地图ID)

	local 特效表 = {}
	if 地图ID == 1003 then--桃源镇
      特效表[1] = {x=93,y=83,切换=0x082DB080,资源='mapani.wdf'}--荷花1
      特效表[2] = {x=25,y=87,切换=0x053643EE,资源='mapani.wdf'}--鸡
      特效表[3] = {x=70,y=40,切换=0xF7748D13,资源='mapani.wdf'}--漂浮在水面的破桶
      特效表[4] = {x=133,y=88,切换=0xF8FC9410,资源='mapani.wdf'}--2条小瀑布
      特效表[5] = {x=125,y=90,切换=0xF8FC9410,资源='mapani.wdf'}
      特效表[6] = {x=115,y=94,切换=0xF8FC9410,资源='mapani.wdf'}
      特效表[7] = {x=54,y=21,切换=0xF8FC9410,资源='mapani.wdf'}
      特效表[8] = {x=50,y=35,切换=0xF5EEBC5A,资源='mapani.wdf'}--大瀑布
      特效表[9] = {x=128,y=100,切换=0xF5EEBC5A,资源='mapani.wdf'}
      特效表[10] = {x=120,y=105,切换=0xF5EEBC5A,资源='mapani.wdf'}
      特效表[11] = {x=94,y=24,切换=0xF44FFBD9,资源='mapani.wdf'}--蝴蝶
      特效表[12] = {x=117,y=36,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[13] = {x=144,y=57,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[14] = {x=55,y=76,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[15] = {x=14,y=75,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[16] = {x=3,y=85,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[17] = {x=34,y=93,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[18] = {x=62,y=96,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[19] = {x=4,y=37,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[20] = {x=3,y=24,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[21] = {x=4,y=11,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[22] = {x=4,y=12,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[23] = {x=150,y=29,切换=0xF44FFBD9,资源='mapani.wdf'}
      特效表[24] = {x=78,y=43,切换=0xF399E2D5,资源='mapani.wdf'}--小小流水1
      特效表[25] = {x=95,y=67,切换=0xF12D26BF,资源='mapani.wdf'}--小小流水2 莲台旁边雾
      特效表[26] = {x=38,y=37,切换=0xF12D26BF,资源='mapani.wdf'}
      特效表[27] = {x=20,y=3,切换=0xF12D26BF,资源='mapani.wdf'}
      特效表[28] = {x=61,y=-5,切换=0xF8FC9410,资源='mapani.wdf'}
      特效表[29] = {x=100,y=60,切换=0xE6C9DA43,资源='mapani.wdf'}--石头莲台
      特效表[30] = {x=128,y=79,切换=0xE4F642AD,资源='mapani.wdf'}--小小绿色流水
      特效表[31] = {x=105,y=75,切换=0xE4F642AD,资源='mapani.wdf'}
      特效表[32] = {x=105,y=95,切换=0xE4F642AD,资源='mapani.wdf'}
      特效表[33] = {x=52,y=13,切换=0xE4F642AD,资源='mapani.wdf'}
      特效表[34] = {x=37,y=5,切换=0xE4F642AD,资源='mapani.wdf'}
      特效表[35] = {x=65,y=4,切换=0xE4F642AD,资源='mapani.wdf'}
      特效表[36] = {x=88,y=81,切换=0xE4B1EAF0,资源='mapani.wdf'}--3只小鱼
      特效表[37] = {x=100,y=55,切换=0xDEE88F48,资源='mapani.wdf'}--蓝色水波
      特效表[38] = {x=100,y=70,切换=0xBC57BF81,资源='mapani.wdf'}--蓝色水波2
      特效表[39] = {x=34,y=53,切换=0xBC57BF81,资源='mapani.wdf'}
      特效表[40] = {x=26,y=73,切换=0xBC57BF81,资源='mapani.wdf'}
      特效表[41] = {x=33,y=77,切换=0xBC57BF81,资源='mapani.wdf'}
      特效表[42] = {x=71,y=80,切换=0xBC57BF81,资源='mapani.wdf'}
      特效表[43] = {x=78,y=83,切换=0x766312A3,资源='mapani.wdf'}--一圈蓝色水波
      特效表[44] = {x=34,y=77,切换=0x766312A3,资源='mapani.wdf'}
      特效表[45] = {x=39,y=45,切换=0x766312A3,资源='mapani.wdf'}
      特效表[46] = {x=100,y=79,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
      特效表[47] = {x=106,y=79,切换=0x7589FB64,资源='mapani.wdf'}
      特效表[48] = {x=106,y=75,切换=0x7589FB64,资源='mapani.wdf'}
      特效表[49] = {x=103,y=73,切换=0x7589FB64,资源='mapani.wdf'}
      -- 特效表[50] = {x=138,y=83,切换=0x6BA9BE9A,资源='mapani.wdf'}--自动水阀
      -- 特效表[50] = {x=75,y=85,切换=0xF1CD0D39,资源='mapani.wdf'}--自动水阀2
      -- 特效表[50] = {x=75,y=85,切换=0x72332DD4,资源='mapani.wdf'}--长绿色漂叶
      --6FE2B740 白金花瓣飘
      特效表[50] = {x=34,y=8,切换=0x8188BE83,资源='mapani.wdf'}--野鹤
      特效表[51] = {x=35,y=11,切换=0x8188BE83,资源='mapani.wdf'}
      特效表[52] = {x=54,y=32,切换=0x8362DCB4,资源='mapani.wdf'}--跳起来的小鱼
      特效表[53] = {x=60,y=30,切换=0x8362DCB4,资源='mapani.wdf'}
      特效表[54] = {x=8,y=8,切换=0xA61255E8,资源='mapani.wdf'}--粉红色花瓣
      特效表[55] = {x=2,y=12,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[56] = {x=83,y=6,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[57] = {x=91,y=29,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[58] = {x=148,y=31,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[59] = {x=154,y=26,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[60] = {x=166,y=3,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[61] = {x=181,y=4,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[62] = {x=184,y=10,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[63] = {x=143,y=59,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[64] = {x=159,y=91,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[65] = {x=145,y=92,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[66] = {x=54,y=79,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[67] = {x=14,y=74,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[68] = {x=1,y=36,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[69] = {x=4,y=86,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[70] = {x=1,y=61,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[71] = {x=35,y=94,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[72] = {x=49,y=95,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[73] = {x=62,y=95,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[74] = {x=114,y=41,切换=0xA61255E8,资源='mapani.wdf'}
      特效表[75] = {x=177,y=80,切换=0x3295EB4E,资源='mapani.wdf'}--竹子绿色长树叶
      特效表[76] = {x=184,y=48,切换=0x3295EB4E,资源='mapani.wdf'}
      特效表[77] = {x=180,y=20,切换=0x3295EB4E,资源='mapani.wdf'}
      -- 特效表[51] = {x=55,y=81,切换="桃花",资源='mapani.wdf'}--自动水阀2
      -- 特效表[52] = {x=55,y=81,切换=0x11A50D66,资源='mapani.wdf'}--枫叶色枫叶
      -- 特效表[53] = {x=55,y=81,切换=0x13F1F78B,资源='mapani.wdf'}--花瓣1
      --
      -- 特效表[55] = {x=55,y=81,切换=0x4B746BFE,资源='mapani.wdf'}--蓝色花瓣
      -- 特效表[56] = {x=55,y=81,切换=0x6FE2B740,资源='mapani.wdf'}--金白色花瓣
	elseif 地图ID == 1506 then--"东海湾"
		特效表[1] = {x=61,y=6,切换=0x0CCFBB45,资源='mapani.wdf'}--瀑布
		特效表[2] = {x=45,y=49,切换=0x0F11ADFC,资源='mapani.wdf'}--瀑布1
		特效表[3] = {x=40,y=90,切换=0x0F11ADFC,资源='mapani.wdf'}
		特效表[4] = {x=43,y=100,切换=0x1592E42D,资源='mapani.wdf'}
		特效表[5] = {x=25,y=115,切换=0x1592E42D,资源='mapani.wdf'}
		特效表[6] = {x=40,y=40,切换=0x73C3E7FF,资源='mapani.wdf'}--小瀑布
		特效表[7] = {x=43,y=40,切换=0x73C3E7FF,资源='mapani.wdf'}
		特效表[8] = {x=33,y=53,切换=0x8C20E9CE,资源='mapani.wdf'}
		特效表[9] = {x=33,y=73,切换=0x0F11ADFC,资源='mapani.wdf'}
		特效表[10] = {x=30,y=73,切换=0x0F11ADFC,资源='mapani.wdf'}
		特效表[11] = {x=38,y=76,切换=0xF140212C,资源='mapani.wdf'}
		特效表[12] = {x=102,y=110,切换=0xE4F642AD,资源='mapani.wdf'}--小小绿色流水
		特效表[13] = {x=105,y=53,切换=0xE4F642AD,资源='mapani.wdf'}
		特效表[14] = {x=108,y=52,切换=0x58837CB1,资源='mapani.wdf'}
	elseif 地图ID == 1507 then--"东海海底"
		特效表[1] = {x=44,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=15,y=34,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=47,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=29,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=10,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=48,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=22,y=21,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=46,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[9] = {x=33,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=56,y=34,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=6,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=145,y=61,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[13] = {x=111,y=61,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[14] = {x=72,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[15] = {x=18,y=63,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[16] = {x=29,y=48,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[17] = {x=82,y=46,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[18] = {x=11,y=65,切换=0x766312A3,资源='mapani.wdf'}
		特效表[19] = {x=19,y=57,切换=0x766312A3,资源='mapani.wdf'}
		特效表[20] = {x=35,y=67,切换=0x766312A3,资源='mapani.wdf'}
		特效表[21] = {x=57,y=64,切换=0x766312A3,资源='mapani.wdf'}
		特效表[22] = {x=7,y=43,切换=0x766312A3,资源='mapani.wdf'}
		特效表[23] = {x=29,y=37,切换=0x766312A3,资源='mapani.wdf'}
		特效表[24] = {x=10,y=19,切换=0x766312A3,资源='mapani.wdf'}
		特效表[25] = {x=65,y=42,切换=0x766312A3,资源='mapani.wdf'}
		特效表[26] = {x=76,y=51,切换=0x766312A3,资源='mapani.wdf'}
		特效表[27] = {x=93,y=55,切换=0x766312A3,资源='mapani.wdf'}
		特效表[28] = {x=120,y=61,切换=0x766312A3,资源='mapani.wdf'}
		特效表[29] = {x=136,y=58,切换=0x766312A3,资源='mapani.wdf'}
		特效表[30] = {x=81,y=20,切换=0x766312A3,资源='mapani.wdf'}
		特效表[31] = {x=93,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[32] = {x=132,y=12,切换=0x766312A3,资源='mapani.wdf'}
		特效表[33] = {x=121,y=30,切换=0x766312A3,资源='mapani.wdf'}
		特效表[34] = {x=109,y=27,切换=0x766312A3,资源='mapani.wdf'}
		特效表[35] = {x=114,y=35,切换=0x766312A3,资源='mapani.wdf'}
		特效表[36] = {x=83,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[37] = {x=103,y=57,切换=0x766312A3,资源='mapani.wdf'}
		特效表[38] = {x=139,y=63,切换=0x766312A3,资源='mapani.wdf'}
		特效表[39] = {x=14,y=48,切换=0x766312A3,资源='mapani.wdf'}
		特效表[40] = {x=103,y=15,切换=0x766312A3,资源='mapani.wdf'}
		特效表[41] = {x=119,y=16,切换=0x766312A3,资源='mapani.wdf'}
		特效表[42] = {x=53,y=48,切换=0x766312A3,资源='mapani.wdf'}
		特效表[43] = {x=93,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[44] = {x=111,y=5,切换=0x766312A3,资源='mapani.wdf'}
		特效表[45] = {x=94,y=7,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[46] = {x=129,y=24,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[47] = {x=116,y=29,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[48] = {x=107,y=37,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[49] = {x=128,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[50] = {x=124,y=16,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[51] = {x=72,y=23,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[52] = {x=113,y=21,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[53] = {x=122,y=4,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[54] = {x=145,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[55] = {x=118,y=29,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[56] = {x=90,y=17,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[57] = {x=93,y=16,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1508 then--沉船
		特效表[1] = {x=44,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=15,y=34,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=47,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=29,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=10,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=48,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=22,y=21,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=46,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[9] = {x=33,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=56,y=34,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=6,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=42,y=68,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[13] = {x=24,y=64,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[14] = {x=69,y=49,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[15] = {x=61,y=62,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[16] = {x=47,y=47,切换=0x766312A3,资源='mapani.wdf'}
		特效表[17] = {x=56,y=54,切换=0x766312A3,资源='mapani.wdf'}
		特效表[18] = {x=71,y=61,切换=0x766312A3,资源='mapani.wdf'}
		特效表[19] = {x=64,y=43,切换=0x766312A3,资源='mapani.wdf'}
		特效表[20] = {x=9,y=60,切换=0x766312A3,资源='mapani.wdf'}
		特效表[21] = {x=27,y=67,切换=0x766312A3,资源='mapani.wdf'}
		特效表[22] = {x=34,y=22,切换=0x766312A3,资源='mapani.wdf'}
		特效表[23] = {x=29,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[24] = {x=62,y=64,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
	elseif 地图ID == 1509 then--"沉船内室"
		特效表[1] = {x=14,y=22,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=10,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=22,y=21,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[4] = {x=46,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[5] = {x=33,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[6] = {x=56,y=34,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[7] = {x=23,y=30,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[8] = {x=29,y=21,切换=0x766312A3,资源='mapani.wdf'}
		特效表[9] = {x=24,y=29,切换=0x766312A3,资源='mapani.wdf'}
		特效表[10] = {x=12,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1501 then--"建邺城"
		特效表[1] = {x=144,y=115,切换=0x6FE2B740,资源='mapani.wdf'}--建邺城 白色花瓣
		特效表[2] = {x=149,y=110,切换=0xF44FFBD9,资源='mapani.wdf'}--蝴蝶
		特效表[3] = {x=149,y=115,切换=0x764A1E36,资源='mapani.wdf'}--蝴蝶2
		特效表[4] = {x=150,y=126,切换=0xF44FFBD9,资源='mapani.wdf'}
		特效表[5] = {x=79,y=83,切换=0xF44FFBD9,资源='mapani.wdf'}
		特效表[6] = {x=68,y=77,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[7] = {x=68,y=67,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[8] = {x=94,y=28,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[9] = {x=98,y=19,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[10] = {x=2,y=5,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[11] = {x=9,y=46,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[12] = {x=55,y=135,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[13] = {x=55,y=127,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[14] = {x=107,y=140,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[15] = {x=162,y=105,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[16] = {x=287,y=95,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[17] = {x=245,y=55,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[18] = {x=243,y=40,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[19] = {x=179,y=55,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[20] = {x=183,y=47,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[21] = {x=218,y=52,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[22] = {x=186,y=53,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[23] = {x=216,y=2,切换=0xA61255E8,资源='mapani.wdf'}
		特效表[24] = {x=136,y=42,切换=0x6FE2B740,资源='mapani.wdf'}
		特效表[25] = {x=141,y=38,切换=0x764A1E36,资源='mapani.wdf'}
		特效表[26] = {x=190,y=49,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[27] = {x=208,y=65,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[28] = {x=211,y=70,切换=0x082DB080,资源='mapani.wdf'}
		特效表[29] = {x=159,y=137,切换=0x082DB080,资源='mapani.wdf'}
		特效表[30] = {x=155,y=140,切换=0x082DB080,资源='mapani.wdf'}
		特效表[31] = {x=156,y=142,切换=0x082DB080,资源='mapani.wdf'}
		特效表[32] = {x=152,y=144,切换=0x082DB080,资源='mapani.wdf'}
		特效表[33] = {x=150,y=140,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[34] = {x=130,y=127,切换=0x082DB080,资源='mapani.wdf'}
		特效表[35] = {x=132,y=118,切换=0x082DB080,资源='mapani.wdf'}
		特效表[36] = {x=132,y=123,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[36] = {x=158,y=24,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[37] = {x=162,y=27,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[38] = {x=127,y=37,切换=0x082DB080,资源='mapani.wdf'}
		特效表[39] = {x=93,y=63,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[40] = {x=79,y=72,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[41] = {x=76,y=75,切换=0x082DB080,资源='mapani.wdf'}
		特效表[42] = {x=124,y=142,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[43] = {x=259,y=84,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[44] = {x=259,y=87,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[45] = {x=263,y=87,切换=0x7589FB64,资源='mapani.wdf'}
		特效表[46] = {x=265,y=90,切换=0x082DB080,资源='mapani.wdf'}
		特效表[47] = {x=218,y=79,切换=0x082DB080,资源='mapani.wdf'}
	elseif 地图ID == 1001 then--"长安城"
		特效表[1] = {x=322,y=160,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[2] = {x=325,y=165,切换=0x082DB080,资源='mapani.wdf'}
		特效表[3] = {x=319,y=163,切换=0x082DB080,资源='mapani.wdf'}
		特效表[4] = {x=330,y=160,切换=0x082DB080,资源='mapani.wdf'}
		特效表[5] = {x=440,y=98,切换=0x082DB080,资源='mapani.wdf'}
		特效表[6] = {x=438,y=102,切换=0x082DB080,资源='mapani.wdf'}
		特效表[7] = {x=443,y=107,切换=0x082DB080,资源='mapani.wdf'}
		-- 特效表[8] = {x=365,y=25,切换=0x8F677791,资源='mapani.wdf'}
	elseif 地图ID == 1070 then--长寿村
	  特效表[1] = {x=74,y=15,切换=0xF12D26BF,资源='mapani.wdf'}--小小流水2 莲台旁边雾
      特效表[2] = {x=84,y=2,切换=0xF5EEBC5A,资源='mapani.wdf'}--大瀑布
      -- 特效表[3] = {x=90,y=9,切换=0x01E06C02,资源='mapani.wdf'}--大瀑布1
      特效表[3] = {x=90,y=9,切换=0x0CCFBB45,资源='mapani.wdf'}--大瀑布2
      特效表[4] = {x=92,y=29,切换=0x166FC2D8,资源='mapani.wdf'}--水波纹1
      特效表[5] = {x=117,y=23,切换=0x05FE4493,资源='mapani.wdf'}--灯1
      特效表[6] = {x=141.5,y=30,切换=0x05FE4493,资源='mapani.wdf'}--灯1
      特效表[7] = {x=31,y=76,切换=0xBC57BF81,资源='mapani.wdf'}--水波纹3
    elseif 地图ID == 1142 then--女儿村
     	特效表[1] = {x=2,y=44,切换=0xA61255E8,资源='mapani.wdf'}--粉红色桃花瓣
     	特效表[2] = {x=47,y=7,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[3] = {x=90,y=13,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[4] = {x=86,y=56,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[5] = {x=119,y=40,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[6] = {x=102,y=76,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[7] = {x=55,y=61,切换=0x13F1F78B,资源='mapani.wdf'}--玫瑰色花瓣 女儿村大树
     	特效表[8] = {x=48,y=66,切换=0x13F1F78B,资源='mapani.wdf'}
     	特效表[9] = {x=67,y=62,切换=0x13F1F78B,资源='mapani.wdf'}
     	特效表[10] = {x=76,y=59,切换=0x13F1F78B,资源='mapani.wdf'}
     	特效表[11] = {x=59,y=46,切换=0x13F1F78B,资源='mapani.wdf'}
    elseif 地图ID == 1231 then--蟠桃园
     	特效表[1] = {x=92,y=92,切换=0xA61255E8,资源='mapani.wdf'}--粉红色桃花瓣
     	特效表[2] = {x=71,y=93,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[3] = {x=55,y=92,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[4] = {x=42,y=92,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[5] = {x=20,y=92,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[6] = {x=5,y=88,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[7] = {x=8,y=63,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[8] = {x=7,y=48,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[9] = {x=11,y=34,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[10] = {x=14,y=23,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[11] = {x=50,y=31,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[12] = {x=35,y=44,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[13] = {x=38,y=54,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[14] = {x=56,y=68,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[15] = {x=72,y=72,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[16] = {x=104,y=58,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[17] = {x=63,y=14,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[18] = {x=83,y=12,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[19] = {x=94,y=40,切换=0xA61255E8,资源='mapani.wdf'}
     	特效表[20] = {x=62,y=40,切换=0xA61255E8,资源='mapani.wdf'}
    elseif 地图ID == 1513 then--盘丝岭
    	特效表[1] = {x=151,y=16,切换=0xA61255E8,资源='mapani.wdf'}--粉红色桃花瓣
    	特效表[2] = {x=173,y=6,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[3] = {x=195,y=16,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[4] = {x=156,y=35,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[5] = {x=180,y=45,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[6] = {x=151,y=16,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[7] = {x=193,y=34,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[8] = {x=140,y=53,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[9] = {x=142,y=68,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[10] = {x=48,y=58,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[11] = {x=68,y=58,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[12] = {x=88,y=78,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[13] = {x=48,y=95,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[14] = {x=77,y=99,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[15] = {x=109,y=60,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[16] = {x=108,y=40,切换=0xA61255E8,资源='mapani.wdf'}
    	特效表[17] = {x=129,y=10,切换=0xA61255E8,资源='mapani.wdf'}
	elseif 地图ID == 1186 then--"凤巢一层"
		特效表[1] = {x=55,y=81,切换=0x3AA68121,资源='mapani.wdf'}--凤巢红色漂叶1
		特效表[2] = {x=55,y=81,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
	elseif 地图ID == 1187 then--"凤巢二层"
		特效表[1] = {x=10,y=20,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
	elseif 地图ID== 1188 then--"凤巢三层"
		特效表[1] = {x=10,y=20,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
	elseif 地图ID == 1189 then--"凤巢四层"
		特效表[1] = {x=10,y=20,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
	elseif 地图ID == 1190 then--"凤巢五层"
		特效表[1] = {x=10,y=20,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
	elseif 地图ID == 1191 then--"凤巢六层"
		特效表[1] = {x=10,y=20,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
		特效表[2] = {x=16,y=18,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[3] = {x=72,y=47,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[4] = {x=78,y=41,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[5] = {x=56,y=53,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[6] = {x=46,y=51,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[7] = {x=55,y=47,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[8] = {x=47,y=45,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[9] = {x=44,y=3,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[10] = {x=62,y=3,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[11] = {x=57,y=4,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[12] = {x=50,y=3,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[13] = {x=77,y=2,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[14] = {x=100,y=1,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[15] = {x=84,y=2,切换=0x4586E25D,资源='mapani.wdf'}
	elseif 地图ID == 1192 then--"凤巢七层"
		特效表[1] = {x=91,y=6,切换=0x4586E25D,资源='mapani.wdf'}--凤巢红色漂叶2
		特效表[2] = {x=90,y=16,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[3] = {x=93,y=13,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[4] = {x=53,y=44,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[5] = {x=48,y=39,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[6] = {x=110,y=44,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[7] = {x=117,y=54,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[8] = {x=113,y=51,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[9] = {x=99,y=47,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[10] = {x=34,y=36,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[11] = {x=24,y=29,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[12] = {x=16,y=37,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[13] = {x=38,y=22,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[14] = {x=45,y=13,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[15] = {x=38,y=16,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[16] = {x=107,y=52,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[17] = {x=88,y=13,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[18] = {x=44,y=18,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[19] = {x=28,y=36,切换=0x4586E25D,资源='mapani.wdf'}
		特效表[20] = {x=22,y=34,切换=0x4586E25D,资源='mapani.wdf'}
	elseif 地图ID == 1116 then--"龙宫"
		特效表[1] = {x=89,y=58,切换=0x04722395,资源='mapani.wdf'}--海底水球
		特效表[2] = {x=100,y=64,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[3] = {x=77,y=53,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[4] = {x=136,y=84,切换=0x04722395,资源='mapani.wdf'}
		特效表[5] = {x=66,y=45,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=13,y=51,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=36,y=75,切换=0x766312A3,资源='mapani.wdf'}
		特效表[8] = {x=14,y=104,切换=0x766312A3,资源='mapani.wdf'}
		特效表[9] = {x=78,y=98,切换=0x766312A3,资源='mapani.wdf'}
		特效表[10] = {x=108,y=101,切换=0x766312A3,资源='mapani.wdf'}
		特效表[11] = {x=110,y=78,切换=0x766312A3,资源='mapani.wdf'}
		特效表[12] = {x=151,y=94,切换=0x766312A3,资源='mapani.wdf'}
		特效表[13] = {x=198,y=99,切换=0x766312A3,资源='mapani.wdf'}
		特效表[14] = {x=199,y=62,切换=0x766312A3,资源='mapani.wdf'}
		特效表[15] = {x=165,y=43,切换=0x766312A3,资源='mapani.wdf'}
		特效表[16] = {x=191,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[17] = {x=165,y=13,切换=0x766312A3,资源='mapani.wdf'}
		特效表[18] = {x=142,y=18,切换=0x766312A3,资源='mapani.wdf'}
		特效表[19] = {x=104,y=17,切换=0x766312A3,资源='mapani.wdf'}
		特效表[20] = {x=84,y=16,切换=0x766312A3,资源='mapani.wdf'}
		特效表[21] = {x=36,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[22] = {x=62,y=66,切换=0x766312A3,资源='mapani.wdf'}
		特效表[23] = {x=152,y=51,切换=0x766312A3,资源='mapani.wdf'}
		特效表[24] = {x=13,y=90,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[25] = {x=55,y=102,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[26] = {x=174,y=111,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[27] = {x=124,y=94,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[28] = {x=62,y=54,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[29] = {x=12,y=39,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[30] = {x=120,y=9,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[31] = {x=24,y=16,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[32] = {x=33,y=61,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[33] = {x=55,y=28,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[34] = {x=206,y=37,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[35] = {x=175,y=51,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[36] = {x=152,y=81,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[37] = {x=121,y=113,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[38] = {x=179,y=11,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[39] = {x=123,y=20,切换=0x6C5060A2,资源='mapani.wdf'}--水晶灯
		特效表[40] = {x=64.5,y=69,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[41] = {x=79.5,y=76,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[42] = {x=96.5,y=83,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[43] = {x=50.5,y=59,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[44] = {x=90,y=79,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[45] = {x=44,y=55,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[46] = {x=63,y=27,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[47] = {x=77,y=20,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[48] = {x=166,y=19,切换=0x6C5060A2,资源='mapani.wdf'}
		特效表[49] = {x=180,y=26,切换=0x6C5060A2,资源='mapani.wdf'}
        特效表[50] = {x=187,y=47,切换=0xA4AC1192,资源='mapani.wdf'}
        特效表[51] = {x=165.7,y=75.5,切换=0x6C5060A2,资源='mapani.wdf'}
        特效表[52] = {x=180,y=69,切换=0x6C5060A2,资源='mapani.wdf'}
        特效表[53] = {x=59,y=71,切换=0x8119DD8E,资源='mapani.wdf'}--海底叶子
		特效表[54] = {x=81,y=109,切换=0x8119DD8E,资源='mapani.wdf'}
		特效表[55] = {x=104,y=88,切换=0x8119DD8E,资源='mapani.wdf'}
		特效表[56] = {x=132,y=13,切换=0x8119DD8E,资源='mapani.wdf'}
		特效表[57] = {x=87,y=88,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[58] = {x=110,y=70,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[59] = {x=129,y=61,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[60] = {x=170,y=52,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[61] = {x=157,y=23,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[62] = {x=74,y=31,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[63] = {x=34,y=48,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[64] = {x=67,y=81,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[65] = {x=32,y=101,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[66] = {x=168,y=31,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[67] = {x=107,y=60,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[68] = {x=193,y=62,切换=0x6C5060A2,资源='mapani.wdf'}--水晶灯
		特效表[69] = {x=35,y=73,切换=0x6C5060A2,资源='mapani.wdf'}--水晶灯
	elseif 地图ID == 1117 then--"水晶宫"
		特效表[1] = {x=27,y=23,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=27,y=31,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=36,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[4] = {x=11,y=29,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[5] = {x=34,y=16,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[6] = {x=50,y=23,切换=0xA4AC1192,资源='mapani.wdf'}
		特效表[7] = {x=26,y=33,切换=0x766312A3,资源='mapani.wdf'}
		特效表[8] = {x=44,y=33,切换=0x766312A3,资源='mapani.wdf'}
		特效表[9] = {x=35,y=25,切换=0x6C5060A2,资源='mapani.wdf'}--水晶灯
	elseif 地图ID == 1118 then--"海底一层"
		特效表[1] = {x=44,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=15,y=34,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=47,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=29,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=10,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=48,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=22,y=21,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=46,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[9] = {x=33,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=56,y=34,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=6,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1119 then--"海底2层"
		特效表[1] = {x=29,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=18,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=14,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=39,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=53,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=34,y=42,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=26,y=24,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[9] = {x=49,y=35,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=42,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}

	elseif 地图ID == 1120 then--"海底3层"
		特效表[1] = {x=29,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=18,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=14,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=39,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=53,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=60,y=40,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=42,y=30,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[9] = {x=30,y=42,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=43,y=20,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=15,y=23,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=53,y=17,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[13] = {x=7,y=25,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1121 then--"海底4层"
		特效表[1] = {x=29,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=18,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=14,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=39,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=53,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=27,y=30,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=48,y=30,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[9] = {x=53,y=19,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=5,y=24,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=25,y=14,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=30,y=33,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1532 then--"海底5层"
		特效表[1] = {x=29,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=18,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=14,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=39,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=53,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=11,y=19,切换=0x766312A3,资源='mapani.wdf'}
		特效表[8] = {x=49,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[9] = {x=37,y=31,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[10] = {x=7,y=16,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=39,y=14,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=58,y=22,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[13] = {x=18,y=21,切换=0x1FCF4AB9,资源='mapani.wdf'}
	elseif 地图ID == 1040 then--"西凉女国"
		特效表[1] = {x=150,y=117,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=70.2,y=62,切换=0x5F345815,资源='mapani.wdf'}--水波纹
	elseif 地图ID == 1041 then--"子母河底"
		特效表[1] = {x=29,y=35,切换=0x766312A3,资源='mapani.wdf'}--水波纹
		特效表[2] = {x=18,y=38,切换=0x766312A3,资源='mapani.wdf'}
		特效表[3] = {x=33,y=14,切换=0x766312A3,资源='mapani.wdf'}
		特效表[4] = {x=14,y=8,切换=0x766312A3,资源='mapani.wdf'}
		特效表[5] = {x=39,y=39,切换=0x766312A3,资源='mapani.wdf'}
		特效表[6] = {x=53,y=26,切换=0x766312A3,资源='mapani.wdf'}
		特效表[7] = {x=90,y=64,切换=0xA4AC1192,资源='mapani.wdf'}--海底水球2
		特效表[8] = {x=51,y=16,切换=0x1FCF4AB9,资源='mapani.wdf'}--海底水球3
		特效表[9] = {x=28,y=73,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[10] = {x=47,y=81,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[11] = {x=83,y=79,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[12] = {x=123,y=75,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[13] = {x=108,y=70,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[14] = {x=96,y=46,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[15] = {x=72,y=45,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[16] = {x=43,y=63,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[17] = {x=21,y=60,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[18] = {x=111,y=28,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[19] = {x=123,y=36,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[20] = {x=120,y=53,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[21] = {x=108,y=9,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[22] = {x=99,y=13,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[23] = {x=79,y=6,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[24] = {x=33,y=40,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[25] = {x=15,y=49,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[26] = {x=3,y=37,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[27] = {x=8,y=87,切换=0x1FCF4AB9,资源='mapani.wdf'}
		特效表[28] = {x=24,y=83,切换=0x766312A3,资源='mapani.wdf'}
		特效表[29] = {x=55,y=69,切换=0x766312A3,资源='mapani.wdf'}
		特效表[30] = {x=62,y=73,切换=0x766312A3,资源='mapani.wdf'}
		特效表[31] = {x=13,y=64,切换=0x766312A3,资源='mapani.wdf'}
		特效表[32] = {x=11,y=49,切换=0x766312A3,资源='mapani.wdf'}
		特效表[33] = {x=42,y=27,切换=0x766312A3,资源='mapani.wdf'}
		特效表[34] = {x=26,y=20,切换=0x766312A3,资源='mapani.wdf'}
		特效表[35] = {x=16,y=16,切换=0x766312A3,资源='mapani.wdf'}
		特效表[36] = {x=67,y=17,切换=0x766312A3,资源='mapani.wdf'}
		特效表[37] = {x=107,y=12,切换=0x766312A3,资源='mapani.wdf'}
		特效表[38] = {x=98,y=30,切换=0x766312A3,资源='mapani.wdf'}
		特效表[39] = {x=81,y=33,切换=0x766312A3,资源='mapani.wdf'}
		特效表[40] = {x=73,y=50,切换=0x766312A3,资源='mapani.wdf'}
		特效表[41] = {x=61,y=53,切换=0x766312A3,资源='mapani.wdf'}
		特效表[42] = {x=101,y=89,切换=0x766312A3,资源='mapani.wdf'}
		特效表[43] = {x=109,y=80,切换=0x766312A3,资源='mapani.wdf'}
		特效表[44] = {x=103,y=51,切换=0x766312A3,资源='mapani.wdf'}
		特效表[45] = {x=33,y=63,切换=0x3CC8C2C8,资源='mapani.wdf'}--小鱼
		特效表[46] = {x=69,y=65,切换=0x3CC8C2C8,资源='mapani.wdf'}
		特效表[47] = {x=51,y=11,切换=0x3CC8C2C8,资源='mapani.wdf'}
		特效表[48] = {x=109,y=5,切换=0x3CC8C2C8,资源='mapani.wdf'}
		特效表[49] = {x=34,y=34,切换=0x3CC8C2C8,资源='mapani.wdf'}
	elseif 地图ID== 1131 then--"狮驼岭"
		特效表[1] = {x=53,y=47,切换=0x97DC640E,资源='mapani.wdf'}--狮驼岭专用瀑布
		特效表[2] = {x=47,y=70,切换=0xCCDA994D,资源='mapani.wdf'}
		特效表[3] = {x=52,y=75,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[4] = {x=52,y=92,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[5] = {x=72,y=92,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[6] = {x=92,y=92,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[7] = {x=108,y=88,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[8] = {x=51,y=75,切换=0x73C3E7FF,资源='mapani.wdf'}
		特效表[9] = {x=40,y=63,切换=0xF12D26BF,资源='mapani.wdf'}
		特效表[10] = {x=105,y=85,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
	elseif 地图ID== 1091 then--"长寿郊外"
		特效表[1] = {x=64,y=93,切换=0xF0A5E9B6,资源='magic.wdf'}--长寿郊外球
		特效表[2] = {x=112,y=51,切换=0x1C544A18,资源='mapani.wdf'}
	elseif 地图ID== 1111 then--天宫
		特效表[1] = {x=219,y=19,切换=0xF0A5E9B6,资源='magic.wdf'}--天宫外球  BE3E817A
		特效表[2] = {x=136,y=53,切换=0x93C2760B,资源='magic.wdf'}--天宫外球
		特效表[3] = {x=219,y=5,切换=0x876DBCC6,资源='magic.wdf'}--兜率宫火
		特效表[4] = {x=239,y=15,切换=0x876DBCC6,资源='magic.wdf'}--兜率宫火
		特效表[5] = {x=220,y=23,切换=0x876DBCC6,资源='magic.wdf'}--兜率宫火
		特效表[6] = {x=199,y=14,切换=0x876DBCC6,资源='magic.wdf'}--兜率宫火
		特效表[7] = {x=207,y=12,切换=0x2A997658,资源='magic.wdf'}--雷电1
		特效表[8] = {x=234,y=52,切换=0x279AF873,资源='magic.wdf'}--雷电2
		特效表[9] = {x=234,y=55,切换=0x279AF873,资源='magic.wdf'}
		特效表[10] = {x=222,y=55,切换=0x279AF873,资源='magic.wdf'}
		特效表[11] = {x=200,y=43,切换=0x279AF873,资源='magic.wdf'}
		特效表[12] = {x=210,y=40,切换=0x279AF873,资源='magic.wdf'}
		特效表[13] = {x=248,y=70,切换=0xF1F26922,资源='magic.wdf'}--雷电3
		特效表[14] = {x=240,y=70,切换=0x2A997658,资源='magic.wdf'}--雷电1
		特效表[15] = {x=228,y=12,切换=0xE926E4D8,资源='magic.wdf'}--雷电4
		特效表[16] = {x=219,y=19,切换=0x2067A573,资源='magic.wd1'}--雷电5
		特效表[17] = {x=214,y=99,切换=0x1C544A18,资源='mapani.wdf'}--大云0x0DC9BBE1
		特效表[18] = {x=244,y=159,切换=0x1C544A18,资源='mapani.wdf'}
		特效表[19] = {x=240,y=155,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[20] = {x=211,y=155,切换=0x1D61BB5B,资源='mapani.wdf'}--大云3
		特效表[21] = {x=185,y=110,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[22] = {x=197,y=120,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[23] = {x=146,y=130,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[24] = {x=157,y=128,切换=0x7589FB64,资源='mapani.wdf'}--荷花3
		特效表[25] = {x=156,y=133,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[26] = {x=160,y=148,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[27] = {x=170,y=140,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[28] = {x=117,y=137,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[29] = {x=200,y=158,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[30] = {x=121,y=140,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[31] = {x=127,y=145,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[32] = {x=135,y=150,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[33] = {x=81,y=165,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[34] = {x=90,y=168,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[35] = {x=51,y=160,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[36] = {x=65,y=160,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[37] = {x=60,y=114,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[38] = {x=81,y=111,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[39] = {x=89,y=111,切换=0xF5EEBC5A,资源='mapani.wdf'}--小瀑布云
		特效表[40] = {x=79,y=125,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[41] = {x=91,y=111,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[42] = {x=100,y=113,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[43] = {x=98,y=114,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[44] = {x=93,y=113,切换=0x7589FB64,资源='mapani.wdf'}--荷花1
		特效表[45] = {x=91,y=103.5,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[46] = {x=150,y=129,切换=0xF44FFBD9,资源='mapani.wdf'}--蝴蝶
		特效表[47] = {x=181,y=107,切换=0xF44FFBD9,资源='mapani.wdf'}--蝴蝶
		特效表[48] = {x=138,y=134,切换=0xF44FFBD9,资源='mapani.wdf'}--蝴蝶
		特效表[49] = {x=202,y=141,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[50] = {x=84,y=146,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[51] = {x=110,y=135,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[52] = {x=81,y=84,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[53] = {x=139,y=134,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[54] = {x=186,y=146,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[55] = {x=221,y=96,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[56] = {x=252,y=93,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
		特效表[57] = {x=8,y=84,切换=0xCB0DD066,资源='mapani.wdf'}--光圈
	elseif 地图ID== 1112 then--凌霄宝殿
		特效表[1] = {x=63,y=50,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[2] = {x=45,y=35,切换=0xA5C6BDFB,资源='magic.wdf'}--凌霄宝殿外球
		特效表[3] = {x=30,y=55,切换=0xF12D26BF,资源='mapani.wdf'}--云4
		特效表[4] = {x=58,y=72,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[5] = {x=20,y=52,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[6] = {x=20,y=66,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[7] = {x=7,y=30,切换=0xF12D26BF,资源='mapani.wdf'}--云4
		特效表[8] = {x=7,y=30,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[9] = {x=80,y=20,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[10] = {x=90,y=20,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[11] = {x=90,y=35,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[12] = {x=100,y=65,切换=0x1C544A18,资源='mapani.wdf'}--大云2
		特效表[13] = {x=90,y=75,切换=0x1C544A18,资源='mapani.wdf'}--大云2
	elseif 地图ID== 1113 then--兜率宫
		特效表[1] = {x=28.9,y=20,切换=0x876DBCC6,资源='magic.wdf'}--兜率宫火  黑洞 19702861
		特效表[2] = {x=18,y=17,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
	elseif 地图ID== 1114 then--月宫
		特效表[1] = {x=58,y=48,切换=0x93C2760B,资源='magic.wdf'}--月宫
	elseif 地图ID== 1140 then--普陀山
		特效表[1] = {x=49,y=60,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[2] = {x=37,y=25,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[3] = {x=2,y=40,切换=0xF5EEBC5A,资源='mapani.wdf'}--大云5
	elseif 地图ID== 1141 then--潮音洞
		特效表[1] = {x=48,y=28,切换=0xBC57BF81,资源='mapani.wdf'}
		特效表[2] = {x=56,y=28,切换=0xF8FC9410,资源='mapani.wdf'}
		特效表[3] = {x=46,y=13,切换=0x082DB080,资源='mapani.wdf'}--荷花2
		特效表[4] = {x=47,y=15,切换=0x7589FB64,资源='mapani.wdf'}--荷花1
		特效表[5] = {x=49,y=18,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[6] = {x=7,y=22,切换=0xE4F642AD,资源='mapani.wdf'}--绿水波
		特效表[7] = {x=10,y=25,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[8] = {x=10,y=24,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[9] = {x=55,y=15,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[10] = {x=55,y=17,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[11] = {x=53,y=19,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[12] = {x=53,y=21,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[13] = {x=12,y=28,切换=0x082DB080,资源='mapani.wdf'}--荷花
		特效表[14] = {x=7,y=28,切换=0x7589FB64,资源='mapani.wdf'}--荷花2
		特效表[15] = {x=5,y=33,切换=0x97DC640E,资源='mapani.wdf'}--流水
		特效表[16] = {x=22,y=33,切换=0x8C20E9CE,资源='mapani.wdf'}--流水2
		特效表[17] = {x=18,y=43,切换=0x8C20E9CE,资源='mapani.wdf'}--流水2
		特效表[18] = {x=28,y=38,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[19] = {x=5,y=35,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[20] = {x=12,y=12,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
		特效表[21] = {x=43,y=22,切换=0x0DC9BBE1,资源='mapani.wdf'}--大云
	elseif 地图ID== 1122 then--阴曹地府
		特效表[1] = {x=63.8,y=38,切换=0x43ED2D96,资源='mapani.wdf'}--大条炎
		特效表[2] = {x=151.7,y=38,切换=0x561F6DA0,资源='mapani.wdf'}--大条炎2
		特效表[3] = {x=79,y=26.5,切换=0x1D65942D,资源='mapani.wdf'}--大条炎3
		特效表[4] = {x=145.8,y=35,切换=0x302E861A,资源='mapani.wdf'}--大条炎4
		特效表[5] = {x=138.2,y=22.6,切换=0x40CF2774,资源='mapani.wdf'}--大条炎5
		特效表[6] = {x=157.5,y=25,切换=0xDA4CEDEB,资源='mapani.wdf'}--大条炎6
		特效表[7] = {x=79.5,y=41.7,切换=0xFACC4DC1,资源='mapani.wdf'}--大条炎7
		特效表[8] = {x=99,y=30,切换=0x82534401,资源='mapani.wdf'}--大条炎8
		特效表[9] = {x=110,y=36.9,切换=0xD3AA7F77,资源='mapani.wdf'}--大条炎9
		特效表[10] = {x=138.8,y=31.5,切换=0xDDFC2F38,资源='mapani.wdf'}--大条炎10
		特效表[11] = {x=28,y=8,切换=0x7741EE26,资源='mapani.wdf'}--绿色火
		特效表[12] = {x=43.5,y=11.5,切换=0x7741EE26,资源='mapani.wdf'}--绿色火
		特效表[13] = {x=92,y=105,切换=0x7741EE26,资源='mapani.wdf'}--绿色火
		特效表[14] = {x=53,y=83.5,切换=0xDF7819AF,资源='mapani.wdf'}--蓝色火
		特效表[15] = {x=77,y=72,切换=0xDF7819AF,资源='mapani.wdf'}--蓝色火
		特效表[16] = {x=16.5,y=84,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[17] = {x=34,y=95,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[18] = {x=2,y=106.5,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[19] = {x=15.5,y=113,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
	elseif 地图ID== 1123 then--森罗殿
		特效表[1] = {x=30,y=26.5,切换=0x7741EE26,资源='mapani.wdf'}--绿色火
		特效表[2] = {x=9.5,y=30.5,切换=0xDF7819AF,资源='mapani.wdf'}--蓝色火
		特效表[3] = {x=36,y=18.5,切换=0xDF7819AF,资源='mapani.wdf'}--蓝色火
	elseif 地图ID== 1156 then--琉璃殿
		特效表[1] = {x=35.8,y=28,切换=0xBAC76B0F,资源='mapani.wdf'}--黄光柱
		特效表[2] = {x=45,y=35,切换=0xEDBE137D,资源='mapani.wdf'}--小黄火
		特效表[3] = {x=25.5,y=35.5,切换=0xEDBE137D,资源='mapani.wdf'}--小黄火
		特效表[4] = {x=35.5,y=40,切换=0xEDBE137D,资源='mapani.wdf'}--小黄火
	elseif 地图ID== 1125 then--轮回司
		特效表[1] = {x=29,y=22.5,切换=0x00000C7F,资源='mapani.wd2'}--大锅火
	elseif 地图ID== 1082 then--长寿神庙
		特效表[1] = {x=18.2,y=14,切换=0x22D2C840,资源='mapani.wdf'}--大云
	elseif 地图ID== 1205 then--战神山
		特效表[1] = {x=55,y=68,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[2] = {x=74,y=64,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[3] = {x=86,y=52.5,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
		特效表[4] = {x=88.5,y=44,切换=0x3863AF5E,资源='mapani.wdf'}--红色火
    elseif 地图ID== 1420 then
    	   特效表[1] = {x=40,y=26,切换=0xE4003B88,资源='atom.wdf'}
    elseif 地图ID== 1421 then
    	   特效表[1] = {x=53,y=29,切换=0xE5E6505A,资源='atom.wdf'}
    elseif 地图ID== 1422 then
    	   特效表[1] = {x=53,y=29,切换=0xEE86F82B,资源='atom.wdf'}
    elseif 地图ID== 1424 then
    	   特效表[1] = {x=78,y=26,切换=0xF5156917,资源='atom.wdf'}






--===============================================
	end
	return 特效表
end









return 场景类_特效点

