--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2022-08-29 04:43:28
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
local 游戏公告类 = class()

function 游戏公告类:初始化(根)
    self.显示开关=false
    self.丰富文本2=根._丰富文本(240,100)
    for n=0,120 do
        self.丰富文本2:添加元素(n,根.包子表情动画[n])
    end

  self.资源组 = {
    [11] = 根.资源:载入('登陆资源.wdf',"网易WDF动画",0x18361072),
    [12] = 根.资源:载入('登陆资源.wdf',"网易WDF动画",0x18361288),
    [13] = 根.资源:载入('登陆资源.wdf',"网易WDF动画",0x18363065),
  }


end

function 游戏公告类:添加公告(内容)
    self.类型=内容[3]
    self.道具=内容[4]
    if self.显示开关==false then
        self.x=500
        self.显示开关=true
        self.丰富文本2:清空()
        self.丰富文本2:添加文本("#G〖"..内容[1].."〗:#W"..内容[2],self.道具)
    end
end

function 游戏公告类:更新(dt)

end

function 游戏公告类:显示(dt,x,y)
    if self.显示开关 then
        self.x=self.x-1
        if self.x<1 then
           self.显示开关=false
        end
      if self.类型==1 then

          self.资源组[13]:更新(dt)

          self.资源组[11]:显示(5,330)
          self.资源组[12]:显示(5,340)
          self.资源组[13]:显示(5,330)
          self.资源组[13]:显示(5,410)
      elseif self.类型==2 then

          self.资源组[13]:更新(dt)

          self.资源组[11]:显示(5,330)
          self.资源组[12]:显示(5,340)
          self.资源组[13]:显示(5,330)
          self.资源组[13]:显示(5,410)
      elseif self.类型==3 then

          self.资源组[13]:更新(dt)
          self.资源组[11]:显示(5,330)
          self.资源组[12]:显示(5,340)
          self.资源组[13]:显示(5,330)
          self.资源组[13]:显示(5,410)
      elseif self.类型==4 then

          self.资源组[13]:更新(dt)

          self.资源组[11]:显示(5,330)
          self.资源组[12]:显示(5,340)
          self.资源组[13]:显示(5,330)
          self.资源组[13]:显示(5,410)
      end



      self.丰富文本2:显示(15,260+80)
    end
end

return 游戏公告类