--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-03-17 14:14:57
--======================================================================--
local 系统类_鼠标 = class()

local 当前,记忆当前
local 指针
local tp

function 系统类_鼠标:初始化(根)
	local 资源 = 根.资源
	指针 = 资源:载入('gj.wdf',"网易WDF动画",0x81DD40DC)
	tp = 根
end
function 系统类_鼠标:更新(dt,x,y)
	指针:更新(dt)
end
function 系统类_鼠标:置鼠标()

end
function 系统类_鼠标:显示(dt,x,y)
	指针:显示(x,y)
end

return 系统类_鼠标