--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2025-05-15 11:52:45
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
function 取随机法术(数量)--全部
	local 法术={"荆棘舞","水攻","雷击","烈火","落岩","奔雷咒","碎星诀","推气过宫","金刚护体","落叶萧萧","裂石","推拿","夺魄令","地涌金莲","催眠符","失心符","含情脉脉",
	"似玉生香","横扫千军","唧唧歪歪","金刚护法","五雷咒","龙卷雨击","浪涌","龙吟","龙腾","天雷斩","烟雨剑法","五雷轰顶","飞砂走石","三昧真火","狮搏","鹰击",
	"连环击","反间之计"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end



function 取随机物理法术(数量)--物理
	local 法术={"裂石","横扫千军","浪涌","天雷斩","烟雨剑法","满天花雨","后发制人","破釜沉舟","翻江搅海","天崩地裂","善恶有报","剑荡四方","力劈华山"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机法术新(数量)---法系
	local 法术={"水漫金山","地狱烈火","奔雷咒","泰山压顶","超级奔雷咒","超级地狱烈火","超级水漫金山","超级泰山压顶","八凶法阵","叱咤风云","天降灵葫","流沙轻音","食指大动","扶摇万里","龙卷雨击","飞砂走石","落叶萧萧","三昧真火","龙腾","烈火","水攻","落岩","雷击","月光"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end




function 取随机固伤法术(数量)
	local 法术={"天罗地网","阎罗令","夺命咒","判官令","靛沧海","日光华","紧箍咒","地裂火","苍茫树","巨岩破","雨落寒沙","龙吟","地涌金莲"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end


function 取随机加血法术(数量)
	local 法术={"普渡众生","四海升平","晶清诀","推气过宫","地涌金莲","金刚护体","金刚护法","一苇渡江","罗汉金钟","救死扶伤","太极护法"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机封印法术(数量)
	local 法术={"反间之计","催眠符","失心符","落魄符","失忆符","追魂符","离魂符",
                 "失魂符","定身符","莲步轻舞","如花解语","似玉生香","镇妖","错乱","日月乾坤",
                 "含情脉脉","锢魂术","落花成泥"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机兽决法术(数量)
	local 法术={"反震","合纵","夜战","弱点雷","弱点土","吸血","反击","连击",
	             "飞行","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹",
	             "招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术",
	             "魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻",
	             "烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收",
	             "火属性吸收","水属性吸收","迟钝","弱点水",
	             "高级合纵","高级反震","高级进击必杀","高级进击法暴","高级吸血",
	             "高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知",
	             "高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹",
	             "高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭",
	             "高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中",
	             "高级否定信仰","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级法术连击",
	             "高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收",
	             "高级水属性吸收"

	         }
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机兽决被动(数量)
	local 法术={ "高级反震","高级进击必杀","高级进击法暴","高级吸血",
	             "高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知",
	             "高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹",
	             "高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级驱怪",
	             "高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中",
	             "高级否定信仰","高级法术连击","凭风借力","出其不意","风起龙游","虎虎生威","气贯长虹","狂莽一击",
	             "高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收",
	             "高级水属性吸收"

	         }
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end




function 取法术技能(jn)
	local jns = {}
	if jn == "灵性" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3949490866
		jns[8] = 3143201775
	elseif jn == "金刚伏魔" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2566898861
		jns[8] = 3862994147
	elseif jn == "失忆符" then
		jns[1] = "令对手一定回合无法使用特技"
		jns[3] = 4
		jns[4] = "55点魔法"
		jns[5] = "符之术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562829683
		jns[8] = 2704552245
	elseif jn == "龙腾" then
		jns[1] = "施展法术攻击对方单人"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "龙腾术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2093346600
		jns[8] = 3650312562
	elseif jn == "高级慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 242180125
		jns[8] = 4174265955
	elseif jn == "混天术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3643496130
		jns[8] = 481805567
	elseif jn == "龙腾术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3471484278
		jns[8] = 2151837087
	elseif jn == "驱尸" then
		jns[1] = "解除各类中毒状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "周易学技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1226417381
		jns[8] = 546827248
	elseif jn == "水攻" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 85059369
		jns[8] = 2415441344
	elseif jn == "尸腐毒" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*4+自身力量的20%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 49094427
		jns[8] = 2328293467
	elseif jn == "闭月羞花" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3321056507
		jns[8] = 4213596062
	elseif jn == "无敌牛虱" then
		jns[1] = "召唤牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "40点魔法"
		jns[5] = "牛虱阵技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3889342201
		jns[8] = 901977927
	elseif jn == "百毒不侵" then
		jns[1] = "解毒并在一定回合内避免中毒"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "玉质冰肌技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 45388430
		jns[8] = 938983833
	elseif jn == "养生之道" then
		jns[1] = "修身养性固本清元之术\n学习可以增加活力上限"
		jns[3] = 80
		jns[6] = "物品图标.wdf"
		jns[7] = 968832765
		jns[8] = 1635371623
	elseif jn == "乘风破浪" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "游龙术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 90073709
		jns[8] = 3228417140
	elseif jn == "烟雨剑法" then
		jns[1] = "使用后可以连续攻击对手两次"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "潇湘仙雨技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3124546025
		jns[8] = 3643055813
	elseif jn == "定心术" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*3"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "阴阳二气诀技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3988224797
		jns[8] = 99592343
	elseif jn == "百万神兵" then
		jns[1] = "令对方无法使用物理攻击"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "混天术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3140668291
		jns[8] = 4284468319
	elseif jn == "神兵护法" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "神道无念技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1217133207
		jns[8] = 3100160960
	elseif jn == "巨岩破" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到12级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3218559640
		jns[8] = 3817801025
	elseif jn == "乾坤塔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 646614501
		jns[8] = 3014813769
	elseif jn == "轻如鸿毛" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "香飘兰麝技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 33492847
		jns[8] = 367093981
	elseif jn == "灵通术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 695584869
		jns[8] = 577240546
	elseif jn == "魔王回首" then
		jns[1] = "使用后可以在受到物理攻击的时候自动反击"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "回身击技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 995890213
		jns[8] = 3043919056
	elseif jn == "飘渺式" then
		jns[1] = "物理攻击对方多个目标"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "潇湘仙雨技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3268745174
		jns[8] = 3398385178
	elseif jn == "达摩护体" then
		jns[1] = "战斗中临时提高自己或队友的气血上限\n#Y血气数值=目标等级*3.5+目标灵力的20%"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415107827
		jns[8] = 3131800459
	-- elseif jn == "高级法术抵抗" then
	-- 	jns[1] = "减少10%所受的法术伤害，但同时物理伤害能力减少10%。"
	-- 	jns[3] = 7
	-- 	jns[6] = "物品图标.wdf"
	-- 	jns[7] = 3908900845
	-- 	jns[8] = 3908900845
	elseif jn == "高级反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1907422702
		jns[8] = 511662384
	elseif jn == "灵动九天" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*4"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "人物飞升且“金刚经”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2299324564
		jns[8] = 1921901005
	elseif jn == "迷情大法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2410267095
		jns[8] = 3102396352
	elseif jn == "紧箍咒" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续伤害\n#Y伤害数值=技能等级*4+自身灵力的20%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "观音咒技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1573115441
		jns[8] = 956876360
	elseif jn == "苍茫树" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到13级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1228860567
		jns[8] = 2355974251
	elseif jn == "周易学" then
		jns[1] = "按技能等级提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 951717916
		jns[8] = 3182787390
	elseif jn == "五行学说" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3646722626
		jns[8] = 733606302
	elseif jn == "诵经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1921499236
		jns[8] = 3515981629
	elseif jn == "离魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降速度\n#Y降低速度数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 30806
		jns[8] = 3355342391
	elseif jn == "五雷轰顶" then
		jns[1] = "对目标造成法术伤害\n#P技能使用成功:\n#Y造成目标当前血量的25%伤害\n#P技能使用失败:\n#Y造成目标当前血量的5%伤害\n#S数值不会超过(技能等级*50)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4236045895
		jns[8] = 1825724039
	elseif jn == "六道轮回" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2191025103
		jns[8] = 1761343362
	elseif jn == "九幽阴魂" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2427286393
		jns[8] = 2803361004
	elseif jn == "佛门普渡" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "渡世步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2996697873
		jns[8] = 3423122163
	elseif jn == "傲世诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3001127144
		jns[8] = 1049195070
	elseif jn == "天神护体" then
		jns[1] = "战斗中增加队友和自己的法伤\n#Y法伤数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2173852985
		jns[8] = 4200916921
	elseif jn == "镇妖" then
		jns[1] = "使用它后可以降低怪物的伤害\n#Y伤害数值=技能等级*3"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "乾坤塔技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2821624851
		jns[8] = 251203682
	elseif jn == "生死搏" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3136073986
		jns[8] = 1362791032
	elseif jn == "天罗地网" then
		jns[1] = "固定伤害攻击多目标\n有几率使目标:\n无法使用普通攻击和降低目标速度\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身敏捷的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "30点魔法*人数"
		jns[5] = "移形换影技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1653509465
		jns[8] = 1457394081
	elseif jn == "天神护法" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "天罡气技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 4053425914
		jns[8] = 3750198819
	elseif jn == "乾天罡气" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y(魔法=技能等级*2+自身灵力的10%)*0.5"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%的气血"
		jns[6] = "物品图标.wdf"
		jns[7] = 3309202999
		jns[8] = 2018341630
	elseif jn == "高级防御" then
		jns[1] = "增加(自身等级×0.8)的防御，但法术伤害能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1616189465
		jns[8] = 3783015310
	elseif jn == "否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3345212313
		jns[8] = 3002471686
	elseif jn == "盘丝阵" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*5"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2395356970
		jns[8] = 1769215086
	elseif jn == "无敌牛妖" then
		jns[1] = "召唤使用法术的牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "150点魔法"
		jns[5] = "牛虱阵技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 526953932
		jns[8] = 2771934779
	elseif jn == "法术暴击" then
		jns[1] = "使用法术攻击目标时会有一定几率使法术伤害值加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1389982585
		jns[8] = 1108386617
	elseif jn == "尸气漫天" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "拘魂诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3830562709
		jns[8] = 3540479557
	elseif jn == "雷霆万钧" then
		jns[1] = "攻击性法术，使用后攻击对方多个目标"
		jns[3] = 4
		jns[4] = "35点魔法×作用人数"
		jns[5] = "人物飞升且“天罡气”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1167105764
		jns[8] = 2063612274
	elseif jn == "佛法无边" then
		jns[1] = "使目标施展某些攻击性法术时一定几率出现连续两次攻击（不包括需停回合的法术及群体攻击性法术，如横扫千军、鹰击、后发制人、连环击）"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“金刚伏魔”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2286663605
		jns[8] = 3100187427
	elseif jn == "移形换影" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "清歌妙舞技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "情天恨海" then
		jns[1] = "克制五庄观弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "沉鱼落雁技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1898550998
		jns[8] = 2472450541
	elseif jn == "自在心法" then
		jns[1] = "清除己方队员身上普渡众生效果，同时将该回合剩余回合可增加的当前气血与气血上限结算进行回复。"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "灵性技能达到60级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1199130784
		jns[8] = 3420028880
	elseif jn == "高级偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震，物理攻击效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4012815828
		jns[8] = 1555617599
	elseif jn == "阴阳二气诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 683331190
		jns[8] = 4236173132
	elseif jn == "佛光普照" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341
		jns[8] = 921854792
	elseif jn == "飞砂走石" then
		jns[1] = "使用后可以攻击对方多个对象\n#Y技能附带5%法暴几率"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "火云术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 706133968
		jns[8] = 746568918
	elseif jn == "呼风唤雨" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 438165716
		jns[8] = 1919875705
	elseif jn == "修罗隐身" then
		jns[1] = "战斗中隐藏自己或队友的身形\n令对手无法攻击\n隐身状态下不能施展法术\n#Y该技能夜晚不能使用"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 557290721
		jns[8] = 3076118166
	elseif jn == "天地同寿" then
		jns[1] = "为友方和自己加上一个状态\n吸收全部法术伤害\n但目标降低50%防御\n且所受物理伤害会加倍"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4224047219
		jns[8] = 3294906395
	elseif jn == "倾国倾城" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 594113044
		jns[8] = 3862994147
	elseif jn == "莲华妙法" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "金刚经技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4050867699
		jns[8] = 2277699794
	elseif jn == "游龙术" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1730135660
		jns[8] = 316450658
	elseif jn == "潇湘仙雨" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3541032788
		jns[8] = 2723035390
	elseif jn == "日月乾坤" then
		jns[1] = "令对手一定回合内无法行动\n法术,特技,物攻都无法使用"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "乾坤袖技能达到20级，不能用在某些特殊任务的战斗中使用成功"
		jns[6] = "物品图标.wdf"
		jns[7] = 3902929414
		jns[8] = 3489253938
	elseif jn == "高级冥思" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1718714912
		jns[8] = 2174943999
	elseif jn == "追魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1021060099
		jns[8] = 2404071232
	elseif jn == "唧唧歪歪" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人\n#Y该技能额外有自身50%的灵力加成"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "诵经技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1856916618
		jns[8] = 2374732908
	elseif jn == "歧黄之术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2055755507
		jns[8] = 93243227
	elseif jn == "金刚护体" then
		jns[1] = "战斗中临时提高自己或队友的防御力\n#Y防御数值=技能等级*3.5"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1377178114
		jns[8] = 3453377621
	elseif jn == "训兽诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1184160039
		jns[8] = 3128610907
	elseif jn == "龙吟" then
		jns[1] = "减少对方全体队员一定的气血和魔法值\n#Y伤害数值=技能等级*2"
		jns[3] = 4
		jns[4] = "300点魔法"
		jns[5] = "龙附技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1318499395
		jns[8] = 2137943042
	elseif jn == "裂石步" then
		jns[1] = "按技能等级提高躲避"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4286232830
		jns[8] = 3339537828
	elseif jn == "杨柳甘露" then
		jns[1] = "使用后可以复活已经死亡的队友\n可以复活处在\n“锢魂术”或者“死亡召唤”状态下\n剩余回合小于等于2的队友\n#Y复活血量=技能等级*3+自身灵力的10%"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "观音咒技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3757213330
		jns[8] = 794491517
	elseif jn == "香飘兰麝" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3531606030
		jns[8] = 1383632532
	elseif jn == "判官令" then
		jns[1] = "固定伤害攻击单目标\n#Y固伤伤害数值加成:\n#Y技能等级*5+自身力量的10%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)\n#Y天黑状态提高伤害+技能等级*1.5"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "拘魂诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1671969153
		jns[8] = 3702239149
	elseif jn == "救死扶伤" then
		jns[1] = "重复技能无效果,请用推气过宫"
		jns[3] = 5
		jns[4] = "无介绍"
		jns[5] = "歧黄之术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265
	elseif jn == "舍身取义" then
		jns[1] = "将目标当前气血恢复到满"
		jns[3] = 5
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“歧黄之术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265
	elseif jn == "龙附术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3715378746
		jns[8] = 3758617445
	elseif jn == "神龙摆尾" then
		jns[1] = "持续一定回合的防御性法术，拥有该效果时施法者防御和法防提高30%"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[5] = "人物飞升且“破浪诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562612473
		jns[8] = 2539345287
	elseif jn == "健身术" then
		jns[1] = "由华佗所创的五禽戏发展而来\n学习可以增加体力上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3589295296
		jns[8] = 3157390677
	elseif jn == "变身" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*5"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4282403049
		jns[8] = 3667711762
    elseif jn == "狂怒" then
		jns[1] = "临时提高伤害力\n#Y提升伤害数值=技能等级*2"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6E34D2AA
		jns[8] = 0x6E34D2AA
    elseif jn == "爪印特效" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*2"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4282403049
		jns[8] = 3667711762
	elseif jn == "披坚执锐" then
		jns[1] = "法术追加套装的触发\n几率提高100%，持续1回合"
		jns[3] = 66
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x72ED61A1
		jns[8] = 0x72ED61A1
	elseif jn == "莲花宝座" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 37911440
		jns[8] = 2202511971
	elseif jn == "天雷斩" then
		jns[1] = "使用后可以给予多个敌人重击"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "傲世诀技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 315619009
		jns[8] = 958381035
	elseif jn == "驱魔" then
		jns[1] = "解除并避免方寸山封类法术的影响"
		jns[3] = 6
		jns[4] = "45点魔法"
		jns[5] = "周易学技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1284415330
		jns[8] = 656352481
	elseif jn == "掌心雷" then
		jns[1] = "使用它后可以使对手不能使用主动法宝。效果可与其他封系效果叠加。成功几率等同封印成功率，受法术攻击修炼影响"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 763772202
		jns[8] = 1576485465
	elseif jn == "五行错位" then
		jns[1] = "克制女儿村弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "五行扭转技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 322760356
		jns[8] = 3739244200
	elseif jn == "失心符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1506622772
		jns[8] = 3407760722
	elseif jn == "斩龙诀" then
		jns[1] = "克制龙宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "紫薇之术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 40028053
		jns[8] = 1152390271
	elseif jn == "强力" then
		jns[1] = "增加(自身等级×0.4)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1458903425
		jns[8] = 707555275
	elseif jn == "如花解语" then
		jns[1] = "令对手一定回合无法使用普通攻击"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "闭月羞花技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1912374008
		jns[8] = 1283470548
	elseif jn == "拈花妙指" then
		jns[1] = "打造后为鞋子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "佛光普照技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 177955034
		jns[8] = 2841407500
	elseif jn == "复苏" then
		jns[1] = "解除并避免天宫封类法术的影响"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 141266175
		jns[8] = 2870523056
	elseif jn == "凝神术" then
		jns[1] = "10回合内增加15%自身的封系命中几率"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "归元心法技能达到100级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3869803971
		jns[8] = 3077203266
	elseif jn == "含情脉脉" then
		jns[1] = "令对手一定回合内概率\n无法使用物理和法术攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4111305818
		jns[8] = 2589491420
	elseif jn == "龙卷雨击" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "25点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "冥思" then
		jns[1] = "战斗中每回合自动恢复(自身等级四分之一)的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 622128415
		jns[8] = 3554832714
	elseif jn == "催眠符" then
		jns[1] = "令对手在受到伤害前无法行动"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "符之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3523869082
		jns[8] = 104771547
	elseif jn == "高级雷属性吸收" then
		jns[1] = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1654409054
		jns[8] = 119787649
	elseif jn == "雷属性吸收" then
		jns[1] = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA71D860C
		jns[8] = 0xA71D860C
	elseif jn == "分身术" then
		jns[1] = "在一场回合内里\n闪避每回合受到的首次攻击\n持续3回合"
		jns[3] = 66
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“神道无念”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "姊妹相随" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3177731283
		jns[8] = 597142503
	elseif jn == "云霄步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 276418186
		jns[8] = 3893284871
	elseif jn == "奔雷咒" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2858620755
		jns[8] = 3666293224
	elseif jn == "玉质冰肌" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3438751351
		jns[8] = 2264853140
	elseif jn == "高级法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动(50%-140%)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2322584044
		jns[8] = 3668919080
	elseif jn == "地裂火" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到14级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4132171079
		jns[8] = 75104423
	elseif jn == "狂兽诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1661790658
		jns[8] = 2338433754
	elseif jn == "我佛慈悲" then
		jns[1] = "可以复活死亡的队友\n#Y复活血量=技能等级*3+自身灵力的10%"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "大慈大悲技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1545297145
		jns[8] = 266298194
	elseif jn == "破釜沉舟" then
		jns[1] = "同时攻击对方四个目标"
		jns[3] = 4
		jns[4] = "消耗上限气血的10%"
		jns[5] = "人物飞升且“十方无敌”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1580308746
		jns[8] = 619017033
	elseif jn == "金刚护法" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害数值=技能等级*3"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 479962043
		jns[8] = 3700736796
	elseif jn == "莲步轻舞" then
		jns[1] = "令对手一定回合无法使用法术攻击"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3508375370
		jns[8] = 4243867972
	elseif jn == "三星灭魔" then
		jns[1] = "克制魔王寨弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "黄庭经技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1209970630
		jns[8] = 84450076
	elseif jn == "十方无敌" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1137925403
		jns[8] = 4107877611
	elseif jn == "解毒" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "歧黄之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1966642136
		jns[8] = 546423120
	elseif jn == "摄魄" then
		jns[1] = "减少对方一定的魔法\n从而恢复自身魔法\n#Y数值=技能等级*2+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941
		jns[8] = 103370656
	elseif jn == "修仙术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3726980014
		jns[8] = 1673560698
	elseif jn == "幽冥鬼眼" then
		jns[1] = "使用后可以看到隐身的目标\n#Y并增加抵抗封印等级100点"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "九幽阴魂技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1975607386
		jns[8] = 2807639015
	elseif jn == "高级再生" then
		jns[1] = "战斗中每回合自动恢复气血，恢复数值与自身等级相同"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 468221024
		jns[8] = 3809634425
	elseif jn == "振翅千里" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "大鹏展翅技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3512079122
		jns[8] = 4160807473
	elseif jn == "逆鳞" then
		jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "逆鳞技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1493556934
		jns[8] = 3804853170
    elseif jn == "龙骇龙腾" then
		jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "逆鳞技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1493556934
		jns[8] = 3804853170
	elseif jn == "浩然正气" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3449922467
		jns[8] = 567769462
	elseif jn == "天诛地灭" then
		jns[1] = "克制地府弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "天罡气技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB3C8279C
		jns[8] = 3701201548
	elseif jn == "火云术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4166858964
		jns[8] = 909252202
	elseif jn == "永恒" then
		jns[1] = "受到治疗效果提高30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1988160424
		jns[8] = 1508625069
	elseif jn == "雨落寒沙" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*2+自身伤害的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "作用人数*20点魔法"
		jns[5] = "沉鱼落雁技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2465624576
		jns[8] = 562574867
	elseif jn == "高级吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的30%，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1364867245
		jns[8] = 2545117654
	elseif jn == "碎甲符" then
		jns[1] = "降低3个目标的防御和灵力\n#Y数值=自身等级*4"
		jns[3] = 4
		jns[4] = "50点魔法*目标数"
		jns[5] = "人物飞升且“符之术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 417555669
		jns[8] = 3175526110
	elseif jn == "安神诀" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y伤害加成=技能等级*5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "技能达到109级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3150617611
		jns[8] = 2204689180
	elseif jn == "无双一击" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2203124248
		jns[8] = 2998720398
	elseif jn == "淬灵之术" then
		jns[1] = "该技能无效,无需学习"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 1296624794
		jns[8] = 1296624794
	elseif jn == "兵器谱" then
		jns[1] = "能够鉴定武器和铠甲，学习后也可在长安书店制作相应等级的“神兵图鉴”"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "神兵鉴赏技能等级达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1814276494
		jns[8] = 4262913816
	elseif jn == "清明自在" then
		jns[1] = "按技能等级提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3231066014
		jns[8] = 3842629365
	elseif jn == "水漫金山" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2637597442
		jns[8] = 3867686033
	elseif jn == "追捕技巧" then
		jns[1] = "可以降低对手逃跑的成功率\n但最低不小于10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 123566127
		jns[8] = 902425300
	elseif jn == "逃离技巧" then
		jns[1] = "学习后可以提高战斗逃跑的成功率\n但最高不超过90%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1198324882
		jns[8] = 1820394508
	elseif jn == "烹饪技巧" then
		jns[1] = "传自商代名厨伊尹的技能\n可以提高制作食物的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2019196942
		jns[8] = 3782401606
	elseif jn == "中药医理" then
		jns[1] = "精通歧黄之术往往\n可以提高炼制丹药的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3878607199
		jns[8] = 642378453
	elseif jn == "沉鱼落雁" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 370722733
		jns[8] = 1052773261
	elseif jn == "紫薇之术" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3941011754
		jns[8] = 1942519774
	elseif jn == "炼金术" then
		jns[1] = "秘术士私传的炼金之术\n可以提高制作饰品、靴子和腰带的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768

	elseif jn == "攻击修炼" then
		jns[1] = "可以提升角色攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "防御修炼" then
		jns[1] = "可以提升角色防御效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法术修炼" then
		jns[1] = "可以提升角色法术攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法抗修炼" then
		jns[1] = "可以提升角色法术防御效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "满天花雨" then
		jns[1] = "对目标造成单体物理攻击\n使用后增加自己的10%攻击力\n并有30%几率使对手#Y中毒\n(#Z该中毒没特效但有效果#)\n#Y攻击力加成可以叠加三层\n#Y可获得最高20%攻击力加成\n#Y持续到战斗结束"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "沉鱼落雁技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2270504354
		jns[8] = 1714354841
	elseif jn == "符之术" then
		jns[1] = "无效果"
		jns[3] = 1
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341
		jns[8] = 921854792
	elseif jn == "舍身取义" then
		jns[1] = "将目标当前气血恢复到满"
		jns[3] = 3
		jns[4] = "150点魔法，且每次使用时会降低自身5%物理防御及3%灵力"
		jns[5] = "人物飞升且“歧黄之术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1135928864
		jns[8] = 1707332905
	elseif jn == "剑荡四方" then
		jns[1] = "使用时可攻击多人。指定的目标受到一定伤害，并造成其他任意两个目标少量伤害。"
		jns[3] = 4
		jns[4] = "当前气血的百分之十"
		jns[6] = "物品图标.wdf"
		jns[7] = 1668746823
		jns[8] = 1668746823
	elseif jn == "金刚镯" then
		jns[1] = "大幅提升自己的伤害力\n#Y数值=伤害+自身等级*5"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“混天术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4185507078
		jns[8] = 1737815847
	elseif jn == "裁缝技巧" then
		jns[1] = "从天衣无缝针法演化而来\n可提高缝制头盔和铠甲的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1071853506
		jns[8] = 1758794729
	elseif jn == "落岩" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4226735508
		jns[8] = 300977089
	elseif jn == "生命之泉" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y气血数值=技能等级*0.5+自身灵力的10%"
		jns[3] = 3
		jns[4] = "作用人数*30点魔法"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1093047199
		jns[8] = 2757069702
	elseif jn == "韦陀护法" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y法伤数值=技能等级*3"
		jns[3] = 3
		jns[4] = "35点魔法"
		jns[5] = "佛光普照技能等级达到20级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2121060262
		jns[8] = 2888289425
	elseif jn == "暗器技巧" then
		jns[1] = "暗器名家的家传秘笈\n学习后可以增加使用暗器的伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2101102727
		jns[8] = 1473796032
	elseif jn == "冥想" then
		jns[1] = "通过冥想凝聚强大的精神力量\n学习可以提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 97139368
		jns[8] = 903007607
	elseif jn == "弱点土" then
		jns[1] = "弱点为土，受到土属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2234852568
		jns[8] = 910396241
	elseif jn == "冤魂不散" then
		jns[1] = "克制大唐官府弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "九幽阴魂技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3587078621
		jns[8] = 376661686

	 elseif jn == "人物伤害" then
    jns[1] = "每级提升人物4点伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000006
    jns[8] = 0x00000006
  elseif jn == "人物防御" then
    jns[1] = "每级提升人物4点防御"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000003
    jns[8] = 0x00000003
  elseif jn == "人物气血" then
    jns[1] = "每级提升人物30点气血"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000009
    jns[8] = 0x00000009
  elseif jn == "人物法术" then
    jns[1] = "每级提升人物4点法伤法防"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000008
    jns[8] = 0x00000008
  elseif jn == "人物固伤" then
    jns[1] = "每级提升人物4点固定伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000007
    jns[8] = 0x00000007
  elseif jn == "人物速度" then
    jns[1] = "每级提升人物4点速度"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000011
    jns[8] = 0x00000011
  elseif jn == "人物治疗" then
    jns[1] = "每级提升人物4点治疗能力"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000005
    jns[8] = 0x00000005

  elseif jn == "宠物伤害" then
    jns[1] = "每级提升召唤兽4点伤害"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000004
    jns[8] = 0x00000004
  elseif jn == "宠物防御" then
    jns[1] = "每级提升召唤兽4点防御"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000001
    jns[8] = 0x00000001
  elseif jn == "宠物气血" then
    jns[1] = "每级提升召唤兽30点气血"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000002
    jns[8] = 0x00000002
  elseif jn == "宠物灵力" then
    jns[1] = "每级提升召唤兽4点灵力"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000005
    jns[8] = 0x00000005
  elseif jn == "宠物速度" then
    jns[1] = "每级提升召唤兽2点速度"
    jns[3] = 8
    jns[6] = "强化技能.wdf"
    jns[7] = 0x00000011
    jns[8] = 0x00000011
	elseif jn == "强身术" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533
		jns[8] = 732966867
	elseif jn == "强壮" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高40点人物基础气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2458245611
		jns[8] = 1870892091
	elseif jn == "神速" then
		jns[1] = "神速习武之人的根本，学习后可以提高1.5点人物基础速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 440987942
		jns[8] = 3473412458
	elseif jn == "敏捷" then
		jns[1] = "提高自身速度的10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3132756451
		jns[8] = 4289478506
	elseif jn == "盘丝舞" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "蛛丝阵法技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2082714040
		jns[8] = 382164728
	elseif jn == "火属性吸收" then
		jns[1] = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4098020456
		jns[8] = 4092454521
	elseif jn == "落魄符" then
		jns[1] = "令对手一定回合内无法使用法术攻击\n并出现攻击偏差"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "符之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1553239295
		jns[8] = 2036240644
	elseif jn == "泰山压顶" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 463605150
		jns[8] = 463605150
	elseif jn == "观音咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1410587972
		jns[8] = 1911562650
	elseif jn == "牛虱阵" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1129585606
		jns[8] = 2492840335
	elseif jn == "杀气诀" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害加成=技能等级*5"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "为官之道技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1673396685
		jns[8] = 1326507976
	elseif jn == "高级毒" then
		jns[1] = "自身对毒免疫，物理攻击时有20%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 589320553
		jns[8] = 1086230366
	elseif jn == "高级反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击的伤害与正常攻击相同"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3922527672
		jns[8] = 3922527672
	elseif jn == "解封" then
		jns[1] = "单次解除女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "60点魔法"
		jns[5] = "九龙诀技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2555181368
		jns[8] = 1807191850
	elseif jn == "高级神迹" then
		jns[1] = "不受除日月乾坤外的所有异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 705701591
		jns[8] = 4235295997
	elseif jn == "火甲术" then
		jns[1] = "此状态维持期间遭受普通物理攻击、法术时将自动使用三味真火进行反击。"
		jns[3] = 66
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“火云术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2418820008
		jns[8] = 3223806685
	elseif jn == "地狱烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4223394612
		jns[8] = 3042874244
	elseif jn == "高级飞行" then
		jns[1] = "伤害和灵力提高5%,但防御力降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4277341965
		jns[8] = 3853120636
	elseif jn == "龙啸九天" then
		jns[1] = "克制盘丝洞弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "龙附技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3644673853
		jns[8] = 2124753589
	elseif jn == "高级强力" then
		jns[1] = "增加(自身等级×0.715)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3563500497
		jns[8] = 2177485118
	elseif jn == "乙木仙遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "斜月步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 71432172
		jns[8] = 436091648
	elseif jn == "魔兽啸天" then
		jns[1] = "克制天宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "魔兽神功技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 950759216
		jns[8] = 1124928283
	elseif jn == "夺命蛛丝" then
		jns[1] = "克制方寸山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "蛛丝阵法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 227632678
		jns[8] = 3268216546
	elseif jn == "腾云驾雾" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "云霄步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1924869232
		jns[8] = 906709372
	elseif jn == "弱点水" then
		jns[1] = "弱点为水，受到水属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 803997825
		jns[8] = 1114088245
	elseif jn == "慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的75%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1457451798
		jns[8] = 3365576412
	elseif jn == "摇头摆尾" then
		jns[1] = "攻击目标时有70%几率触发飞砂走石\n30%几率触发多目标三昧真火\n(最多5个目标)\n触发飞沙走石时有20%几率给对方\n留下灼烧效果\n每回合减少固定血量!"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“牛虱阵”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3051115375
		jns[8] = 1777991632
	elseif jn == "高级鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2436724533
		jns[8] = 3547941491
	elseif jn == "高级驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法术伤害效果加倍，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 72429538
		jns[8] = 72429538
	elseif jn == "幻镜术" then
		jns[1] = "自身有40%的概率反弹法术攻击"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“移形换影”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1134668132
		jns[8] = 605963427
	elseif jn == "高级幸运" then
		jns[1] = "被法术和物理暴击几率降低50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1781077356
		jns[8] = 481753720
	elseif jn == "高级法术暴击" then
		jns[1] = "使用法术攻击目标时会有较大几率使法术伤害值加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2071863113
		jns[8] = 1628140681
	elseif jn == "瘴气" then
		jns[1] = "降低3个目标50%的被治疗效果\n持续4回合"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "人物飞升且“迷情大法”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3039047760
		jns[8] = 3862934535
	elseif jn == "高级魔之心" then
		jns[1] = "对敌人的法术伤害效果提高20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2586072698
		jns[8] = 2875710379
	elseif jn == "迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788
		jns[8] = 274661895
    elseif jn == "高级迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788
		jns[8] = 274661895
	elseif jn == "七星遁" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 923985229
		jns[8] = 2400021580
	elseif jn == "高级敏捷" then
		jns[1] = "提升自身速度的20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1248152147
		jns[8] = 2061355872
	elseif jn == "楚楚可怜" then
		jns[1] = "停止行动并保护自己免受伤害"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3842255938
		jns[8] = 952615752
	elseif jn == "精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，但自己的物理攻击效果也会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4141937856
		jns[8] = 2799682055
	elseif jn == "清心" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "九龙诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 22613468
		jns[8] = 3563353856
	elseif jn == "防御" then
		jns[1] = "增加(自身等级×0.6)的防御，但法术伤害能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 91393867
		jns[8] = 4101692183
	elseif jn == "感知" then
		jns[1] = "可以破解地府的修罗隐身、女儿村的楚楚可怜法术效果"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3677043818
		jns[8] = 4012137980
	elseif jn == "高级龙魂" then
		jns[1] = "每成功使用三次法术都可以临时增加自身法术伤害,持续2回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00FFEF02
		jns[8] = 0x00FFEF01
	elseif jn == "魔兽反噬" then
		jns[1] = "按技能等级提高防御"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 512391647
		jns[8] = 1359532967
	elseif jn == "招架" then
		jns[1] = "受到物理伤害抵消10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2387844026
		jns[8] = 3512730332
	elseif jn == "弱点雷" then
		jns[1] = "弱点为雷，受到雷属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2886112942
		jns[8] = 2605672758
	elseif jn == "弱点火" then
		jns[1] = "弱点为火，受到火属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1546100078
		jns[8] = 4005696838
	elseif jn == "逆鳞术" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3104091414
		jns[8] = 3406230011
	elseif jn == "靛沧海" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到11级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2679663466
		jns[8] = 1783445565
	elseif jn == "苍鸾怒击" then
		jns[1] = "普通物理攻击发生必杀或连击时，临时提升10%伤害力随机攻击另一个目标，每回合最多触发一次。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3329378845
		jns[8] = 3329378845
  		elseif jn == "夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD5CEE60
		jns[8] = 0xEB2AF42F
   	elseif jn == "高级夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3E81ECFB
		jns[8] = 0x3E81ECFB

	elseif jn == "驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD5CEE60
		jns[8] = 0xEB2AF42F
	elseif jn == "高级驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3E81ECFB
		jns[8] = 0x3E81ECFB




	elseif jn == "天蚕丝" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "移形换影技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1283246148
		jns[8] = 1806917376
	elseif jn == "乾坤袖" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2256743052
		jns[8] = 3443276818
	elseif jn == "烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2966154175
		jns[8] = 1668132272
	elseif jn == "踏山裂石" then
		jns[1] = "克制化生寺弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "震天诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4060498152
		jns[8] = 2813097952
	elseif jn == "破浪诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4132491653
		jns[8] = 3313121721
	elseif jn == "高级土属性吸收" then
		jns[1] = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2639364118
		jns[8] = 751839372
	elseif jn == "二龙戏珠" then
		jns[1] = "施展法术攻击对方两个目标"
		jns[3] = 4
		jns[4] = "70点魔法"
		jns[5] = "人物飞升且“九龙诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1266218218
		jns[8] = 630766288
	elseif jn == "太极生化" then
		jns[1] = "克制狮驼岭弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "修仙术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1665649019
		jns[8] = 1661704448
	elseif jn == "五雷咒" then
		jns[1] = "施展法术攻击对方单人\n#Y对鬼魂术、高级鬼魂术敌人伤害增加30%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "霹雳咒技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3103307429
		jns[8] = 1116134864
	elseif jn == "高级感知" then
		jns[1] = "破解地府的修罗隐身、女儿村的楚楚可怜法术效果，躲避能力提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 675296013
		jns[8] = 1822711583
	elseif jn == "高级水属性吸收" then
		jns[1] = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2532360260
		jns[8] = 1312179231
	elseif jn == "须弥真言" then
		jns[1] = "增加魔力值*0.4的法术伤害力"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0XAABBDD8A
		jns[8] = 0XAABBDD8A
	elseif jn == "土属性吸收" then
		jns[1] = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，但受到雷属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 134325226
		jns[8] = 3503123353
	elseif jn == "拘魂诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1622524729
		jns[8] = 3403104810
	elseif jn == "高级必杀" then
		jns[1] = "物理攻击时的必杀几率增加20%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1672890477
		jns[8] = 1282412196
	elseif jn == "从天而降" then
		jns[1] = "超级神鸡专属技能，大大提高攻击时造成的伤害，但攻击时有一定几率腾空失败。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8F
		jns[8] = 0xAABBDD8F
	elseif jn == "大快朵颐" then
		jns[1] = "超级神猴专属技能，出手前有一定几率触发，大大提升几率性技能（连击、必杀）的触发几率。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8E
		jns[8] = 0xAABBDD8E
	elseif jn == "千钧一怒" then
		jns[1] = "超级神羊专属技能，普通物理攻击造成的伤害≧目标气血伤害*10%时，使自己的主人获得10点愤怒。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8D
		jns[8] = 0xAABBDD8D
	elseif jn == "浮云神马" then
		jns[1] = "超级神马专属技能，在场时，提高自己及主人10%的速度，最多持续5回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8C
		jns[8] = 0xAABBDD8C
	elseif jn == "再生" then
		jns[1] = "战斗中每回合自动恢复(自身等级一半)的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287776911
		jns[8] = 2264480315
	elseif jn == "连击" then
		jns[1] = "45%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1161065019
		jns[8] = 834880568
	elseif jn == "毒" then
		jns[1] = "物理攻击时有15%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 142259178
		jns[8] = 3804526840
	elseif jn == "杳无音讯" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "无常步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2049632078
		jns[8] = 739072521
	elseif jn == "鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响，但也不能使用药品和食物恢复气血（可以食用包子）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813494718
		jns[8] = 4276424619
	elseif jn == "法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有大幅度的波动(50%-120%)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 762242741
		jns[8] = 267613400
	elseif jn == "坐莲" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10魔法"
		jns[5] = "莲花宝座技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2462764859
		jns[8] = 3850121742
	elseif jn == "后发制人" then
		jns[1] = "休息一回合后攻击指定目标\n休息期间:\n#Y提高自身防御=技能等级*3.5\n#Y法防自身降低=技能等级*0.4"
		jns[3] = 4
		jns[4] = "最大气血的5%"
		jns[5] = "无双一击技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3809037555
		jns[8] = 1112380505
	elseif jn == "阎罗令" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*3+自身力量的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)\n#Y天黑状态提高伤害+技能等级*1.5"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "幽冥术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2806354228
		jns[8] = 3446923388
	elseif jn == "魔之心" then
		jns[1] = "对敌人的法术伤害效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 718604442
		jns[8] = 2278038627
	elseif jn == "神佑复生" then
		jns[1] = "战斗死亡时有15%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1409514751
		jns[8] = 2943632069
	elseif jn == "偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震。攻击效果增加5%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3049408565
		jns[8] = 205675459
	elseif jn == "必杀" then
		jns[1] = "物理攻击时的必杀几率增加10%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3789166294
		jns[8] = 1107454372
	elseif jn == "驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法术伤害效果增加50%，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 416049958
		jns[8] = 2077703648
	elseif jn == "三昧真火" then
		jns[1] = "使用后可以攻击对方单个对象\n#Y技能附带10%法暴几率"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "火云术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 626159438
		jns[8] = 290397996
   	elseif jn == "超级三昧真火" then
		jns[1] = "对敌方单个目标造成法术伤害。"
		jns[3] = 7
		jns[6] = "新宝宝.gpk"
		jns[7] = "超级三昧真火技能图标"
		jns[8] = "超级三昧真火技能图标"
	elseif jn == "高级火属性吸收" then
		jns[1] = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2898051336
		jns[8] = 1343324785
	elseif jn == "高级永恒" then
		jns[1] = "受到的治疗效果提高50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4168001168
		jns[8] = 3963828674
	elseif jn == "横扫千军" then
		jns[1] = "能连续攻击对方3次\n但使用后需休息一回合\n休息时不能使用战斗指令\n也不会受封类法术影响\n休息期间:\n#Y自身防御和法防降低10%"
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427




	elseif jn == "紫气东来" then
		jns[1] = "克制普陀山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "小乘佛法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3576748561
		jns[8] = 3918273363
	elseif jn == "炼气化神" then
		jns[1] = "一定回合内补充自己和队友的魔法\n#Y魔法数值=技能等级%2"
		jns[3] = 3
		jns[4] = "技能等级%2的气血"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2394667501
		jns[8] = 1686425132
	elseif jn == "毒经" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3161058590
		jns[8] = 1458078261
	elseif jn == "嗜血" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "文韬武略技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2341356120
		jns[8] = 831906636
	elseif jn == "推拿" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y回血数值=技能等级*5+自身灵力的10%"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "歧黄之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 404486915
		jns[8] = 4289032145
	elseif jn == "火牛阵" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1917391753
		jns[8] = 1358009688
	elseif jn == "反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3941065708
		jns[8] = 3754360316
	elseif jn == "牛刀小试" then
		jns[1] = "初入江湖必备技能"
		jns[3] = 4
		jns[4] = "20魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3416022732
		jns[8] = 3416022732
	elseif jn == "一笑倾城" then
		jns[1] = "令多个目标一定回合无法使用法术"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“倾国倾城”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3266381545
		jns[8] = 522280593
	elseif jn == "穿云破空" then
		jns[1] = "为腰带附加提升物理攻击伤害结果的临时效果。"
		jns[3] = 9
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“啸傲”技能达到35级，人物等级达到30级。 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3294906395
		jns[8] = 3294906395
	elseif jn == "鹰击" then
		jns[1] = "攻击对方多人，使用后需要休息1回合"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "生死搏技能达到30级，不允许连续两回合使用"
		jns[6] = "物品图标.wdf"
		jns[7] = 3219722580
		jns[8] = 1443303401
	elseif jn == "娉婷袅娜" then
		jns[1] = "使对手一定回合无法使用装备特技"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 768000231
		jns[8] = 1404049159
	elseif jn == "高级招架" then
		jns[1] = "受到物理伤害抵消20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 450878763
		jns[8] = 1018872745

	elseif jn == "幸运" then
		jns[1] = "被法术和物理暴击几率降低25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3640080474
		jns[8] = 1085801234
	elseif jn == "金刚经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2444843522
		jns[8] = 4122844852
	elseif jn == "霹雳咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 53930907
		jns[8] = 300592749
	elseif jn == "魂飞魄散" then
		jns[1] = "使用后驱散目标因门派法术获得的所有良性状态（变身除外）。 "
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "“六道轮回”技能达到50级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1594584941
		jns[8] = 2719875429
	elseif jn == "妙手回春" then
		jns[1] = "重复技能无效果,请用推气过宫"
		jns[3] = 6
		jns[4] = "无介绍"
		jns[5] = "歧黄之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 416089174
		jns[8] = 2939581056
	elseif jn == "堪察令" then
		jns[1] = "鉴定头盔、饰品、腰带、靴子等类装备，学习后也可在长安书店制作相应等级的“灵宝图鉴”。"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "灵通术技能达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4073909039
		jns[8] = 2150653771
	elseif jn == "渡世步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2399184502
		jns[8] = 2261339260
	elseif jn == "姐妹同心" then
		jns[1] = "减少对方一定的魔法\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "姊妹相随技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 42398851
		jns[8] = 502149406
	elseif jn == "飞行" then
		jns[1] = "伤害和灵力提高5%,但防御力降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813574344
		jns[8] = 1190813269
	elseif jn == "尸腐恶" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3997271777
		jns[8] = 22951667
	elseif jn == "天外魔音" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3819811307
		jns[8] = 2331712128
	elseif jn == "吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的25%, 如果对方有异常状态，吸血后会中毒，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 668285297
		jns[8] = 156592686
	elseif jn == "一气化三清" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "修仙术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4257500096
		jns[8] = 2501870432
	elseif jn == "乾坤妙法" then
		jns[1] = "保护队友和自己\n使其不受任何负面影响\n但也无法进行任何行动\n血量必须大于50%才能使用"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1736041428
		jns[8] = 3294906395
	elseif jn == "失魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2029120895
		jns[8] = 2414938178
	elseif jn == "护法金刚" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 223144262
		jns[8] = 84328029
	elseif jn == "定身符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 170590832
		jns[8] = 2539497909
	elseif jn == "颠倒五行" then
		jns[1] = "提高自身和队友50%的五行法术吸收几率\n并且受到法术伤害降低30%"
		jns[3] = 3
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“五行扭转”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1849998950
		jns[8] = 3616521026
	elseif jn == "回身击" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1224508814
		jns[8] = 2667913913
	elseif jn == "嗜血追击" then
		jns[1] = "使用物理攻击目标时，会有一定几率攻击另一个目标一次。此效果每回合只会触发一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287596045
		jns[8] = 3287596045
	elseif jn == "反间之计" then
		jns[1] = "令怪物处于混乱状态\n不能用于玩家对战"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "文韬武略技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 146786390
		jns[8] = 841319996
	elseif jn == "小乘佛法" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2925047058
		jns[8] = 1573500785
	elseif jn == "一苇渡江" then
		jns[1] = "战斗中临时提高自己或队友的速度\n#Y速度数值=技能等级*2.5"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2822966564
		jns[8] = 1136663058
	elseif jn == "九龙诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 140291603
		jns[8] = 923894374
	elseif jn == "活血" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y回血数值=技能等级*5+自身敏捷的10%"
		jns[3] = 3
		jns[4] = "70点魔法"
		jns[5] = "歧黄之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2432822176
		jns[8] = 2865439591
	elseif jn == "疾风步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2104231936
		jns[8] = 552299472
	elseif jn == "错乱" then
		jns[1] = "令对手无法使用法术\n并在物理攻击时出现目标偏差"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3622268205
		jns[8] = 4290077259
	elseif jn == "兵解符" then
		jns[1] = "在战斗中立即传送回自己门派\n溜之大吉"
		jns[3] = 66
		jns[4] = "无消耗"
		jns[5] = "符之术技能等级达到10级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1268134129
		jns[8] = 2026082073
	elseif jn == "神兵鉴赏" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 743065692
		jns[8] = 4243999668
	elseif jn == "神力无穷" then
		jns[1] = "打造后为腰带提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "狂兽诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3809438015
		jns[8] = 3884615585
	elseif jn == "宁气诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1979452270
		jns[8] = 3573433154
	elseif jn == "还阳术" then
		jns[1] = "复活倒地的队友，提高攻击力，降低防御力"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“拘魂诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2874709055
		jns[8] = 485361049
	elseif jn == "文韬武略" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1708888521
		jns[8] = 3150772814
	elseif jn == "神道无念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1749937072
		jns[8] = 3852659463
	elseif jn == "牛逼神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3975126128
		jns[8] = 2741787302
	elseif jn == "极度疯狂" then
		jns[1] = "受到物理攻击时会自动反击敌人"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "魔兽反噬技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 363599535
		jns[8] = 2884919862
	elseif jn == "大慈大悲" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1267473253
		jns[8] = 3966881348
	elseif jn == "归元咒" then
		jns[1] = "消耗魔法值来补充自己的气血\n#Y回血数值=技能等级*2+自身灵力的10%"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%点魔法"
		jns[5] = "归元心法技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2473529751
		jns[8] = 3090930843
	elseif jn == "普渡众生" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y气血数值=技能等级*2+自身灵力的10%"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "金刚经技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 688650727
		jns[8] = 3407231441
	elseif jn == "混元道果" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 675093303
		jns[8] = 3799123064
	elseif jn == "飞花摘叶" then
		jns[1] = "吸取敌方多人魔法为我方队员所使用\n且敌方受到女儿村封印技能\n命中几率提高5%\n持续3回合"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“清歌妙舞”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4065673057
		jns[8] = 1962869359
	elseif jn == "秋波暗送" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1698608098
		jns[8] = 975668103
	elseif jn == "魔王护持" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "牛逼神功技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 937481251
		jns[8] = 3778438121
	elseif jn == "反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击伤害为正常伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2574462722
		jns[8] = 326702364
	elseif jn == "黄庭经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2680262225
		jns[8] = 1501050246
	elseif jn == "五行扭转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3256679059
		jns[8] = 3457635171
	elseif jn == "魔兽神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2952870578
		jns[8] = 10218458
	elseif jn == "大鹏展翅" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1243494819
		jns[8] = 2200620761
	elseif jn == "推气过宫" then
		jns[1] = "战斗中恢复多人气血\n#Y回血数值=技能等级*2.5+自身灵力的10%"
		jns[3] = 3
		jns[4] = "50点魔法*人数"
		jns[5] = "歧黄之术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 971215069
		jns[8] = 2227035198
	elseif jn == "归元心法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3444112895
		jns[8] = 2996031232
	elseif jn == "飞行符" then
		jns[1] = "学习后也可在长安书店制作飞行符"
		jns[3] = 0
		jns[4] = "消耗一定的体力"
		jns[5] = "符之术技能达到21级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1788221468
		jns[8] = 1798664293
	elseif jn == "蛛丝阵法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 487492946
		jns[8] = 2233726885
	elseif jn == "红袖添香" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 547746768
		jns[8] = 1757842178
	elseif jn == "连环击" then
		jns[1] = "疯狂地连续的攻击敌人"
		jns[3] = 4
		jns[4] = "可连击次数×30点魔法"
		jns[5] = "狂兽诀技能达到30级，使用后解除当前所有增益状态"
		jns[6] = "物品图标.wdf"
		jns[7] = 3608703815
		jns[8] = 673541382
	elseif jn == "高级连击" then
		jns[1] = "55%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1321871887
		jns[8] = 3016140514
-------------------------------------------------------超级技能
  	elseif jn == "超级夜战" then
		jns[1] = "造成物理伤害提高10%;夜间物理伤害效果不会减少，并提高躲避能力20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D90D
		jns[8] = 0xDC76D90D

	elseif jn == "超级驱怪" then
		jns[1] = "法术攻击时该被动技能无效，造成的伤害增加25%,有1%几率秒杀对手(该效果每回合最多生效一次)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D90D
		jns[8] = 0xDC76D90D
	elseif jn == "超级反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击的伤害忽视敌方10%防御！"
	 	jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7624A7
		jns[8] = 0xDC7624A7
	elseif jn == "超级反震" then
		jns[1] = "受到物理攻击时：30%反震对方，反震伤害为你所受伤害的60%；避免被敌人连击；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC762440
		jns[8] = 0xDC762440
	elseif jn == "超级吸血" then
		jns[1] = "物理攻击时：吸取对方所掉气血的30%；并将获得的溢出气血的50%转化为护盾；攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76DCBA
		jns[8] = 0xDC76DCBA
    elseif jn == "超级连击" then
		jns[1] = "55%的几率连续两次物理攻击，触发连击时候有30%几率额外攻击一次,拥有此技能物理攻击效果会降低20%，如果对方有反震技能，只能攻击一次"
		jns[3] = 7     --------------7魔兽要诀 4特殊魔兽要诀
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76BCA7
		jns[8] = 0xDC76BCA7
	elseif jn == "超级飞行" then
		jns[1] = "进入战斗后,伤害和法伤提高10%,不在降低防御和法伤"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7639D0
		jns[8] = 0xDC7639D0
	elseif jn == "超级隐身" then
		jns[1] = "进入战斗后，获得修罗隐身状态3~5回合；隐身时不会被攻击；物理攻击能力降低10%；受到的伤害也降低10%；隐身时不能施法；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761E7D
		jns[8] = 0xDC761E7D
    elseif jn == "超级感知" then
		jns[1] = "可攻击修罗隐身、楚楚可怜状态之敌；气血增加10%；在场时主人也获得“感知”持续5回合，"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76500A
		jns[8] = 0xDC76500A
 	elseif jn == "超级再生" then
		jns[1] = "每回合恢复自身等级×3的气血；有20%几率回复自身等级×12的气血；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76198A
		jns[8] = 0xDC76198A

 	elseif jn == "超级冥思" then                   ----------------------------没写
		jns[1] = "每回合恢复自身(自身等级二分之一)的魔法；在场时主人获得“冥思”持续5回合"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76446C
		jns[8] = 0xDC76446C
   elseif jn == "超级驱鬼" then
		jns[1] = "对有鬼魂术之敌，物理及法术伤害效果增加150%；可将鬼魂术之敌击飞，使其不能复活"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766D7D
		jns[8] = 0xDC766D7D
	elseif jn == "超级毒" then
		jns[1] = "自身对毒免疫；物理攻击后：30%几率使敌人中毒；中毒后每回合减少等级*2+对方1%的气血,且随机降低中毒目标的攻击、防御、法伤或法防；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761E00
		jns[8] = 0xDC761E00
    elseif jn == "超级慧根" then
	    jns[1] = "使用法术时所消耗的魔法降低为正常的50%，且有30%的几率不消耗魔法；"
	    jns[3] = 7
	    jns[6] = "超级技能.wdf"
	    jns[7] = 0xDC768B79
	    jns[8] = 0xDC768B79
   elseif jn == "超级必杀" then
		jns[1] = "物理攻击的必杀几率增加30%；且必杀时有25%的几率造成3-4倍的必杀伤害；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76E841
		jns[8] = 0xDC76E841
	elseif jn == "超级幸运" then
		jns[1] = "被法术和物理暴击几率降低50%；且有5%的概率免疫受到的攻击伤害"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D20B
		jns[8] = 0xDC76D20B
	elseif jn == "超级精神集中" then
		jns[1] = "可以抵御封类异常状态,法伤提高10%,但物理攻击能力会降低20%；受到的伤害随机降低1%~10%；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC768B81
		jns[8] = 0xDC768B81
    elseif jn == "超级神迹" then
		jns[1] = "不受所有异常状态影响，主人在场时,并且每回合结束时自动解除主人一种异常状态！"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC768163
		jns[8] = 0xDC768163
    elseif jn == "超级招架" then
		jns[1] = "受到物理基础伤害降低10%,每回合第一次受到物理基础伤害降低80%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76209C
		jns[8] = 0xDC76209C
    elseif jn == "超级永恒" then
		jns[1] = "受到的治疗效果提高100%"
		jns[3] = 7
		jns[4] = "全部魔法"
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76F083
		jns[8] = 0xDC76F083
   elseif jn == "超级敏捷" then
		jns[1] = "速度增加30%；5%概率额外重复一次攻击或施法；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC7624AD
		jns[8] = 0xDC7624AD
   elseif jn == "超级否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受到所有伤害减少20%，提高15%所有伤害、受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能(精神集中,神迹等技能会失效)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766108
		jns[8] = 0xDC766108
   elseif jn == "超级魔之心" then
		jns[1] = "法术伤害效果提高30%；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76E70E
		jns[8] = 0xDC76E70E
	elseif jn == "超级偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震，物理攻击效果提高20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76859E
		jns[8] = 0xDC76859E
	elseif jn == "超级奔雷咒" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点雷两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76CCD7
		jns[8] = 0xDC76CCD7
	elseif jn == "超级泰山压顶" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点土两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76694D
		jns[8] = 0xDC76694D

	elseif jn == "超级水漫金山" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点水两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC765E1E
		jns[8] = 0xDC765E1E

	elseif jn == "超级地狱烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人；对主目标造成的伤害提高10%,并有25%几率附弱点火两回合"
		jns[3] = 4
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76282C
		jns[8] = 0xDC76282C
	elseif jn == "超级雷属性吸收" then
		jns[1] = "必定免受雷属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76D794
		jns[8] = 0xDC76D794
	elseif jn == "超级土属性吸收" then
		jns[1] = "必定免受土属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC769194
		jns[8] = 0xDC769194
	elseif jn == "超级水属性吸收" then
		jns[1] = "必定免受水属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC765E94
		jns[8] = 0xDC765E94
	elseif jn == "超级火属性吸收" then
		jns[1] = "必定免受火属性法术伤害，并100%几率恢复按应受伤害值的等量气血"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76A094
		jns[8] = 0xDC76A094
   elseif jn == "超级强力" then  ----------没写完
		jns[1] = "增加(自身等级×0.8)的攻击,攻击没有防御或高级防御的敌人有10%概率使敌人头晕：2回合内造成的伤害降低50%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC762FB6
		jns[8] = 0xDC762FB6
   elseif jn == "超级防御" then
		jns[1] = "增加(自身等级×1.1)的防御"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC763029
		jns[8] = 0xDC763029
   elseif jn == "超级进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,第2回合及以后进入战斗时,提升50%的必杀几率持续5回合。"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068C9
		jns[8] = 0xF6A068C9
	elseif jn == "超级进击法暴" then
		jns[1] = "宠物技能必须有,法暴或者高级法暴的时候才能生效,第2回合及以后进入战斗时,提升50%的法暴几率持续5回合。"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76C8A7
		jns[8] = 0xDC76C8A7
    elseif jn == "超级法术连击" then
		jns[1] = "使用法术攻击目标时增加50%几率续2次攻击敌人,二次伤害降低20%"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC761895
		jns[8] = 0xDC761895
   elseif jn == "超级法术暴击" then
		jns[1] = "法术攻击时的暴击几率增加30%，出现暴击时伤害结果会加倍,有15%的几率造成3-4倍的暴击伤害；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068C8
		jns[8] = 0xF6A068C8
	elseif jn == "超级法术波动" then
		jns[1] =  "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动(70%-150%)"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068D1
		jns[8] = 0xF6A068D1
	elseif jn == "超级壁垒击破" then
		jns[1] =  "发动物理攻击,该攻击忽视对方60%的防御。如果目标本回合防御，则会受到更大伤害。用此技能攻击时，会忽视“防御”,“高级防御”,“超级防御”技能产生的技能效果。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC76EADD
		jns[8] = 0xDC76EADD
	elseif jn == "超级法术抵抗" then
		jns[1] =  "减少20%所受到的法术伤害；且进场时额外减少50%所受到的法术伤害，持续两回合；"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xF6A068D2
		jns[8] = 0xF6A068D2
  	elseif jn == "超级盾气" then
		jns[1] = "进入战斗后，则提高其等级*3的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC763C58
		jns[8] = 0xDC763C58
   elseif jn == "超级合纵" then
		jns[1] = "当本方有1|2|3|4种与其不同的召唤兽，则提高4|8|12|16%物理伤害结果"
		jns[3] = 7
		jns[6] = "超级技能.wdf"
		jns[7] = 0xDC766F4D
		jns[8] = 0xDC766F4D


---------------------------------------------------------------------
	elseif jn == "隐身" then
		jns[1] = "自动附加地府修罗隐身法术2～3回合，拥有此技能物理攻击能力会降低20%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1508147758
		jns[8] = 3007875758
	elseif jn == "高级隐身" then
		jns[1] = "自动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2491734238
		jns[8] = 2948130962
	elseif jn == "似玉生香" then
		jns[1] = "令对手一定回合不能法术和普通攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "闭月羞花技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2732466496
		jns[8] = 3524410344
	elseif jn == "斜月步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 769022309
		jns[8] = 2124205828
	elseif jn == "日光华" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2064123225
		jns[8] = 877019458
	elseif jn == "寡欲令" then
		jns[1] = "解除并避免盘丝洞封类法术的影响。"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "灵通术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 653757983
		jns[8] = 482656655
	elseif jn == "法术连击" then
		jns[1] = "使用法术攻击目标时会有一定几率出现连续2次攻击敌人"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2200246844
		jns[8] = 345682085
	elseif jn == "黄泉之息" then
		jns[1] = "攻击对方单人，并减少10%的速度，夜间使用会增加50%的技能伤害"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“幽冥术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3536984715
		jns[8] = 1893059881
	elseif jn == "魔音摄魂" then
		jns[1] = "让敌方\n受到治疗效果降低100%\n持续4回合"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“天外魔音”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 32064057
		jns[8] = 1554838399
	elseif jn == "锢魂术" then
		jns[1] = "使用后可使目标5个回合内\n在死亡状态下无法被复活"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "幽冥术技能达到75级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1727365486
		jns[8] = 784403165
	elseif jn == "牛屎遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "裂石步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2481624731
		jns[8] = 668274006
	elseif jn == "高级法术连击" then
		jns[1] = "使用法术攻击目标时会有较大几率出现连续2次攻击敌人"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3484714916
		jns[8] = 1890987017
	elseif jn == "高级神佑复生" then
		jns[1] = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2040400078
		jns[8] = 3049938323
	elseif jn == "牛劲" then
		jns[1] = "战斗中暂时提高自己的法术伤害力\n#Y提升法伤数值=技能等级*3.5"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "火牛阵技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3521936089
		jns[8] = 1080213476
	elseif jn == "无常步" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2772099555
		jns[8] = 71871380
	elseif jn == "为官之道" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2338752455
		jns[8] = 2050205097
	elseif jn == "狮搏" then
		jns[1] = "以高于平时的伤害力攻击对方单人"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "生死搏技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3700481839
		jns[8] = 1627374280
	elseif jn == "威慑" then
		jns[1] = "令怪物或玩家召唤兽无法行动\n不能对玩家使用"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "训兽诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 81423983
		jns[8] = 894640149
	elseif jn == "盘丝步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3406981495
		jns[8] = 337337940
	elseif jn == "磐龙灭法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 423192983
		jns[8] = 1962038233
	elseif jn == "清歌妙舞" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1027945253
		jns[8] = 2444515719
	elseif jn == "魔息术" then
		jns[1] = "一定回合内恢复自身的魔法 "
		jns[3] = 5
		jns[4] = "50点气血"
		jns[5] = "人物飞升且“阴阳二气诀”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3643037170
		jns[8] = 787252900
	elseif jn == "三花聚顶" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y(魔法=技能等级*2+自身灵力的10%)*0.5"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%的气血"
		jns[5] = "明性修身技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3813527840
		jns[8] = 3150915326
	elseif jn == "幽冥术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2105426613
		jns[8] = 414994835
	elseif jn == "龙附" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "龙附技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2888970157
		jns[8] = 1784954158
	elseif jn == "勾魂" then
		jns[1] = "减少对方一定的气血\n从而恢复自身气血\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941
		jns[8] = 802455732
	elseif jn == "盘丝大法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2544956347
		jns[8] = 136964443
	elseif jn == "知己知彼" then
		jns[1] = "使用后可以查看敌方的信息"
		jns[3] = 4
		jns[4] = "80点魔法"
		jns[5] = "清明自在达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 196316992
		jns[8] = 2448181313
	elseif jn == "天罡气" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4224325719
		jns[8] = 517623127
	elseif jn == "高级隐身" then
		jns[1] = "动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2491734238
		jns[8] = 2948130962
	elseif jn == "落雷符" then
		jns[1] = "法术攻击多个目标\n#Y对鬼魂术、高级鬼魂术敌人伤害增加20%"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "“符之术”技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3476452217
		jns[8] = 3226830020
	elseif jn == "象形" then
		jns[1] = "攻击敌人并令其下回合无法行动\n但使用后自己也将在下回合停止行动\n且取消变身状态"
		jns[3] = 4
		jns[4] = "80魔法"
		jns[5] = "生死搏技能达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 3175084157
		jns[8] = 108912467
	elseif jn == "天魔解体" then
		jns[1] = "使用后持续一定回合\n数将自身的物理防御降低50%\n防御值的10%转化为临时伤害"
		jns[3] = 5
		jns[4] = "当前角色最大魔法的80%"
		jns[5] = "人物飞升且“生死搏”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2713209956
		jns[8] = 2477360209
	elseif jn == "水遁" then
		jns[1] = "平时或战斗中使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "战斗时消耗当前所有魔法，非战斗时消耗10点气血、魔法"
		jns[5] = "游龙术技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 596614171
		jns[8] = 2671300567
	elseif jn == "震天诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1449209742
		jns[8] = 1917106392
	elseif jn == "斗转星移" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "七星遁技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2019188530
		jns[8] = 655674701
	elseif jn == "水属性吸收" then
		jns[1] = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 92545119
		jns[8] = 1756512785
	elseif jn == "宁心" then
		jns[1] = "解除并避免女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "宁气诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585090388
		jns[8] = 1957863037
	elseif jn == "明性修身" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4104116990
		jns[8] = 3074583809
	elseif jn == "打造技巧" then
		jns[1] = "铸造名家欧冶子传下的技能\n可以提高打造武器的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3866239213
		jns[8] = 1635206107
	elseif jn == "千里神行" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "消耗10点气血和10点魔法"
		jns[5] = "疾风步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 13494159
		jns[8] = 1717996623
	-- 1.3新增
	elseif jn == "天地无极" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2616462789
		jns[8] = 3629430297
	elseif jn == "九转玄功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1837364177
		jns[8] = 1720159516
	elseif jn == "武神显圣" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3229675127
		jns[8] = 2285367568
	elseif jn == "啸傲" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1753145086
		jns[8] = 796505945
	elseif jn == "气吞山河" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4005775594
		jns[8] = 1613219782
	elseif jn == "诛魔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 150136690
		jns[8] = 2802612826
	elseif jn == "法天象地" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2858795509
		jns[8] = 3937616310
	elseif jn == "踏山裂石" then
		jns[1] = "临时提升必杀几率对单个敌人进行物理攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF4DCF38F
		jns[8] = 0x1C603FAE
	elseif jn == "裂石" then
		jns[1] = "对单个敌人进行物理攻击\n#Y技能附带20%必杀几率\n#S增加1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF4DCF38F
		jns[8] = 0x1C603FAE
	elseif jn == "断岳势" then
		jns[1] = "对单个敌人进行2次物理攻击\n#Y技能附带10%必杀几率\n#S消耗1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、1点战意"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5AA54949
		jns[8] = 0x5C95AF41
	elseif jn == "天崩地裂" then
		jns[1] = "对单个敌人进行3次物理攻击\n#Y技能附带10%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、3点战意"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9ADAEA80
		jns[8] = 0x3FB03390
	elseif jn == "浪涌" then
		jns[1] = "对单个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S增加1点战意值"
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xCE61D91C
		jns[8] = 0x1A289BEA
	elseif jn == "惊涛怒" then
		jns[1] = "对多个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S消耗1点战意值"
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB91C6953
		jns[8] = 0xBE11779C
	elseif jn == "翻江搅海" then
		jns[1] = "多个敌人进行物理攻击\n#Y技能附带3%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "个数*30点魔法"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x26419C11
		jns[8] = 0x11879028
	elseif jn == "腾雷" then
		jns[1] = "对目标造成法术伤害\n有几率降低目标#Y50%治疗恢复效果"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "“诛魔”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x569D01F7
		jns[8] = 0x956BA0A2
	elseif jn == "指地成钢" then
		jns[1] = "克制无底洞弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“诛魔”技能达到25级，人物等级达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4AB6831C
		jns[8] = 0x1C603FAE
	elseif jn == "不动如山" then
		jns[1] = "减少自身受到的法术伤害与物理伤害\n#Y提升防御数值=技能等级*3\n#Y提升法防数值=技能等级*2"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "“九转玄功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD96F2331
		jns[8] = 0x38C47290
	elseif jn == "碎星诀" then
		jns[1] = "提升自己或队友的物理伤害结果\n不能与镇魂诀同时存在\n#Y提升伤害数值=技能等级*5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“武神显圣”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x136442C0
		jns[8] = 0x5F8D7935
	elseif jn == "镇魂诀" then
		jns[1] = "提升自己或者队友的#Y24%必杀几率\n不能与碎星诀同时存在\n#Y提升伤害数值=技能等级*3"
		jns[3] = 3
		jns[4] = "5%的当前气血"
		jns[5] = "“武神显圣”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9E1580AA
		jns[8] = 0xF808DCC6
	elseif jn == "无穷妙道" then
		jns[1] = "一定几率解除无底洞封印法术。"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "“法天象地”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAFDB81A4
		jns[8] = 0x76FBBEEC
	elseif jn == "纵地金光" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“法天象地”技能达到1级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE6A2AA59
		jns[8] = 0xFEF5D678
	-- 神木林
	elseif jn == "瞬息万变" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 91138644
		jns[8] = 3611723828
	elseif jn == "万灵诸念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1673295044
		jns[8] = 3633730222
	elseif jn == "巫咒" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1387740863
		jns[8] = 3945429798
	elseif jn == "万物轮转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 236054114
		jns[8] = 3548374182
	elseif jn == "天人庇护" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 466502506
		jns[8] = 2656066797
	elseif jn == "神木恩泽" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1911264426
		jns[8] = 785936658
	elseif jn == "驭灵咒" then
		jns[1] = "按技能等级提高最大魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3018347230
		jns[8] = 1524159458
	elseif jn == "落叶萧萧" then
		jns[1] = "使用法术攻击敌方多个目标\n#Y技能附带10%法连几率"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "“瞬息万变”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2E734F9D
		jns[8] = 0x0B8CF3A1
	elseif jn == "荆棘舞" then
		jns[1] = "使用法术攻击敌方，造成较高伤害。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xDD2AB898
		jns[8] = 0x6A647570
	elseif jn == "尘土刃" then
		jns[1] = "使用法术攻击敌方单体目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身法伤的10%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x3FE17E30
		jns[8] = 0x71C197B0
	elseif jn == "冰川怒" then
		jns[1] = "使用法术攻击敌方单体目标\n#Y有20%概率冻结目标使其无法行动\n#S有80%几率使目标所有伤害降低10%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xEDF81F56
		jns[8] = 0x3B12CD18
	elseif jn == "雾杀" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*2+自身灵力的20%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1EE55D3C
		jns[8] = 0x0DA2D8DF
	elseif jn == "血雨" then
		jns[1] = "对目标造成大量单体法术伤害"
		jns[3] = 4
		jns[4] = "150"
		jns[5] = "“巫咒”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x126B932F
		jns[8] = 0x7D52C301
	elseif jn == "星月之惠" then
		jns[1] = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的10%"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4284560198
		jns[8] = 8287795
	elseif jn == "炎护" then
		jns[1] = "抵御50%的气血伤害\n#Y每抵御1点伤害消耗1点魔法"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“天人庇护”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA215E746
		jns[8] = 0xC5D73984
	elseif jn == "叶隐" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“天人庇护”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x64FEA3A4
		jns[8] = 0x51763883
	elseif jn == "神木呓语" then
		jns[1] = "打造后为鞋子临时增加一定的魔法值。"
		jns[3] = 12
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“神木恩泽”技能达到35级，人物等级达到30级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x977F5625
		jns[8] = 0x33CC0A38
	elseif jn == "蜜润" then
		jns[1] = "提升自己或队友的灵力法伤\n#Y提升伤害数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "25点魔法"
		jns[5] = "“驭灵咒”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x058EE366
		jns[8] = 0xF83E2272
	elseif jn == "蝼蚁蚀天" then
		jns[1] = "克制凌波城弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "“驭灵咒”技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAC0B8B61
		jns[8] = 0xAC574467
	-- 无底洞
	elseif jn == "枯骨心法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3947876534
		jns[8] = 3256658495
	elseif jn == "阴风绝章" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 580599606
		jns[8] = 2376753741
	 elseif jn == "鬼蛊灵蕴" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2137124880
		jns[8] = 642299714
	elseif jn == "燃灯灵宝" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2206649654
		jns[8] = 2011054851
	elseif jn == "地冥妙法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2066772317
		jns[8] = 1202816090
	elseif jn == "混元神功" then
		jns[1] = "按技能等级提伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3367413411
		jns[8] = 2065734785
	elseif jn == "秘影迷踪" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4041502466
		jns[8] = 2278980523
	elseif jn == "移魂化骨" then
		jns[1] = "使目标获得吸血效果\n持续一定回合"
		jns[3] = 3
		jns[4] = "高于最大气血的30%才能使用"
		jns[5] = "“枯骨心法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x173015AE
		jns[8] = 0x121AC8D4
	elseif jn == "夺魄令" then
		jns[1] = "令目标一定回合内无法使用法术。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“阴风绝章”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x62221B56
		jns[8] = 0x076EA85A
	elseif jn == "煞气诀" then
		jns[1] = "使目标一定回合无法做出行动\n并且该目标不会受到攻击\n可作用于敌人或友方"
		jns[3] = 88
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC0504605
		jns[8] = 0x28D6DCD8
		jns[12] = "5回合"
	elseif jn == "惊魂掌" then
		jns[1] = "使用后使对手在持续回合内无法被他人保护"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC232A281
		jns[8] = 0x71307D22
	elseif jn == "摧心术" then
		jns[1] = "使敌方2个目标30%速度降低\n持续一定回合"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[5] = "“阴风绝章”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1CC2B0B0
		jns[8] = 0xD6A5B20C
	elseif jn == "夺命咒" then
		jns[1] = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "“鬼蛊灵蕴”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x2A3E7A3C
		jns[8] = 0xA9AF9E72
	elseif jn == "明光宝烛" then
		jns[1] = "战斗中大幅增加队友和自己的防御\n#Y防御数值=技能等级*4"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x54DB6CDE
		jns[8] = 0x59D84304
	elseif jn == "金身舍利" then
		jns[1] = "战斗中大幅增加队友和自己的法防\n#Y法防数值=技能等级*4"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1BE322B2
		jns[8] = 0xFE884980
	elseif jn == "地涌金莲" then
		jns[1] = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的20%"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "“地冥妙法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x40FB7647
		jns[8] = 0xF437CA2F
	elseif jn == "万木凋枯" then
		jns[1] = "克制神木林弟子的技能"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“地冥妙法”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x036B4345
		jns[8] = 0xF2E06AF8
	elseif jn == "元阳护体" then
		jns[1] = "打造后为武器提升一定的气血"
		jns[3] = 12
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“混元神功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xABD57D92
		jns[8] = 0x2EF58426
	elseif jn == "遁地术" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“秘影迷踪”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1D14968A
		jns[8] = 0x34D061C7
	elseif jn == "惊心一剑" then
		jns[1] = "对敌人造成巨大的物理伤害并"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 472040976
		jns[8] = 376561149
	elseif jn == "力劈华山" then
		jns[1] = "无视对方的防御使对方造成巨大的伤害"
		jns[3] = 4
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3633016146
		jns[8] = 2223068576
	elseif jn == "移花接木" then
		jns[1] = "每次吸收30%的气血伤害"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x5886F7D3
		jns[8] = 0x5886F7D3
	elseif jn == "壁垒击破" then
		jns[1] = "忽视防御的攻击。攻击的目标防御，则会受到更大伤害。用此技能攻击时，会忽视“高级防御”和“防御”这两个召唤兽技能产生的技能效果。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xF1D5925A
		jns[8] = 0xF1D5925A
	elseif jn == "神迹" then
		jns[1] = "每回合结束时自动解除一切异常状态"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1245429649
		jns[8] = 1198707975
	elseif jn == "雷击" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3336994935
		jns[8] = 2495588313
	elseif jn == "上古灵符" then
		jns[1] = "给予对手巨大的法术波动伤害"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAA1341AF
		jns[8] = 0xAA1341AF
	elseif jn == "善恶有报" then
		jns[1] = "攻击时有一定几率给予对手造成双倍的伤害，也有可能为对方恢复一定气血"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 641427651
		jns[8] = 1898344999
	elseif jn == "死亡召唤" then
		jns[1] = "给予对手巨大的伤害，并且使对手处于死亡禁锢状态下，该状态存在时使鬼魂术无效并且不能使用药品进行复活"
		jns[3] = 4
		--jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1218594609
		jns[8] = 4279125360
	elseif jn == "夜舞倾城" then
		jns[1] = "对目标释放一次附加速度和固定伤害的强力法术效果的物理攻击，并且不可暴击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 387579012
		jns[8] = 1832394806
	elseif jn == "灵能激发" then
		jns[1] = "进入战斗后，临时提高自己的法术伤害能力。（法力点数越高效果越好，持续5回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x400FF62B
		jns[8] = 0x0DB9B664
	elseif jn == "盾气" then
		jns[1] = "进入战斗后，临时提高其等级*1.2的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x04B409B4
		jns[8] = 0x04B409B4
	elseif jn == "高级盾气" then
		jns[1] = "进入战斗后，则提高其等级*1.5的防御能力（持续6回合）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8EC237B5
		jns[8] = 0x8EC237B5
	elseif jn == "合纵" then
		jns[1] = "本方每有一种与其不同的召唤兽，则提高其等级#W//5.5的物理伤害结果。同时，灵降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA94D8FEA
		jns[8] = 0xA94D8FEA
	elseif jn == "高级合纵" then
		jns[1] = "本方每有一种与其不同的召唤兽，则提高其等级#W//4的物理伤害结果。同时，灵力降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x4EAD21FF
		jns[8] = 0x4EAD21FF
	elseif jn == "高级否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受法术伤害减少20%，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 484689261
		jns[8] = 2449787202
	elseif jn == "高级精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3121640283
		jns[8] = 3049938323
	elseif jn == "月光" then
		jns[1] = "召唤数道月光攻击敌人，同一个人可以被多道月光攻击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDD8B
		jns[8] = 0xAABBDD8B
	-- 特技
	elseif jn == "气疗术" then
		jns[1] = "恢复（上限3%+200）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 175234791
		jns[8] = 2394534448
	elseif jn == "心疗术" then
		jns[1] = "恢复（上限6%+400）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1936940204
		jns[8] = 4247881671
	elseif jn == "命疗术" then
		jns[1] = "恢复（上限9%+600）的气血，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2327070966
		jns[8] = 1214582243
	elseif jn == "凝气诀" then
		jns[1] = "恢复上限（15%+200）的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2234398453
		jns[8] = 4231419592
	elseif jn == "凝神诀" then
		jns[1] = "恢复上限（15%+400）的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3010398248
		jns[8] = 3594183195
	elseif jn == "气归术" then
		jns[1] = "自身恢复四分之一的气血"
		jns[3] = 5
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1743955726
		jns[8] = 1501636093
	elseif jn == "命归术" then
		jns[1] = "自身恢复二分之一的气血"
		jns[3] = 5
		jns[4] = "130点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585363944
		jns[8] = 1305176222
	elseif jn == "四海升平" then
		jns[1] = "全体恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "135点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2015850288
		jns[8] = 2239024625
	elseif jn == "回魂咒" then
		jns[1] = "单体复活"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3815030652
		jns[8] = 2541979797
	elseif jn == "起死回生" then
		jns[1] = "单体复活并恢复二分之一的气血"
		jns[3] = 3
		jns[4] = "120点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2205777788
		jns[8] = 3279499363
	elseif jn == "水清诀" then
		jns[1] = "单体解除异常状态"
		jns[3] = 3
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1988393110
		jns[8] = 2231990553
	elseif jn == "冰清诀" then
		jns[1] = "单体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4269368884
		jns[8] = 994373130
	elseif jn == "玉清诀" then
		jns[1] = "全体解除异常状态"
		jns[3] = 3
		jns[4] = "125点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2317466220
		jns[8] = 1064948127
	elseif jn == "晶清诀" then
		jns[1] = "全体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4162645482
		jns[8] = 2183757094
	elseif jn == "罗汉金钟" then
		jns[1] = "全体队友受到的法术伤害减半，效果为3回合"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000001
		jns[8] = 0x00000002
	elseif jn == "圣灵之甲" then
		jns[1] = "提升我方全体10%的防御\n效果持续到战斗结束"
		jns[3] = 66
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000003
		jns[8] = 0x00000004
	elseif jn == "魔兽之印" then
		jns[1] = "提升我方全体10%的伤害力\n效果持续到战斗结束 "
		jns[3] = 66
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000005
		jns[8] = 0x00000006
	elseif jn == "光辉之甲" then
		jns[1] = "提升队友的20%的防御\n效果持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000007
		jns[8] = 0x00000008
	elseif jn == "太极护法" then
		jns[1] = "受到的法术伤害减半，效果为6回合 "
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000009
		jns[8] = 0x00000010
  elseif jn == "菩提心佑" then
		jns[1] = "给己方所有目标增加一个临时屏障,可抵御目标等级*5的伤害,持续3回合"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000009
		jns[8] = 0x00000010
	elseif jn == "身似菩提" then
		jns[1] = "给队友或自己添加一个法术反噬状态，该状态持续期间受到的所有法术伤害会让施法者受到同样的伤害,持续2回合"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000011
		jns[8] = 0x00000012
	elseif jn == "先发制人" then
		jns[1] = "提升队友20%的速度，持续3回合"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000013
		jns[8] = 0x00000014
	elseif jn == "野兽之力" then
		jns[1] = "提升队友20%的伤害力\n效果持续到战斗结束 "
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000011
		jns[8] = 0x00000012
	elseif jn == "慈航普渡" then
		jns[1] = "复活我方全体队友。"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000013
		jns[8] = 0x00000014
	elseif jn == "八凶法阵" then
		jns[1] = "超级赤焰兽专属技能，发动法术攻击4个敌人。"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000015
		jns[8] = 0x00000016
	elseif jn == "叱咤风云" then
		jns[1] = "水系法术攻击3个目标，并提高法术连击的概率。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000017
		jns[8] = 0x00000018
	elseif jn == "净台妙谛" then --1
		jns[1] = "增加自身体质*成长*2的气血。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000019
		jns[8] = 0x00000020
	elseif jn == "法术防御" then
		jns[1] = "极强的法术防御技能。可以防御法术攻击，减少65%的法术伤害，但无法防御物理攻击。"
		jns[3] = 66
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000021
		jns[8] = 0x00000022
	elseif jn == "理直气壮" then --1
		jns[1] = "普通攻击时，40%的几率攻击3次；但物理伤害效果降低20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000023
		jns[8] = 0x00000024
	elseif jn == "天降灵葫" then
		jns[1] = "群体法术攻击，随机攻击1~5个目标，最多5人。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000025
		jns[8] = 0x00000026
	elseif jn == "灵能激发" then --1
		jns[1] = "进入战斗后，提高自己的法术伤害能力。（魔力点数越高效果越好，持续到战斗结束）"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000027
		jns[8] = 0x00000028
	elseif jn == "高级法术抵抗" then --1
		jns[1] = "减少10%所受的法术伤害，但同时物理伤害能力减少10%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000029
		jns[8] = 0x00000030
	elseif jn == "灵山禅语" then
		jns[1] = "增加自身魔力*（成长-0.3）的法防。" --1
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000031
		jns[8] = 0x00000032
	elseif jn == "观照万象" then
		jns[1] = "使用所有主动技能进攻目标,冷却回合10回合。"
		jns[3] = 4
		jns[4] = "200点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x00000033
		jns[8] = 0x00000034
	elseif jn == "弱点击破" then
		jns[1] = "单体无视一半防御攻击"
		jns[3] = 4
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4136547665
		jns[8] = 2136234800
	elseif jn == "琴音三叠" then
		jns[1] = "使用3次法术攻击敌人,按次数增加伤害"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4136547665
		jns[8] = 2136234800
	elseif jn == "冥王暴杀" then
		jns[1] = "减少对方气血，最小伤害为50"
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x59DBD730
		jns[8] = 0x59DBD730
	elseif jn == "破血狂攻" then
		jns[1] = "狂性大发，可以连续攻击两次"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4254723553
		jns[8] = 326320655
  elseif jn == "破碎无双" then
		jns[1] = "攻击目标使目标受到伤害\n同时减少相同伤害的蓝量"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4254723553
		jns[8] = 326320655
	elseif jn == "破甲术" then
		jns[1] = "单体防-20%持续到战斗结束"
		jns[3] = 4
		jns[4] = "35点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "碎甲术" then
		jns[1] = "全体防-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "放下屠刀" then
		jns[1] = "降低敌人的20%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884
		jns[8] = 441260658
	elseif jn == "笑里藏刀" then
		jns[1] = "减少敌方单体目标70点愤怒"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884
		jns[8] = 441260658
	elseif jn == "绝幻魔音" then
		jns[1] = "减少敌方全体目标20点愤怒"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x480A8A7D
		jns[8] = 0x172AE1E0
	elseif jn == "流云诀" then
		jns[1] = "单体速+20%持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9715FA32
		jns[8] = 0xA85146A6
	elseif jn == "啸风诀" then
		jns[1] = "全体速+10%持续到战斗结束"
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6812F03B
		jns[8] = 0x96370902
	elseif jn == "河东狮吼" then
		jns[1] = "降低敌方全体10%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4154480125
		jns[8] = 1389260370
	elseif jn == "修罗咒" then
		jns[1] = "单体反弹50%的物理伤害3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xA0830D94
		jns[8] = 0x14FF0C1F
	elseif jn == "天衣无缝" then
		jns[1] = "单体反弹50%的法术伤害3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x68F4FE2B
		jns[8] = 0x76F6DD9E
	elseif jn == "凝滞术" then
		jns[1] = "单体速-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8FF3DB32
		jns[8] = 0x264D9AC8
	elseif jn == "停陷术" then
		jns[1] = "全体速-5%,持续到战斗结束"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x79619181
		jns[8] = 0x5E68270E
   	elseif jn == "调息" then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定气血值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x94308B6B
		jns[8] = 0x5956387D
    elseif jn == "打坐" then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定魔法值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xB77AFA4C
		jns[8] = 0xA0D18931
    elseif jn == "妙手空空" then
		jns[1] = "战斗中使用的法术，可从怪物身上偷来银两或宝物。#G/(每次使用都将消耗目标等级*4点魔法)"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xD4815978
		jns[8] = 0x8466E376
     elseif jn == "宝石工艺" then
		jns[1] = "提高合成宝石的成功率。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x408D50D7
		jns[8] = 0x5899607A
    elseif jn == "奇门遁甲" then
		jns[1] = "在特定场景使用道具“导标旗”做标记，用以传送。1级时可以在长寿村做标记，2级时增加傲来国，3级增加长安城，4级增加朱紫国。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFDB72ACA
		jns[8] = 0xEFE3F812
    elseif jn == "仙灵店铺" then
		jns[1] = "平时使用，能够呼出购买界面直接购买商品。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x47877A93
		jns[8] = 0xF3719878
	elseif jn == "建筑之术" then
		jns[1] = "提高建造房屋的能力，玩家拥有较高的技能后，可以建造更高级的房屋，并获得更多的室内空间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0x9F2DFDB6
		jns[8] = 0x16418D92
	elseif jn == "变化之术" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] =  0xD8118484--0xE6CAA561 --0xD8118484
		jns[8] = 0xE6CAA561--0xD8118484
   	elseif jn == "火眼金睛" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE9D07953
		jns[8] = 0x43CBAF9C
   elseif jn == "飞行技能" then
		jns[1] = "学习后可以使角色腾云驾雾，翱翔天地。"
		jns[3] = 108
		jns[6] = "新界面.wdf"
		jns[7] = 0x00000121
		jns[8] = 0x00000120


	elseif jn == "还魂咒" then
		jns[1] = "施展法术复活死去的同伴\n同时恢复其一定气血\n大概为孩子等级x2的血量"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x987B0EEE
		jns[8] = 0x987B0EEE
	elseif jn == "仙人指路" then
		jns[1] = "恢复目标队友气血\n并解除其封类异常状态"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x8F3BA732
		jns[8] = 0x8F3BA732
	elseif jn == "四面埋伏" then
		jns[1] = "提升目标队友11%的封印命中率\n只在该队友气血≤40%时才生效\n效果持续4回合"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xE2CDD1D3
		jns[8] = 0xE2CDD1D3
	elseif jn == "赴汤蹈火" then
		jns[1] = "提高孩子最大气血540点\n提高法术防御162点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x1dbafffc
		jns[8] = 0x1dbafffc
	elseif jn == "开门见山" then
		jns[1] = "提高孩子最大气血38O点\n提高物理攻击结果100点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0x6ee33a3f
		jns[8] = 0x6ee33a3f
	elseif jn == "张弛有道" then
		jns[1] = "增加魔力值*0.5的法术伤害"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xdc6ae286
		jns[8] = 0xdc6ae286
	elseif jn == "食指大动" then
		jns[1] = "法术攻击3个目标\n受到的法术伤害有25%几率获得一个护盾"
		jns[3] = 4
		jns[4] = "作用目标*50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xdc6ae286
		jns[8] = 0xdc6ae286
	elseif jn == "峰回路转" then
		jns[1] = "当你进场时，立即为全体队友恢复HP"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B85ED35  --没有这个技能素材.
		jns[8] = 0x0B85ED35
    elseif jn == "流沙轻音" then
		jns[1] = "法术攻击5个目标,伤害递减"
		jns[3] = 4
		jns[4] = "作用目标*50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0x0B85ED35
	elseif jn == "武神怒击" then
		jns[1] = "能连续攻击对方3次。但使用后需休息一回合，休息时不能使用战斗指令，也不会受封类法术影响。"
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427
	elseif jn == "刀光剑影" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "毁灭之光" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "其疾如风" then
	jns[1] = "官府弟子多善战者\n行军当迅疾如风\n攻其无备\n使用后大幅度提高我方所有30%速度\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x184E7180
	jns[7] = 0xA208A8AE
	elseif jn == "其徐如林" then
	jns[1] = "兵者以势制权\n徐徐如林出手则必有所得\n使用后解除我方所有异常状态\n恢复5%友方气血上限"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x907FC1B6
	jns[7] = 0x49FB33E7
	elseif jn == "不动如山 " then
	jns[1] = "实而备之\n强而避之\n防御驻守合该岿然如山\n使用后大幅度降低我方所有受到30%的伤害\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x02662BEE
	jns[7] = 0x3EE72C6A
	elseif jn == "侵掠如火" then
	jns[1] = "善用兵者\n攻则侵掠如火\n战无不克\n使用后大幅度提高我方所有30%伤害\n持续6回合"
	jns[3] = 66
	jns[4] = "200点魔法"
	jns[12] = "冷却16回合"
	jns[6] = "物品图标.wdf"
	jns[8] = 0x625EABBA
	jns[7] = 0x7690D6BE
	elseif jn == "进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,提升本身必杀几率的百分之5"--"第2回合及以后进入战斗时,提升15%的必杀几率持续5回合,且遂回合减少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X0000009F
		jns[8] = 0X0000009F
	elseif jn == "进击法暴" then
		jns[1] = "宠物技能必须有法暴或者高级法暴的时候才能生效,提升本身必杀几率的百分之5"--"第2回合及以后进入战斗时,提升10%6的法术暴击几率持续5回合,且逐回合臧少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A0
		jns[8] = 0X000000A0
	elseif jn == "高级进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,提升本身必杀几率的百分之10"--"第2回合及以后进入战斗时,提升30%的必杀几率持续5回合,且遂回合减少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A4
		jns[8] = 0X000000A4
	elseif jn == "高级进击法暴" then
		jns[1] = "宠物技能必须有法暴或者高级法暴的时候才能生效,提升本身必杀几率的百分之10"--"第2回合及以后进入战斗时,提升20%的法术暴击几率持续5回合,且逐回合臧少20%效果。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0X000000A3
		jns[8] = 0X000000A3
	elseif jn == "扶摇万里" then
		jns[1] = "超级鲲鹏专属技能，出场时会对敌方所有目标造成伤害！"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 0xAABBDDA1
		jns[8] = 0xAABBDDA1
	elseif jn == "凝光炼彩" then
		jns[1] = "受伤时有25%的概率获得护盾，护盾值为所受伤害的50%"
		jns[3] = 7
		jns[6] = "护盾括号.wdf"
		jns[7] = 0X0085FDCB
		jns[8] = 0X0085FDCB
      elseif jn == "凭风借力" then
		jns[1] = "每次物理攻击提升必杀时12.5%的伤害结果"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000206
		jns[8] = 0X00000207


   elseif jn == "凭风借力" then---
		jns[1] = "每次物理攻击提升必杀时12.5%的伤害结果"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000206
		jns[8] = 0X00000207
elseif jn == "出其不意" then--
		jns[1] = "使用本回合已方召唤兽未使用过的技能时，造成的伤害结果提升15%。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000065
		jns[8] = 0X00000066
elseif jn == "风起龙游" then--
		jns[1] = "攻击速度低于自身的目标，提升10%的物理效果。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000077
		jns[8] = 0X00000078
elseif jn == "虎虎生威" then--
		jns[1] = "大幅度提升必杀时造成的伤害(与召唤力量点数有关)"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000106
		jns[8] = 0X00000107
elseif jn == "狂莽一击" then--
		jns[1] = "物理伤害提升,但攻击时可能出现偏差(随机增加10%-30%)"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000136
		jns[8] = 0X00000137
elseif jn == "气贯长虹" then--
		jns[1] = "触发连击/高级连击时，伤害提高25%/50%"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000215
		jns[8] = 0X00000216
elseif jn == "神出鬼没" then--
		jns[1] = "进入战斗后获得修罗隐身状态2-3回合:隐身状态下伤害效果提高10%,躲避率增加10%"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000242
		jns[8] = 0X00000243
elseif jn == "义薄云天" then--
		jns[1] = "施法时增加自身等级*0.55的法术伤害力"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000305
		jns[8] = 0X00000306
elseif jn == "溜之大吉" then
		jns[1] = "增加召唤兽20%的速度"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000204
		jns[8] = 0X00000205

elseif jn == "北冥之渊" then--
		jns[1] = "令友方所有的召唤兽增加自身造成的伤害提升30%，持续3回合。冷却15回合"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000031
		jns[8] = 0X00000032

elseif jn == "无畏布施" then
		jns[1] = "增加目标的防御、法防，伤害增加20%。"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000274
		jns[8] = 0X00000275

elseif jn == "神来气旺" then
		jns[1] = "攻击6个单位.听说很厉害.伤害会根据牛脾气波动。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000244
		jns[8] = 0X00000245

elseif jn == "哼哼哈兮" then
		jns[1] = "快使用双截棍哼哼哈兮,习武之人切记仁者无敌。对目标进行随机次数物理攻击。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000104
		jns[8] = 0X00000105
  elseif jn == "水击三千" then
		jns[1] = "临时提升物理伤害结果和暴击倍率进行一次物理攻击。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000248
		jns[8] = 0X00000249
  elseif jn == "昼伏夜出" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，进入战斗后伤害提升10%。"
		jns[3] = 7
		jns[6] = "素材修复.wdf"
		jns[7] = 0X00000246
		jns[8] = 0X00000247

	elseif jn == "滋养" then
			jns[1] = "召唤绿意之灵:汲取大地滋养,为友方注入勃勃生机,迅速恢复气血。\n恢复友方单个目标的气血"
			jns[3] = 5
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x82DE1BB0
			jns[8] = 0x82DE1BB0
	------------------------------------------------空
	elseif jn == "轻歌飘舞" then
			jns[1] = "随轻拍舞步扭动，犹如飘逸的轻歌，攻击敌方目标，激发友军潜能，提升本回合物理伤害。\n轻拍舞步，攻击敌方单个自标，然后提高所有友方玩家本回合的物理伤害"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2B37D923
			jns[8] = 0x2B37D923
	elseif jn == "翩跃飞舞" then
			jns[1] = "翩髓起舞，随重拍之力攻击敌方四个单位，每次攻击伤害递增，如同舞者之力量汹涌澎湃。\n重拍舞步，对敌方4个单位发动物理攻击，伤害。倍率为80%，每攻击一个目标，后续的伤害增加。"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4345B564
			jns[8] = 0x4345B564
	elseif jn == "谆谆教诲" then
			jns[1] = "和尚的啰嗦中,偶尔也会夹杂蕴含大智慧的教诲。\n对敌方单个目标造成较高的法术伤害。"
			jns[3] = 4
			jns[4] = "45点魔法、20点愤怒"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000405
			jns[8] = 0x00000406
			jns[12] = "冷却8回合"
	elseif jn == "子母神针" then
			jns[1] = "固定伤害攻击2个目标\n#Y固伤伤害数值加成:\n#Y技能等级*2+自身伤害的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
		    jns[3] = 4
		    jns[4] = "35点魔法、30点愤怒"
		    jns[5] = "沉鱼落雁技能达到20级"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000403
			jns[8] = 0x00000404
	elseif jn == "焕生咒" then
			jns[1] = "念动焕生咒语,借力队友的生机,吸纳满血队友的生命力，临时提升自身治疗能力，为友方目标恢复丰盈的气血\n恢复友方目标的气血，施法前会汲取所有满血的队友30点生命值，临时增加治疗能力。"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x51C241BE
			jns[8] = 0x51C241BE
	elseif jn == "燃血术" then
			jns[1] = "以自身鲜血为祭,换取强大的法力。\n消耗气血，强化你的下一个地涌金莲或焕生咒:使目标获得等同于治疗量的护盾值。"
			jns[3] = 66
			jns[4] = "(最大气血×10%)点气血和气血上限"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8BE68718
			jns[8] = 0x8BE68718
	elseif jn == "追魂刺" then
			jns[1] = "以地脉之气为媒介,不仅能够伤人肌体,更能刺穿魂魄\n对敌方单个目标造成固定伤害。"
			jns[3] = 4
			jns[4] = "50点魔法、20点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDBFE0302
			jns[8] = 0xDBFE0302
	------------------------------------------------特效主动技能
	elseif jn == "由己渡人" then
			jns[1] = "复活一名队友; 恢复（“地冥妙法”等级*6）气血 恢复（“地冥妙法”等级*12)临时气血上限。"
			jns[3] = 5
			jns[4] = "当前气血*10%"
			jns[5] = "当前气血≥气血上限*10%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDE58924A
			jns[8] = 0xDE58924A
	elseif jn == "天眼神通" then
			jns[1] = "二郎真君开启天眼,使功法威力大增。\n使用后随机获得以下1到3种效果，持续5回合。(可同时触发多个效果）\n智眼:每合结束时获得1点战意;\n怒眼:惊涛怒、断岳式、翻江搅海、天崩地裂造成的伤害提高\n天眼;暴击几率增加。"
			jns[3] = 66
			jns[4] = "300点魔法、1点战意"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1299A579
			jns[8] = 0x1299A579
			jns[12] = "冷却8回合"
	elseif jn == "敲金击玉" then
			jns[1] = "镇元大仙所创灵宝斋法，以五行炼化仙果,使其涤除污垢,内外晶莹\n物理攻击单个目标，你所有的人参娃娃会参与此次攻击并造成额外伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBF6B4C8C
			jns[8] = 0xBF6B4C8C
	elseif jn == "催化" then
			jns[1] = "强化目标身上来自你的“雾杀”使“雾杀”造成的伤害增加100%(300%);若有风灵,会消耗1层强化所有敌友单位身上来自你的“雾杀“本场战斗中,“雾杀”的基础伤害提高6%，最多60%。(括号内为目标是NPC时的效果）"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xD10DF1DF
			jns[8] = 0xD10DF1DF
	elseif jn == "金击式" then
			jns[1] = "镇元大仙把玩金击子时自创的招式，使用时若有金玉落盈芝声。\n对敌方3个目标发动物理攻击。(对玩家使用时伤害为1）"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x37FCB484
			jns[8] = 0x37FCB484
	elseif jn == "百草诀" then
			jns[1] = "感召大地生灵，汇聚百草精华、化作神秘药灵助战。药灵呈红、蓝、黄三色,各具神奇功效。\n从自然中凝萃10颗药灵,药灵将在红色、蓝色，黄色中随机。"
			jns[3] = 66
			jns[4] = "50点魔法法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x7D0D0DAB
			jns[8] = 0x7D0D0DAB
	elseif jn == "幼狮之搏" then-------没写
			jns[1] = "宠兽专用狮搏，某些门派特殊技能"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1C454D91
			jns[8] = 0x1C454D91
	elseif jn == "鹰击长空" then--未写
			jns[1] = "宠兽专用鹰击，某些门派特殊技能(人数:等级%35，不会超过5个目标)"
			jns[3] = 4
			jns[4] = "30点魔法，攻击多人时消耗增加"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x43CEF766
			jns[8] = 0x43CEF766
	elseif jn == "翩鸿一击" then
			jns[1] = "使用该技能攻击目标，下回合提高自身15%的速度。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x30E001D4
			jns[8] = 0x30E001D4
			jns[12] = "冷却6回合"
	elseif jn == "披坚执锐" then
			jns[1] = "身披坚甲，手执利刃，敌人在追击下无所遁形\n每合随机1种你装备上的追加法术。使用披坚执锐后，视为你装备当回合随机的追加法术。"
			jns[3] = 4
			jns[4] = "随机法术消耗"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x72ED61A1
			jns[8] = 0x72ED61A1
	elseif jn == "六道无量" then---攻击玩家为完成
			jns[1] = "法术驱动的必中单体物理攻击技能,攻击时额外对一个带有尸腐毒的单位起效。\n该技能攻击玩家时,双方防御下降(自身等级*1.6+70)，持续2回合。"
			jns[3] = 4
			jns[4] = "40点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBC2DD56E
			jns[8] = 0xBC2DD56E
	elseif jn == "狂怒" then
			jns[1] = "发动神功,以狂怒之势震慑诸敌,对其造成高额伤害。\n获得与当前变身相同回合的狂怒；造成的物理伤害提高。"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6E34D2AA
			jns[8] = 0x6E34D2AA
	elseif jn == "风雷斩" then
			jns[1] = "风烈雷迅九霄怒，一斩疾霆破惊云天宫弟子能以雷霆之势予以对手沉重一击\n以雷霆之势攻击一个单位"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6D372C69
			jns[8] = 0x6D372C69
	elseif jn == "霹雳弦惊" then
			jns[1] = "天宫雷部的霸道法术，强化你的风雷斩为风雷斩·霹雳轰击对手，惊雷震耳，受之者元气大伤。\n强化你的风雷斩:对主目标额外造成伤害，持续6回合。使用雷怒霆激后会解除此状态"
			jns[3] = 66
			jns[4] = "70点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x58B7E9CB
			jns[8] = 0x58B7E9CB
	elseif jn == "雷怒霆激" then
			jns[1] = "天宫雷部的霸道法术，强化你的风雷斩为风雷斩·霹雳轰击对手，惊雷震耳，受之者元气大伤。\n强化你的风雷斩:额外攻击2个单位，持续6回合。使用霹雳弦惊解除此状态。"
			jns[3] = 66
			jns[4] = "70点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6009D906
			jns[8] = 0x6009D906
	elseif jn == "五雷正法" then
			jns[1] = "浩然真气，感通天地。行持此符，可驱雷电。\n消耗所有雷法加持，使用五雷咒攻击目标"
			jns[3] = 4
			jns[4] = "150点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xE971301E
			jns[8] = 0xE971301E
	elseif jn == "蛊树迷瘴" then
			jns[1] = "密林有蛊惑众生,朽木吐瘴藏杀气。释放瘴气蔓延，令对手丧魂落魄。\n对敌方5个目标造成法术伤害，有一定几率为目标附加1层“雾杀"
			jns[3] = 4
			jns[4] = "30点魔法*作用人数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4E4ECD7C
			jns[8] = 0x4E4ECD7C
	elseif jn == "剑意莲心" then
			jns[1] = "莲心问剑意如何，五行珠佑便可得。在五行珠的庇佑下念动此咒，博予以对手额外打击。\n消耗所有五行珠，对敌方6个单位发动物理攻击，消耗的五行珠数量越多伤害越高"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDEECD728
			jns[8] = 0xDEECD728
	elseif jn == "雷法崩裂" then
			jns[1] = "道法以气感通，风雷以气动荡，行持此符催动雷霆，可令天地前裂。\n使用五雷咒攻击目标，转化当前的符咒为”雷法崩裂“加持，每转化一枚符咒，五雷正法对主目标造成伤害提高32%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4B145B23
			jns[8] = 0x4B145B23
	elseif jn == "雷法震煞" then
			jns[1] = "真气与天地相合，随窍而发化为光电。行持此符呼召风雷威能震煞天地。\n使用五雷咒攻击目标。转化当前的符咒为“雷法震煞”加持，每转化一枚符咒，五雷正法攻击目标增加1个。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xE2910606
			jns[8] = 0xE2910606
	elseif jn == "雷法坤伏" then
			jns[1] = "燃烧自身气宇，存神运力目出雷电。行持此符降光伏风，倾催四方。\n使用五雷咒攻击目标转化当前的符咒为”雷法坤伏“加持，每转化一枚符咒，五雷正法使随机一个攻击自标受到的物理和法术伤害增加，持续3回合。效果可叠加，但是持续回合不刷新。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x7F38C97C
			jns[8] = 0x7F38C97C
	elseif jn == "千蛛噬魂" then
			jns[1] = "千蛛毒丝、罗网深深。蛛丝布下陷阱，毒素遍布罗网，予以敌人重击。\n对3个目标造成物理伤善;对带有你的“天罗地网“状态的目标适成额外伤害。"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBBC8F2A2
			jns[8] = 0xBBC8F2A2
	elseif jn == "蛛丝缠绕" then
			jns[1] = "牵丝笼网,游蛛缠身。蜘蛛吐丝织造罗网，缠绕包裹猎物。\n攻击单个目标,并对复附加天罗地网”状态，持续4回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4DEF4B05
			jns[8] = 0x4DEF4B05
	elseif jn == "血影蚀心" then
			jns[1] = "尸气蚀心，腐莓沁骨，予以对手毒辣一击。\n对敌方单个目标造成物理伤善，攻击时有几率附加”尸腐毒“状态。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xEE1C323A
			jns[8] = 0xEE1C323A
	elseif jn == "百鬼噬魂" then
			jns[1] = "入骨噬魂,掠心夺魄,给对手造成重创。\n对敌方4个目标成物理伤害，攻击时有几率附加“尸腐毒”状态。"
			jns[3] = 4
			jns[4] = "35点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x35A96711
			jns[8] = 0x35A96711
	-----------------------------------------------------------------------------经脉特效
	elseif jn == "连破" then
			jns[1] = "横扫千军有1%几率不进入休息"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000395
			jns[8] = 0x00000395
	elseif jn == "鞭挞" then
			jns[1] = "荆棘舞会消耗最多3层“风灵，每层风灵增加15%伤害结果。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2AAB3A47
			jns[8] = 0x2AAB3A47
	elseif jn == "佛眷" then
			jns[1] = "活血会使目标受到的治疗量提高30%,持续3回合"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000401
			jns[8] = 0x00000401
	elseif jn == "聚气" then ---和凌波经脉重名
			jns[1] = "每次使用非回复类辅助门派法术时，有15%几率使下一次回复法术效果提升30%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x86873B99
			jns[8] = 0x86873B99
	elseif jn == "自矜" then
			jns[1] = "每次使用单体封印技能失败时，有40%几率获得临时封印能力提升，使得下次单体封印时成功率提高基础值的48%.（总的命中率最高不超过100%，不对一笑倾城首目标有效)。到下一次命中时清空该效果。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x22A77A43
			jns[8] = 0x22A77A43
	elseif jn == "悲恸" then
			jns[1] = "五雷咒对召唤兽造成的伤害提高30%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1D0F8066
			jns[8] = 0x1D0F8066
	elseif jn == "奔雷" then
			jns[1] = "五雷咒额外攻击1个目标，单你的封印命中率下降15%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB490BD29
			jns[8] = 0xB490BD29
	elseif jn == "电芒" then
			jns[1] = "被雷霆万钧击中的目标将被附加’电芒”状态。带有’电芒”的目标再次受到雷霆万钧打击时额外承受8%的伤害，’电芒”持续3回合（不可叠加，可以被刷新）。 自身封印命中率减少15%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x7B970F69
			jns[8] = 0x7B970F69
	elseif jn == "龙骇" then
			jns[1] = "使用龙卷雨击有25%几率使得你下一次龙腾造成的伤害提高20%;你的龙腾有25%几率使得你下一次龙卷雨击造成的伤害提高10%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDFF0E26B
			jns[8] = 0xDFF0E26B
	elseif jn == "魔冥" then
			jns[1] = "每次使用飞砂走石,可以使你下次三昧真火或魔焰滔天造成的伤害提高3%(目标为人物则为9%。持续4回合可叠加4层，层数提升时刷新时间。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8BF70190
			jns[8] = 0x8BF70190
	elseif jn == "金莲" then
			jns[1] = "你的地涌金莲额外作用1%2个单位（“地冥妙法”等级为45%105时)但你造成的固定伤害降低30%。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000398
			jns[8] = 0x00000398
	elseif jn == "风灵" then--状态
			jns[1] = "每偶数回合结束获得1层“风灵。"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4BB78E6D
			jns[8] = 0x4BB78E6D

	------------------------------------------------------------------------------------------------空
	elseif jn == "明光" then
			jns[1] = "你的治疗有18%几率触发暴击，使得技能效果翻倍。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xA2F9E185
			jns[8] = 0xA2F9E185
	elseif jn == "度厄" then---没写效果
			jns[1] = "你的唧唧歪歪和谆谆教诲不会触发法术闪避,但门派法术施加的浇了和“金刚护体、金刚护法、一苇渡江”效果降低50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8E6B4692
			jns[8] = 0x8E6B4692
	elseif jn == "踏歌" then
			jns[1] = "舞步需要遵循音乐的规律在回合数为奇数时，可以使用“重拍”舞步，在回合数为偶数时，可以使用“轻拍“舞步"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x25260F44
			jns[8] = 0x25260F44
	elseif jn == "乐韵" then
			jns[1] = "使用轻拍舞步后，获得“乐韵”，使用重拍舞步可消耗乐韵”使技能伤害提高30%"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xD5669AE4
			jns[8] = 0xD5669AE4
	elseif jn == "咒符" then------状态
			jns[1] = "回合开始时，会随机获得1-5枚符咒，雷法会消耗当前所有符咒来强化你的下一个五雷正法。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000282
			jns[8] = 0x00000282
	elseif jn == "返璞" then
			jns[1] = "作为物理攻击的大师，门派法术造成的物理伤害提高但封印命中率和造成的法术伤害降低。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4C6405CB
			jns[8] = 0x4C6405CB
	elseif jn == "五行珠" then---状态
			jns[1] = "每次使用五行攻击时，获得本次攻击五行对应的五行珠，每种五行最多拥有1枚五行珠。你的门派法术造成的治疗效果减少50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB44BA05E
			jns[8] = 0xB44BA05E
	elseif jn == "龙魂" then
			jns[1] = "每3次成功的施法，使得接下来3回合造成的法术伤害提高3%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8E2CB1FA
			jns[8] = 0x8E2CB1FA
	elseif jn == "骤雨" then
			jns[1] = "每次使用烟雨剑法后都会使你造成的物理伤害和暴击率提高2%,持续3回合，可叠加3层。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB79CC34C
			jns[8] = 0xB79CC34C
	elseif jn == "还丹" then --状态
			jns[1] = "敲金击玉每次攻击后可获得1枚人参娃娃、人参娃娃会在使用敲金击玉时与你一同攻击，额外造成30%伤害。最多持有3枚人参娃娃,持续时间3回合，获得时刷新持续时间"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFF0081A3
			jns[8] = 0xFF0081A3
	elseif jn == "驯兽幼狮" then
			jns[1] = "你的召唤兽会共附加幼狮之搏技能(技能效果等同狮搏)以及鹰击长空技能(技能效果等同鹰击)。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x013D6355
			jns[8] = 0x013D6355
	elseif jn == "狮魂" then
			jns[1] = "你每次使用狮搏后，获得1层“狮魂”使其“幼狮之搏”造成的伤害提高。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x06B6105D
			jns[8] = 0x06B6105D
	elseif jn == "神迷" then
			jns[1] = "成功使用“含情脉脉”和魔音摄魂”封印目标时,吸取4点愤怒。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x6F367EF0
			jns[8] = 0x6F367EF0
	elseif jn == "药灵" then ---状态
			jns[1] = "受药灵亲和消耗药灵释放的法术会受治疗能力的加成(包含恢复、护盾、增伤效果）、但你造成的法术伤害降低50%。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFB48D5CC
			jns[8] = 0xFB48D5CC
	elseif jn == "吞山" then
			jns[1] = "你的裂石、断岳势和天崩地裂增加5%的暴击几率。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x70FDB194
			jns[8] = 0x70FDB194
	elseif jn == "饮海" then
			jns[1] = "你的浪涌、惊涛怒和翻江搅海忽略目标一定的防御。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x40FB7647
			jns[8] = 0x40FB7647
	elseif jn == "超级战意" then --状态
			jns[1] = "获得战意时:有20%的几率获得1点超级战意，最多持有3点超级战意;每点消耗的超级战意,将提高此次攻击20%的伤害。"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4F57FF06
			jns[8] = 0x4F57FF06
	elseif jn == "战意" then--状态
			jns[1] = "用于发动门派法术。战意点数将提高自己的伤害力。战意最多累计6点，战斗中死亡时减半。"
			jns[3] = 8
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000402
			jns[8] = 0x00000402
	elseif jn == "裂魂" then
			jns[1] = "追魂刺目标为非玩家单位时,造成额外伤害;目标为玩家单位击出目标魂魄。下次使用追魂刺或夺命咒会击散离体魂魄对目标造成额外伤害"
			jns[3] = 8
			jns[6] = "物品图标.wdf"
			jns[7] = 0x49D3C846
			jns[8] = 0x49D3C846
	---------------------------------------------------------------------------------------------------------------------------奇经八脉主动技能
	elseif jn == "亢龙归海" then
			jns[1] = "矫健的神龙翻腾四海的英姿很少有人目睹，而之后更无人能够道出其中的神威。\n使用龙腾连续攻击2次目标，每次造成龙腾伤害的95%，使用后息1回合。"
			jns[3] = 4
			jns[4] = "200点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xCE07792D
			jns[8] = 0xCE07792D
			jns[12] = "冷却6回合"
	elseif jn == "魔焰滔天" then
			jns[1] = "为了能给敌人造成更大的伤害，的弟子是不怕赌上自己运气的。\n使用法术攻击目标，70%几率造成三昧真火法术伤害×175%，30%几率造成三昧真火法术伤害×25%。不受佛法无边影响。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x525B9DB0
			jns[8] = 0x525B9DB0
			jns[12] = "冷却6回合，战斗开始时具有3回合冷却"
	elseif jn == "风卷残云" then
			jns[1] = "神木林在觉醒，风在咆哮！大风带着神木林弟子的怒意无情的打击面前的敌人。\n消耗所有风灵使用一次落叶萧萧，伤害结果提高（消耗风灵数×16%)。该技能不触发“重光”，但佩戴“月影”时额外提高12%伤害并消耗1点灵气。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x3778487D
			jns[8] = 0x3778487D
			jns[12] = "冷却6回合，战斗开始时具有3回合冷却却"
	elseif jn == "风雷韵动" then
			jns[1] = "以法术攻击敌方单体目标，造成110%的法术伤害。对带有“电芒”的单位额外提高40%的伤害。"
			jns[3] = 4
			jns[4] = "60点魔法，10点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x169010C9
			jns[8] = 0x169010C9
	elseif jn == "长驱直入" then
			jns[1] = "替换天赋：翩鸿一击:使用该技能攻击时,目标无法被保护。\n伤害结果为普通攻击的110%；同时60%几率对目标附加“重创”\n状态:回复效果降低30%并且受到施法者的伤害增加10%。法术驱动的物理攻击,持续2回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xAB6EA7B4
			jns[8] = 0xAB6EA7B4
			jns[12] = "冷却6回合"
	elseif jn == "天神怒斩" then
			jns[1] = "天神盛怒，以开天辟地之势，挥刀怒斩：\n1.增加25%暴击几率、忽略目标25%防御发动一次物理攻击，\n命中后驱散目标随机一个增益状态。\n2.若自身战意为1，造成额外50%伤害，否则造成25%额外伤害。\n3.每次使用后本场战斗该技能伤害永久提高25%（目标为NPC时为50%）。\n4.使用天崩地裂和翻江搅海会减少这个技能1回合的冷却回合。"
			jns[3] = 4
			jns[4] = "300点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xA8AF3DC0
			jns[8] = 0xA8AF3DC0
			jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
	elseif jn == "天命剑法" then
			jns[1] = "率意而行、道法自然，在五庄弟子出手之际，他自身也道不出这—招之中蕴含了多少剑意。或许，只有冥冥之中的三清可知吧？\n以无人能够预知的剑术攻击目标，对其随机发动1~7次物理攻击。\n使用后下回合不能行动。"
			jns[3] = 4
			jns[4] = "（最大气血的2%×攻击次数）点气血"
			jns[5] = "当前气血比例≥70%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x30EA31AF
			jns[8] = 0x30EA31AF
			jns[12] = "冷却4回合"
	elseif jn == "鸿渐于陆" then
			jns[1] = "对一伤其十指，不如断其一指，必要的时刻可以将伤害凝聚起来，给予敌方一次致命的攻击。附加（武器伤害×130%）的伤害，对敌方单体进行攻击，使目标100%几率中暗器毒"
			jns[3] = 4
			jns[4] = "100点魔法血"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x18D93692
			jns[8] = 0x18D93692
			jns[12] = "冷却4回合"
	elseif jn == "百爪狂杀" then
			jns[1] = "【被动】你被封印的几率增加20%\n法术驱动的必中物理攻击，可攻击4个目标；每增加1个攻击目标，对所有目标的伤害结果降低10%。作用目标按速度排序选择。如果你的武器带有“必中”特效，则提升10%(3%)的伤害结果。（括号内为目标为NPC时的效果）"
			jns[3] = 4
			jns[4] = "35点魔法*目标数"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8FCE05BE
			jns[8] = 0x8FCE05BE
	elseif jn == "顺势而为" then
			jns[1] = "精于封印的方寸弟子可以耗费一定的愤怒值对目标施加强大的法力，100%封印目标的法术能力，封印效果持续2回合。"
			jns[3] = 4
			jns[4] = "60点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x9E6FFF66
			jns[8] = 0x9E6FFF66
			jns[12] = "冷却6回合"
	elseif jn == "落花成泥" then
			jns[1] = "靡靡之音进入敌人耳际，使目标下回合彷徨不知所措、额外受到24%伤害，同时100%几率无法进行除灵宝以外的任何行动。（不受化生寺门派特色影响)"
			jns[3] = 4
			jns[4] = "20点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4D94B673
			jns[8] = 0x4D94B673
			jns[12] = "冷却4回合"
	elseif jn == "妖风四起" then
			jns[1] = "驱动妖风封印敌人，使其不能使用法术，持续2回合。成功率与成功率上限为（夺魄令成功率+40%）；该封印不能被水清、冰清、玉清、晶清解除（对NPC时该效果无效)"
			jns[3] = 4
			jns[4] = "（当前气血×40%）点气血，100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8295E360
			jns[8] = 0x8295E360
			jns[12] = "冷却4回合"
	elseif jn == "雷浪穿云" then
			jns[1] = "当那天地间卷起的白浪与电闪中的云彩揉成一片，任谁都无力承担神龙见首不见尾的后续打击。对目标使用后，目标在5回合内受到的所有法术伤害提高30%，使用法术技能消耗魔法增加(100%+30)点。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x77EC444B
			jns[8] = 0x77EC444B
	elseif jn == "凋零之歌" then
			jns[1] = "歌声飘进敌人的耳中，颤动着敌人心窝，在无形中侵袭着敌阵的斗志，埋下毁灭之种。消耗所有风灵，获得下述效果：\n1.使目标接下来2回合受到的法术伤害增加16+(2×消耗风灵层数)%。\n2.使随机敌方单位共计获得(3+消耗风灵层数×0.5)层“雾杀”效果。\n3.该技能不触发“重光”。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x281E732A
			jns[8] = 0x281E732A
			jns[12] = "冷却8回合"
	elseif jn == "画地为牢" then
			jns[1] = "天宫经脉介绍：天宫弟子随手布下的囚牢，却是无数穷凶极恶之徒的饮恨之所。对敌方使用后，降低敌方1个单位18%的抵抗封印能力以及24%的封印能力，持续5回合"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBAF731FA
			jns[8] = 0xBAF731FA
			jns[12] = "冷却8回合"
	elseif jn == "碎玉弄影" then
			jns[1] = "“宁为玉碎，不为瓦全”，又有多少敌方可以从女儿村弟子曼妙的舞姿身影中体味那一份决绝呢？连续对敌方使用2次似玉生香。"
			jns[3] = 4
			jns[4] = "40点愤怒,技能消耗"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x347D755D
			jns[8] = 0x347D755D
			jns[12] = "冷却5回合"
	elseif jn == "妙悟" then
			jns[1] = "回复目标一定气血（效果与等级、治疗能力相关)"
			jns[3] = 5
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x2F3B9A81
			jns[8] = 0x2F3B9A81
			jns[12] = "冷却2回合"
	elseif jn == "清风望月" then
			jns[1] = "五庄观的弟子可以于乾坤腾挪之中领悟妙法，吸收2个队友身上的封印效果，但会使自己进入疯狂状态2回合。"
			jns[3] = 5
			jns[4] = "40点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x8FE977C4
			jns[8] = 0x8FE977C4
			jns[12] = "冷却4回合"
	elseif jn == "钟馗论道" then
			jns[1] = "为自己附加“钟馗论道”状态，获得下述效果，持续5回合：\n1.五雷咒伤害提高70%；\n2.该效果不会被驱散；\n3.回合结束时减少自身“锢魂术”“死亡禁锢”1回台持续时间。"
			jns[3] = 66
			jns[4] = "80点魔法法"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xB7CDB6AA
			jns[8] = 0xB7CDB6AA
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "渡劫金身" then
			jns[1] = "进给目标附加一个状态，持续2个回合或目标死亡。状态消失时，恢复目标一定气血、气血上限(效果与等级、治疗能力相关)。"
			jns[3] = 5
			jns[4] = "10点愤怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x3819B112
			jns[8] = 0x3819B112
			jns[12] = "冷却4回合"
	elseif jn == "诸天看护" then
			jns[1] = "虔诚的信仰会带来更强大的力量。移除目标身上的来自于你的“金刚护法、金刚护体、一苇渡江”效果，增加目标单位1.5%×(1+被移除的状态数量)的物法伤害，持续到战斗结束。（最多增加12%)"
			jns[3] = 5
			jns[4] = "100点魔法，10点愤怒怒"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xED073209
			jns[8] = 0xED073209
			jns[12] = "冷却8回合"
	elseif jn == "真君显灵" then
			jns[1] = "敲动战鼓，一鼓作气拿下敌人。消耗自身所有（≥1）战意进入“真君显灵”状态，持续3回合（不可驱散）：使自己造成的物理伤害增加(20%×使用时消耗战意数)；消耗的超级战意使该效果翻倍。回合结束时获得1点战意"
			jns[3] = 66
			jns[4] = "100点魔法，自身所有战意"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4017404F
			jns[8] = 0x4017404F
			jns[12] = "冷却8回合"
	elseif jn == "波澜不惊" then
			jns[1] = "移普陀山弟子由于精通五行造化，方可布下这吸收一切伤害的结界阵法。为目标吸收受到的前4次攻击的伤害，持续2回合；并且将吸收的伤害转化为目标的当前气血回复，最高可吸收（普度众生首回合治疗量×2)点气血伤害。这亦是五行学派的不传之秘，只有核心弟子方能习得。"
			jns[3] = 5
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xAED0F931
			jns[8] = 0xAED0F931
	elseif jn == "莲心剑意" then
			jns[1] = "普陀山的弟子情系众生、虔心不染，如一朵莲花绽放在凡尘中。但江湖险恶、妖风魔雨，为了护佑苍生，她们也不得不常怀剑意，惩恶除奸。使用此法术后进入进攻状态，增加（法术修炼等级×3%）的固定伤害结果（只对首目标有效）， 降低10%的回复效果。(再次使用此技能进入正常状态)"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xC2D6BBD3
			jns[8] = 0xC2D6BBD3
	elseif jn == "同舟共济" then
			jns[1] = "为目标友方分担前6次受到的伤害，持续到本回合结束。目标友方承受25%伤害，你承受25%伤害。"
			jns[3] = 5
			jns[4] = "200点魔法"
			jns[5] = "当前气血比例≥50%"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x57365436
			jns[8] = 0x57365436
			jns[12] = "冷却4回合"
	elseif jn == "心随意动" then
			jns[1] = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另一个世界。激活后（再次使用关闭此状态），持续8回合后自动关闭。\n清心羽客:增加（七星遁等级×2.2）的封印命中等级\n乾坤力士:持续回合内增加（七星遁等级×2.2)的伤害力。"
			jns[3] = 66
			jns[4] = "30点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xFD5AC0B0
			jns[8] = 0xFD5AC0B0

	elseif jn == "莲花心音" then
			jns[1] = "普陀弟子以莲花苞为躯，引魂入体，则可以复活在战斗中死亡的鬼魂幻兽。复活场上一个处于死亡状态的鬼魂宠，被复活目标获得60%的气血上限与当前48%的魔法。"
			jns[3] = 5
			jns[4] = "60点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x07DEBF4F
			jns[8] = 0x07DEBF4F

	----------------------------------------------------------------------------------------空
	elseif jn == "毒萃" then
			jns[1] = "使用后你的蛊树迷瘴附加“雾杀”的几率提高100%，持续5回合（包括当前回合）。"
			jns[3] = 66
			jns[4] = "300点魔法，1点风灵"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x4935E53B
			jns[8] = 0x4935E53B
	elseif jn == "电光火石" then
			jns[1] = "使使用后同时获得“霹雳弦惊”和“雷怒霆激”状态。"
			jns[3] = 66
			jns[4] = "140点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x0A9E4158
			jns[8] = 0x0A9E4158
			jns[12] = "冷却9回合，死亡后冷却重置为9回合"
	elseif jn == "魍魉追魂" then
			jns[1] = "地府弟子可以招来地狱深处的魑魅魍魉协助队友进行攻击。对本方一个死亡的单位附加“魍魉追魂”\n造成的物理法术伤害提高(4+2×N)%,N为本方带有“魍魉追魂”的单位数，持续到战斗结束（不可驱散）。"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xDAA0F7D4
			jns[8] = 0xDAA0F7D4
			jns[12] = "冷却4回合"
	elseif jn == "噬毒" then
			jns[1] = "净化一个敌方单位带有的“尸腐毒”，受到（人物等级×10）点伤害，但是你的下一个六道无量造成伤害提高60%，下一个百爪狂杀造成伤害提高60%；若目标不带有“尸腐毒”效果，你随机获得其中一个增益状态且不会受到伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0xBF44D568
			jns[8] = 0xBF44D568
			jns[12] = "冷却8回合"
	elseif jn == "雷霆汹涌" then
			jns[1] = "对6个目标进行法术攻击。"
			jns[3] = 4
			jns[4] = "35点魔法*作用人数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000153
			jns[8] = 0x00000153
	elseif jn == "最佳搭档" then-------主动没写
			jns[1] = "消耗1层“狮魂”，对一个目标发动一次物理攻击，这次攻击无法被保护。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[5] = "“变身”状态，“狮魂”层数≥1"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000379
			jns[8] = 0x00000379
			jns[12] = "冷却8回合"
	elseif jn == "困兽之斗" then-------主动没写
			jns[1] = "进行一次猛烈的物理攻击，伤害倍率为110%。若处于“狂怒”状态，有50%的几率额外攻击一次。若击倒了玩家单位，则获得5回合的“狂怒”状态。"
			jns[3] = 4
			jns[4] = "10%当前气血、100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000149
			jns[8] = 0x00000149
			jns[12] = "冷却8回合"
	elseif jn == "威仪九霄" then
			jns[1] = "被动】每回合开始时，威仪九霄的伤害倍率增加3%，魔法消耗增加100点（最多叠加30次)\n对所有目标造成10%的物理伤害，使用后清空叠加次数。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000292
			jns[8] = 0x00000292
			jns[12] = "冷却6回合,战斗开始具有3回合冷却"
	elseif jn == "牵魂蛛丝" then
			jns[1] = "对目标附加持续1回合的“天罗地网”状态，随后对所有带有你“天罗地网”的单位发动1次攻击。"
			jns[3] = 4
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000233
			jns[8] = 0x00000233
			jns[12] = "冷却8回合"
	elseif jn == "绝处逢生" then
			jns[1] = "恢复自身损失的50%气血及自身损失的50%气血上限，速度增加10%，持续3回合。（不可驱散)"
			jns[3] = 5
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000129
			jns[8] = 0x00000129
			jns[12] = "冷却5回合,战斗开始时具有5回合冷却"
	elseif jn == "耳目一新" then
			jns[1] = "移除当前天眼神通的增益效果，并再次使用天眼神通，至少获得2种效果并且会优先获得不同的增益效果。"
			jns[3] = 66
			jns[4] = "300点魔法、1点战意法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000048
			jns[8] = 0x00000048
			jns[12] = "冷却24回合"
	elseif jn == "五雷挪移" then
			jns[1] = "进入雷法真身，将你的“雷法”强化光“五雷正法”：使用雷法时，五雷咒会消耗已有的雷法强化效果，再转化当前符咒，持续10回合"
			jns[3] = 66
			jns[4] = "50点魔法法"
			jns[5] = "仅能在5枚符咒时使用"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000302
			jns[8] = 0x00000302
	elseif jn == "潜龙在渊" then
			jns[1] = "移除自身“龙魂”和“龙骇”状态，每个被移除状态使你获得1层以下对应增益，持续到战斗结束：\n龙魂：造成的法术伤害提高1%。\n龙骇：对应被增益的龙腾或龙卷雨击伤害提高2%。(不可驱散)"
			jns[3] = 66
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000235
			jns[8] = 0x00000235
			jns[12] = "冷却8回合"
	elseif jn == "无赦咒令" then
			jns[1] = "对目标发起物理攻击，伤害为普通攻击的110%，随机驱散目标1个增益状态，如果目标带毒类异常，则驱散2个。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000300
			jns[8] = 0x00000300
	elseif jn == "生杀予夺" then
			jns[1] = "对一个目标发起一次物理攻击，伤害为普通攻击的230%：\n1.若目标带毒，此次攻击暴击伤害倍率增加60%；\n2.队伍中只有一个 弟子时：回合结束时额外减少（敌方场上尸腐毒数量×2）的冷却回合。"
			jns[3] = 4
			jns[4] = "100点魔法血"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000256
			jns[8] = 0x00000256
			jns[12] = "冷却36回合"
	elseif jn == "雷法翻天" then
			jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对召唤兽造成的伤害提高35%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000151
			jns[8] = 0x00000151
	elseif jn == "雷法倒海" then
			jns[1] = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对玩家单位造成的伤害提高8%。"
			jns[3] = 4
			jns[4] = "30点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000150
			jns[8] = 0x00000150
	elseif jn == "秘传三昧真火" then
			jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对单个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与法术伤害和目标当前气血值有关。"
			jns[3] = 4
			jns[4] = "60点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000194
			jns[8] = 0x00000194
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "秘传飞砂走石" then
			jns[1] = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对多个敌方目标造成极高的法术伤害，有几率使目标直接阵亡且无法神佑，几率与法术伤害和目标当前气血值有关。"
			jns[3] = 4
			jns[4] = "60点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000193
			jns[8] = 0x00000193
			jns[12] = "冷却8回合，战斗开始时具有4回合冷却"
	elseif jn == "摧枯拉朽" then
			jns[1] = "替换天赋：翩鸿一击:对目标发动一次必定触发套装追加法术的物理攻击。"
			jns[3] = 4
			jns[4] = "300点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000023
			jns[8] = 0x00000023
			jns[12] = "冷却30回合,战斗开始具有15回合冷却。"
	elseif jn == "披挂上阵" then
			jns[1] = "连续攻击同一个目标3次，每次攻击均有几率触发套装追加法术。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000219
			jns[8] = 0x00000219
			jns[12] = "冷却10回合,战斗开始具有5回合冷却 "
	elseif jn == "绝命毒牙" then
			jns[1] = "对目标发动一次致命攻击。\n1.对目标造成150%的伤害；\n2.激发目标身上的“天罗地网”状态， 提高（天罗地网剩余回合数×50%)的伤害，使用后休息1回合。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000131
			jns[8] = 0x00000131
			jns[12] = "冷却10回合, 战斗开始时具有5回合冷却"
	-----女儿村改版的技能
	elseif jn == "嫣然曼舞" then
			jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击不增加目标的愤怒，且减少目标8点愤怒。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000322
			jns[8] = 0x00000322
	elseif jn == "惊鸿起舞" then
			jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，首目标的伤害提高50%(10%)。（括号里为目标为NPC时的效果）"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000115
			jns[8] = 0x00000115
	elseif jn == "风回旋舞" then
			jns[1] = "轻拍舞步，攻击敌方单个目标，本次攻击有50%几率额外造成50%伤害。"
			jns[3] = 4
			jns[4] = "50点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000056
			jns[8] = 0x00000056
	elseif jn == "映日妙舞" then
			jns[1] = "重拍舞步，对敌方4个单位发动物理攻击，伤害结果为普通攻击的80%，受到你的伤害的敌人本回合对你造成的伤害降低15%"
			jns[3] = 4
			jns[4] = "30点魔法*目标数"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000337
			jns[8] = 0x00000337
	elseif jn == "余韵索心" then
			jns[1] = "余韵萦心，最完美的谢幕：\n1.仅能在“重拍”使用，攻击敌方单个目标，伤害倍率为220%，使用后进入休息状态。\n2.若学习了“天籁”，乐韵提高伤害的效果增加至50%。\n3.若学习了“即兴”，该技能可在“轻拍”起舞\n4.若学习了“夺目”，使用技能前会先将“夺目”转化为“返场”，持续回合与夺目层数相同。\n返场回合内，使用该技能不会进入休息状态但也不再会获得“夺目”，且可无视音律使用。"
			jns[3] = 4
			jns[4] = "100点魔法"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000343
			jns[8] = 0x00000343
     elseif jn == "百草神木复苏" then-------------------------神木林
			jns[1] = "复活所有队友并恢复全体气血和气血上限。红黄蓝灵药各5颗"
			jns[3] = 66
			jns[4] = "300点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x1A899ACD
			jns[8] = 0x1A899ACD
	elseif jn == "百草复苏" then
			jns[1] = "复活队友并恢复气血和气血上限。红黄蓝灵药各1颗"
			jns[3] = 5
			jns[4] = "150点魔法"
			jns[6] = "物品图标.wdf"
			jns[7] = 0x9769021C
			jns[8] = 0x9769021C
    elseif jn == "百草古树长青" then
			jns[1] = "为友方单位回复（万灵诸念×8+治疗能力×2）的气血，并施加等值的护盾。"
			jns[3] = 5
			jns[4] = "100点魔法，红黄蓝药灵各1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000137
			jns[8] = 0x00000137
			jns[12] = "冷却10回合"
	elseif jn == "百草十香" then
			jns[1] = "解除友方目标酒类异常状态"
			jns[3] = 5
			jns[4] = "50点魔法，红色药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
	elseif jn == "百草定神" then
			jns[1] = "解除友方目标经脉产生的异常状态。"
			jns[3] = 5
			jns[4] = "50点魔法，蓝色药灵1颗"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
     elseif jn == "百草红雪" then
			jns[1] = "解除友方目标毒类异常状态。"
			jns[3] = 5
			jns[4] = "50点魔法，黄色药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000158
			jns[8] = 0x00000158
     elseif jn == "百草回春龙沙" then
			jns[1] = "解除全体友方目标非经脉、非封类、非酒类、非毒类的常规异常状态"
			jns[3] = 5
			jns[4] = "100点魔法，红黄蓝药灵1颗。"
			jns[6] = "经脉修复.wdf"
			jns[7] = 0x00000122
		    jns[8] = 0x00000122
--九黎城
	elseif jn == "九黎战歌" then
			jns[1] = "战鼓坚将，战魂不息，九黎之歌荡碲天地，激昂族人之志。效果：提高角色的气血"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000717  ---大
			jns[8] = 0x10000718
	elseif jn == "魂枫战舞" then
			jns[1] = "魂枫翩扦，弈弈如战，英气磅礴，永不息止。 效果：提高角色的伤害"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000714  ---大
			jns[8] = 0x10000715
	elseif jn == "兵铸乾坤" then
			jns[1] = "九黎魔息，燎天之焰，铸魂成兵。乾坤在握。效果：提高角色的灵力"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000750  ---大
			jns[8] = 0x10000751
	elseif jn == "燃铁飞花" then
			jns[1] = "战意如火，叱咤生花，九黎之子，铁士无畏。效果：提高角色的命中"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000732  ---大
			jns[8] = 0x10000733
	elseif jn == "战火雄魂" then
			jns[1] = "九黎之魂，犹燎原之火，燃万丈烈焰，直胜利之巅。效果：提高角色的防御"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000746 ---大
			jns[8] = 0x10000747
	elseif jn == "魔神降世" then
			jns[1] = "聆听兵主密命，得赐魔神之力，战无不胜，天地可征。效果：提高角色的魔法"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000724  ---大
			jns[8] = 0x10000725
	elseif jn == "风行九黎" then
			jns[1] = "风所行处，九黎无阻，越古穿今，无迹不至。效果：提高角色的速度"
			jns[3] = 8
			jns[6] = "yjlsc.wdf"
			jns[7] = 0x10000756  ---大
			jns[8] = 0x10000757


	elseif jn == "黎魂" then
			jns[1] = "每回合可以释放2-3个师门技能。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000015
			jns[8] = 0x10000016
	elseif jn == "战鼓" then
			jns[1] = "使用师门技能攻击敌人时会累加连击值，连击值越大，下回合离魂触发3个技能概率越高。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000017
			jns[8] = 0x10000018
	elseif jn == "怒哮" then
			jns[1] = "使用一斧开天后如果目标没用处于浮空状态。45%概率获得怒哮，下一次使用一斧开天和三荒尽灭令目标进入浮空成功率大幅增加，当使用一斧开天或三荒尽灭令目标成功浮空时。移除该效果，自身到底时移除该效果。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000019
			jns[8] = 0x10000020
	elseif jn == "炎魂" then
			jns[1] = "属性点加成统一按照魔族成长。与玩家战斗时，使用师门技能会临时将自身防御的5%-10%转为伤害力。"
			jns[3] = 8
			jns[5] = "九黎战歌技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000021
			jns[8] = 0x10000022
	elseif jn == "枫影二刃" then
			jns[1] = "战歌鸣。怒啸起，枫林迎战舞，英魂影重重。n#Y对敌方单个目标连续发动2次物理攻击，使用后自己有概率获得怒啸。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "魂枫战舞技能达到15级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000023
			jns[8] = 0x10000024
	elseif jn == "一斧开天" then
			jns[1] = "一斧开天，气魄乾坤，以往昔之魄，凝今时之至。\n#Y对敌方单个目标连续发动2次物理攻击，使用后有概率令目标进入浮空状态，持续到你的行动结束。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "兵铸乾坤技能达到50级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000027
			jns[8] = 0x10000028
	elseif jn == "三荒尽灭" then
			jns[1] = "横空霹雳。惊三荒。煞四野。昭吾九黎之威。\n#Y对敌方3个目标发动物理攻击，并令所有目标有概率进入浮空状态，持续到你的行动结束。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "燃铁飞花技能达到30级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000025
			jns[8] = 0x10000026
	elseif jn == "铁火双扬" then
			jns[1] = "炼铁之势，破云千里，战魄凌空，独步天下。\n#Y令敌方2个目标浮空。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "燃铁飞花技能达到30级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000025
			jns[8] = 0x10000026
			jns[12] = "8回合"
	elseif jn == "铁血生风" then
			jns[1] = "铁血凝咦，颊风而起。敌逢吾威，食尘饮悔。\n#Y对敌人单个目标发动物理攻击，如果目标处于浮空状态，额外发动1-2次物理攻击。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "战火雄魂技能达到50级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000029
			jns[8] = 0x10000030
	elseif jn == "力劈苍穹" then
			jns[1] = "魔神垂止，上古魔息浩若狂澜。兵主赐威，穹顶之下唯吾独行。\n#Y对敌方全部处于浮空状态的目标连续发动2-3次物理攻击，然后取消全部目标的浮空状态。"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[5] = "魔神降世技能达到50级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000031
			jns[8] = 0x10000032
	elseif jn == "故壤归心" then
			jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
			jns[3] = 0
			jns[4] = "10点气血、10点魔法"
			jns[5] = "风行九黎技能达到1级"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000033
			jns[8] = 0x10000034
	elseif jn == "魔神之刃" then--写完ok
			jns[1] = "使用一次特殊的力辟苍穹，造成的伤害提高10%并且暴击伤害倍率增加100%，但仅作用1个浮空目标。（战斗开始时具有2回合冷却）"
			jns[3] = 4
			jns[4] = "20点魔法"
			jns[6] = "jmtb.wdf"
			jns[7] = 0x10000071
			jns[8] = 0x10000072
			jns[12] = "8回合"
   elseif jn == "偷龙转凤" then
		jns[1] = "对单个目标造成10%当前气血,并恢复自己目标损失的气血,使用偷龙转凤后本方所有单位将免除治疗削弱,持续3回合。"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xC3BF2DE7
		jns[8] = 0xC3BF2DE7
		jns[12] = "5回合"








	end
	return jns
end