--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2025-08-12 18:47:50
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
五宝名称={"金刚石","定魂珠","夜光珠","避水珠","龙鳞"}
随机灵饰={"手镯","佩饰","戒指","耳饰"}
幻化属性值={"伤害","防御","气血","速度","法术伤害","抗封印等级","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
幻化战斗属性={"抗封印等级","法术伤害","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
灵饰属性={}
灵饰属性.手镯={主属性={"封印命中等级","抵抗封印等级"},副属性={"气血回复效果","气血","防御","抵抗封印等级","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}
灵饰属性.佩饰={主属性={"速度"},副属性={"气血回复效果","气血","防御","抵抗封印等级","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}
灵饰属性.戒指={主属性={"伤害","防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}
灵饰属性.耳饰={主属性={"法术伤害","法术防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}
灵饰战斗属性={"气血回复效果","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级","封印命中等级","抵抗封印等级","固定伤害","法术伤害","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力"}
灵饰正常属性={"伤害","防御","气血","速度"}
--0914灵饰属性


-- 灵饰强化={
--   伤害=4
--   ,防御=8
--   ,气血=28
--   ,速度=3
--   ,格挡值=8
--   ,法术伤害=4
--   ,法术防御=8
--   ,治疗能力=3
--   ,固定伤害=4
--   ,狂暴等级=3
--   ,穿刺等级=4
--   ,法术伤害结果=3
--   ,法术暴击等级=4
--   ,物理暴击等级=4
--   ,气血回复效果=4
--   ,封印命中等级=4
--   ,抵抗封印等级=8
--   ,抗法术暴击等级=8
--   ,抗物理暴击等级=8
-- }


灵饰属性.基础={
    气血={[160]={a=120,b=180},[140]={a=98,b=147},[120]={a=84,b=126},[100]={a=70,b=105},[80]={a=56,b=84},[60]={a=42,b=63},[0]=28}
    ,伤害={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,防御={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=8}
    ,速度={[160]={a=28,b=40},[140]={a=20,b=30},[120]={a=18,b=27},[100]={a=16,b=24},[80]={a=14,b=21},[60]={a=12,b=18},[0]=3}
    ,格挡值={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=8}
    ,固定伤害={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,法术伤害={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,法术防御={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=8}
    ,治疗能力={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=3}
    ,狂暴等级={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=3}
    ,穿刺等级={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,法术暴击等级={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,物理暴击等级={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,法术伤害结果={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=3}
    ,气血回复效果={[160]={a=20,b=30},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9},[0]=4}
    ,封印命中等级={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=4}
    ,抵抗封印等级={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=4}
    ,抗法术暴击等级={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=8}
    ,抗物理暴击等级={[160]={a=35,b=60},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18},[0]=8}
}

打造属性={
          命中={[0]={10,22},[10]={45,62},[20]={80,109},[30]={115,157},[40]={150,205},[50]={185,252},[60]={220,300},[70]={255,347},[80]={290,395},[90]={325,443},[100]={360,491},[110]={395,538}, [120]={430,586},[130]={465,634},[140]={500,682},[150]={535,729},[160]={571,777}},
          伤害={[0]={10,16},[10]={40,56},[20]={70,97},[30]={100,137},[40]={130,178},[50]={160,218},[60]={190,259},[70]={220,300},[80]={250,341},[90]={280,382},[100]={310,423},[110]={340,464},[120]={370,505},[130]={400,546},[140]={430,586},[150]={460,627},[160]={490,667}},
          魔法={[0]={5,7},[10]={15,19},[20]={25,33},[30]={35,47},[40]={45,60},[50]={55,75},[60]={65,88},[70]={75,102},[80]={85,116},[90]={95,129},[100]={105,143},[110]={115,156},[120]={125,170},[130]={135,184},[140]={145,197},[150]={155,211},[160]={163,224}},
          防御={[0]={5,6},[10]={10,13},[20]={15,19},[30]={20,27},[40]={25,33},[50]={30,40},[60]={35,47},[70]={40,54},[80]={45,60},[90]={50,68},[100]={55,74},[110]={60,81},[120]={65,88},[130]={70,95},[140]={75,101},[150]={80,109},[160]={84,115},
                衣服={[0]={10,19},[10]={25,39},[20]={40,50},[30]={55,74},[40]={70,95},[50]={85,115},[60]={100,136},[70]={115,156},[80]={130,177},[90]={145,197},[100]={160,218},[110]={175,238},[120]={190,259},[130]={205,279},[140]={220,300},[150]={235,320},[160]={249,340}}
            },
          灵力={[0]={5,12},[10]={17,26},[20]={29,40},[30]={41,57},[40]={53,74},[50]={65,88},[60]={77,105},[70]={89,120},[80]={101,137},[90]={113,153},[100]={125,170},[110]={137,186},[120]={149,202},[130]={161,219},[140]={173,235},[150]={185,252},[160]={196,267}},
          敏捷={[0]={5,7},[10]={8,11},[20]={11,15},[30]={14,19},[40]={17,23},[50]={20,27},[60]={23,31},[70]={26,35},[80]={29,39},[90]={32,43},[100]={35,47},[110]={38,51},[120]={41,55},[130]={44,59},[140]={47,63},[150]={50,67},[160]={55,71}},
          气血={[0]={10,14},[10]={30,40},[20]={50,68},[30]={70,95},[40]={90,122},[50]={110,149},[60]={130,177},[70]={150,204},[80]={170,231},[90]={190,258},[100]={210,286},[110]={230,313},[120]={250,341},[130]={270,368},[140]={290,395},[150]={310,423},[160]={329,449}},
      }


    -- 洪荒力魄={描述="物伤结果提高5%",部位="所有部位",限制="无"},
    -- 太初神念={描述="法伤结果提高5%",部位="所有部位",限制="无"},
    -- 鸿蒙元魂={描述="固伤结果提高5%",部位="所有部位",限制="无"},
    -- 无极命源={描述="治疗结果提高5%",部位="所有部位",限制="无"},
    -- 不灭金身={描述="物伤结果消弱5%",部位="所有部位",限制="无"},
    -- 法天象地={描述="法伤结果削弱5%",部位="所有部位",限制="无"},
    -- 道法自然={描述="技能连击提高5%",部位="所有部位",限制="无"},
    -- 超然物外={描述="固伤结果消弱5%",部位="所有部位",限制="无"},
    -- 无相法门={描述="封印几率提高7%",部位="所有部位",限制="无"},
    -- 飞天遁地={描述="抗封几率提高7%",部位="所有部位",限制="无"},
    -- 兽语御灵={描述="召唤兽造成的物理、法术伤害提高10%",部位="头盔|项链",限制="无"},
    -- 奇经山海={描述="对召唤兽造成的物理、法术伤害削弱10%",部位="头盔|项链",限制="无"},
    -- 连破六合={描述="横扫千军有10%几率不进入“休息”状态",部位="武器|衣服",限制="大唐官府"},
    -- 无双剑意={描述="横扫千军有10%几率不掉血",部位="武器|衣服",限制="大唐官府"},
    -- 十方光明={描述="推气过宫有8%几率触发满血",部位="武器|衣服",限制="化生寺"},
    -- 万佛朝宗={描述="推气过宫有10%几率触发连击",部位="武器|衣服",限制="化生寺"},
    -- 花语倾城={描述="战斗开始时有10%几率速度增加50%",部位="武器|衣服",限制="女儿村"},
    -- 一笑倾国={描述="雨落寒沙有10%几率额外作用1个单位",部位="武器|衣服",限制="女儿村"},
    -- 卫灵神咒={描述="战斗开始时有10%几率提高10%封印命中等级",部位="武器|衣服",限制="方寸山"},
    -- 雷法天尊={描述="使用技能后有8%几率提高15%法术伤害",部位="武器|衣服",限制="方寸山"},
    -- 霹霹电芒={描述="雷霆万钧和天雷斩有10几率额外作用1个单位",部位="武器|衣服",限制="天宫"},
    -- 天神下凡={描述="雷霆万钧和天雷斩有10几率触发连击",部位="武器|衣服",限制="天宫"},
    -- 慧眼观世={描述="五行法术有8%几率提高15%伤害",部位="武器|衣服",限制="普陀山"},
    -- 九天玄女={描述="普渡众生有10%几率额外作用1个单位",部位="武器|衣服",限制="普陀山"},
    -- 沧溟龙魄={描述="龙卷雨击有10%几率额外作用1个单位",部位="武器|衣服",限制="龙宫"},
    -- 蛟龙出海={描述="龙卷雨击有10%几率触发连击",部位="武器|衣服",限制="龙宫"},
    -- 潇湘骤雨={描述="烟雨剑法有10%几率增加一次攻击,飘渺式有10%几率额外作用1个单位",部位="武器|衣服",限制="五庄观"},
    -- 地仙老祖={描述="日月乾坤有10%几率增加10%基础封印命中,天命剑法50%触发5次以上攻击",部位="武器|衣服",限制="五庄观"},
    -- 鹰抟九天={描述="鹰击有10%几率额外作用1个单位",部位="武器|衣服",限制="狮驼岭"},
    -- 鹏程万里={描述="鹰击有10%几率不休息",部位="武器|衣服",限制="狮驼岭"},
    -- 五火神焰={描述="使用技能后有8%几率提高15%法术伤害",部位="武器|衣服",限制="魔王寨"},
    -- 魔王在世={描述="飞砂走石有5%几率连击一次,有5%几率额外作用1个单位",部位="武器|衣服",限制="魔王寨"},
    -- 无常索命={描述="阎罗令有10%几率额外作用1个单位",部位="武器|衣服",限制="阴曹地府"},
    -- 钟馗转生={描述="物理伤害结果提升10%",部位="武器|衣服",限制="阴曹地府"},
    -- 天网蛛狩={描述="战斗开始时有10%几率提高10%封印命中等级",部位="武器|衣服",限制="盘丝洞"},
    -- 九尾天狐={描述="含情脉脉有10%几率无视对方抗封等级直接命中",部位="武器|衣服",限制="盘丝洞"},
    -- 月影重光={描述="法术攻击有10几率触发连击",部位="武器|衣服",限制="神木林"},
    -- 月神附体={描述="治疗类技能结果有10%几率翻倍",部位="武器|衣服",限制="神木林"},
    -- 超级战息={描述="战斗开始时有10%几率提高10%物理暴击等级",部位="武器|衣服",限制="凌波城"},
    -- 劈山救母={描述="浪涌有10%几率额外作用1个单位",部位="武器|衣服",限制="凌波城"},
    -- 烛照九幽={描述="夺命咒有10几率触发连击",部位="武器|衣服",限制="无底洞"},
    -- 藕断丝连={描述="地涌金莲有10%几率额外作用1个单位",部位="武器|衣服",限制="无底洞"},
    -- 逐鹿中原={描述="使用技能后有8%几率提高10%物理伤害",部位="武器|衣服",限制="九黎城"},
    -- 五马分尸={描述="每次增加连击值时有10%几率+1连击值",部位="武器|衣服",限制="九黎城"}




神话属性={
    洪荒力魄={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    太初神念={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    鸿蒙元魂={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    无极命源={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    不灭金身={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    法天象地={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    道法自然={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    超然物外={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    无相法门={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    飞天遁地={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},
    兽语御灵={[1]=true,[2]=true},
    奇经山海={[1]=true,[2]=true},
    连破六合={[3]=true,[4]=true},
    无双剑意={[3]=true,[4]=true},
    十方光明={[3]=true,[4]=true},
    万佛朝宗={[3]=true,[4]=true},
    花语倾城={[3]=true,[4]=true},
    一笑倾国={[3]=true,[4]=true},
    卫灵神咒={[3]=true,[4]=true},
    雷法天尊={[3]=true,[4]=true},
    霹霹电芒={[3]=true,[4]=true},
    天神下凡={[3]=true,[4]=true},
    慧眼观世={[3]=true,[4]=true},
    九天玄女={[3]=true,[4]=true},
    沧溟龙魄={[3]=true,[4]=true},
    蛟龙出海={[3]=true,[4]=true},
    潇湘骤雨={[3]=true,[4]=true},
    地仙老祖={[3]=true,[4]=true},
    鹰抟九天={[3]=true,[4]=true},
    鹏程万里={[3]=true,[4]=true},
    五火神焰={[3]=true,[4]=true},
    魔王在世={[3]=true,[4]=true},
    无常索命={[3]=true,[4]=true},
    钟馗转生={[3]=true,[4]=true},
    天网蛛狩={[3]=true,[4]=true},
    九尾天狐={[3]=true,[4]=true},
    月影重光={[3]=true,[4]=true},
    月神附体={[3]=true,[4]=true},
    超级战息={[3]=true,[4]=true},
    劈山救母={[3]=true,[4]=true},
    烛照九幽={[3]=true,[4]=true},
    藕断丝连={[3]=true,[4]=true},
    逐鹿中原={[3]=true,[4]=true},
    五马分尸={[3]=true,[4]=true}
}


境界属性={
      健体={类型="体质",共鸣=false,分类={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},优秀={2,6},稀有={6,12},传说={12,24},神话={12,24}},
      千钧={类型="力量",共鸣=false,分类={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},优秀={2,6},稀有={6,12},传说={12,24},神话={12,24}},
      疾风={类型="敏捷",共鸣=false,分类={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},优秀={2,6},稀有={6,12},传说={12,24},神话={12,24}},
      灵脉={类型="魔力",共鸣=false,分类={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},优秀={2,6},稀有={6,12},传说={12,24},神话={12,24}},
      坚韧={类型="耐力",共鸣=false,分类={[1]=true,[2]=true,[3]=true,[4]=true,[5]=true,[6]=true},优秀={2,6},稀有={6,12},传说={12,24},神话={12,24}},
      尖锋={类型="伤害",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={6,12},稀有={12,24},传说={24,48},神话={24,48}},
      攻心={类型="法术伤害",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={6,12},稀有={12,24},传说={24,48},神话={24,48}},
      破竹={类型="穿刺等级",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={6,12},稀有={12,24},传说={24,48},神话={24,48}},
      摧破={类型="固定伤害",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={6,12},稀有={12,24},传说={24,48},神话={24,48}},
      杀意={类型="物理暴击等级",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={4,8},稀有={8,20},传说={20,40},神话={20,40}},
      会心={类型="法术暴击等级",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={4,8},稀有={8,20},传说={20,40},神话={20,40}},
      无双={类型="法术伤害结果",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={4,8},稀有={8,20},传说={20,40},神话={20,40}},
      桎梏={类型="封印命中等级",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={4,8},稀有={8,20},传说={20,40},神话={20,40}},
      金身={类型="抗法术暴击等级",共鸣=true,分类={[1]=true,[3]=true,[5]=true},优秀={8,16},稀有={16,32},传说={32,64},神话={32,64}},
      血脉={类型="气血",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={20,40},稀有={40,80},传说={80,160},神话={80,160}},
      神速={类型="速度",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      厚甲={类型="防御",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      化劲={类型="格挡值",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      护心={类型="法术防御",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      战神={类型="狂暴等级",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      济世={类型="治疗能力",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={5,10},稀有={10,18},传说={18,36},神话={18,36}},
      无羁={类型="抵抗封印等级",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={8,16},稀有={16,32},传说={32,64},神话={32,64}},
      无敌={类型="抗物理暴击等级",共鸣=true,分类={[2]=true,[4]=true,[6]=true},优秀={8,16},稀有={16,32},传说={32,64},神话={32,64}}
}



function 取灵饰强化(类型,等级,强化等级)
        if not 等级 then 等级=60 end
        if not 强化等级 then 强化等级 = 0 end
        if 类型=="速度" or 类型=="狂暴等级" or 类型=="治疗能力" or 类型=="法术伤害结果" then
              return  math.ceil((等级-40)/20*强化等级*0.7)
        elseif 类型=="防御" or 类型=="格挡值" or 类型=="法术防御" or 类型=="抵抗封印等级"
          or 类型=="抗法术暴击等级" or 类型=="抗物理暴击等级" then
            return  math.ceil((等级-40)/20*强化等级*1.5)
        elseif 类型=="气血" then
              return  math.ceil((等级-40)/20*强化等级*6)
        else
             return  math.ceil((等级-40)/20*强化等级)
        end
end




function 取五行()
	local 五行_ = {"金","木","水","火","土"}
	return 五行_[取随机数(1,5)]
end



function 取宝石()
	local 宝石 = {"红玛瑙","太阳石","舍利子","黑宝石","月亮石","光芒石"}
	return 宝石[取随机数(1,#宝石)]
end

function 取强化石()
	local 宝石 = {"青龙石","白虎石","朱雀石","玄武石"}
	return 宝石[取随机数(1,#宝石)]
end

function 取符石(名称)---最高3级 以后有4级可以在这里加

  local 符石= {}
   if 名称 == 2 then
    符石 = {"碧玉符石","金光符石","天神符石","飘渺符石","天仙符石",
            "霞光符石","逍遥符石",}
  elseif 名称 ==1 then
        符石 = {"冰符石","土符石","雷符石","电符石","风符石","炎符石","火符石"}
  else
      符石 = {"虹珀符石","陌影符石","北冥符石","灵月符石","锦瑟符石","银光符石","清心符石","星辰符石","雪月符石","玄魂符石","乾坤符石","珍珀符石",
            "银竹符石","神川符石","玲珑符石","暮影符石","天珍符石","九影符石","百冥符石","莫念符石","醉魂符石","玄羽符石","霸风符石","无相符石",
            "无极符石","紫晶符石","圣火符石","昔光符石","子蚀符石","流风符石","地炎符石","素影符石","燕灵符石","降龙符石","苍玉符石","流魂符石",
            "九凤符石","墨陀符石","南夕符石","引幽符石","波涛符石","铃星符石","狂念符石","乱花符石","幽月符石","两仪符石","七情符石","召影符石"}
   end
   return  符石[取随机数(1,#符石)]
end
------------------------------------------内丹419神机步，电魂闪
function 取内丹(类型)
    local 普通内丹 = {"迅敏","狂怒","阴伤","静岳","擅咒","灵身","矫健","深思","钢化","坚甲","慧心","撞击","无畏","愤恨","淬毒","狙刺","连环","圣洁","灵光"}
    local 高级内丹 ={ "腾挪劲","玄武躯","龙胄铠","玉砥柱","碎甲刃","舍身击","通灵法","双星暴","催心浪","隐匿击","生死决","血债偿","神机步","电魂闪",}--"神机步","电魂闪","凛冽气","阴阳护",
   if 类型 == "高级"  then
      return 高级内丹[取随机数(1,#高级内丹)]
   else
       return 普通内丹[取随机数(1,#普通内丹)]
   end
end




function 绑定等级物品()
	local n = {}
	n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
	n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
	n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
	n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
	n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
	n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
	n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
	n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
	n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
	n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
	n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
	n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
	n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
	n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
	n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
	n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
	n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
	n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
	n[19] = {{"方巾","簪子"},{"布帽","玉钗",},{"面具","梅花簪子"},{"纶巾","珍珠头带"},{"缨络丝带","凤头钗"},{"羊角盔","媚狐头饰"},{"水晶帽","玉女发冠"},{"乾坤帽","魔女发冠"},{"黑魔冠","七彩花环"},{"白玉龙冠","凤翅金翎"},{"水晶夔帽","寒雉霜蚕"},{"翡翠曜冠","曜月嵌星"},{"金丝黑玉冠","郁金流苏簪"},{"白玉琉璃冠","玉翼附蝉翎"},{"兽鬼珐琅面","鸾羽九凤冠"},{"紫金磐龙冠","金珰紫焰冠"},{"浑天玄火盔","乾元鸣凤冕"}}
	n[20] = {"护身符","五色飞石","珍珠链",{"骷髅吊坠","苍魂珠"},{"江湖夜雨","九宫坠"},{"荧光坠子","高速之星"},{"风月宝链","八卦坠"},{"碧水青龙","鬼牙攫魂"},{"万里卷云","疾风之铃"},"七彩玲珑","黄玉琉佩","鸾飞凤舞","衔珠金凤佩","七璜珠玉佩","鎏金点翠佩","紫金碧玺佩","落霞陨星坠"}
	n[21] = {{"布裙","布衣"},{"丝绸长裙","皮衣"},{"五彩裙","鳞甲"},{"龙鳞羽衣","锁子甲"},{"天香披肩","紧身衣"},{"金缕羽衣","钢甲"},{"霓裳羽衣","夜魔披风"},{"流云素裙","龙骨甲"},{"七宝天衣","死亡斗篷"},{"飞天羽衣","神谕披风"},{"穰花翠裙","珊瑚玉衣"},{"金蚕丝裙","金蚕披风"},{"紫香金乌裙","乾坤护心甲"},{"碧霞彩云衣","蝉翼金丝甲"},{"金丝蝉翼衫","金丝鱼鳞甲"},{"五彩凤翅衣","紫金磐龙甲"},{"鎏金浣月衣","混元一气甲"}}
	n[22] = {"腰带","缎带","银腰带",{"水晶腰带","玉树腰带"},{"琥珀腰链","白面狼牙"},{"乱牙咬","魔童大牙"},{"攫魂铃","双魂引"},{"兽王腰带","百窜云"},{"八卦锻带","圣王坠"},"幻彩玉带","珠翠玉环","金蟾含珠","乾坤紫玉带","琉璃寒玉带","蝉翼鱼佩带","磐龙凤翔带","紫霄云芒带"}
	n[23] = {"布鞋","牛皮靴","马靴","侠客履","神行靴","绿靴","追星踏月","九州履","万里追云履","踏雪无痕","平步青云","追云逐电","乾坤天罡履","七星逐月靴","碧霞流云履","金丝逐日履","辟尘分光履"}
	n[24] = {"竹编护腕","皮腕","针腕","骨镯","青铜护腕","玛瑙护腕","琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","缚龙筋","凤翎护腕","织锦彩带","冰蚕丝带"}
	n[25] = {"竹编脖环","钢圈","荆棘环","骨环","青铜颈环","玛瑙石环","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","缚龙圈","鸾尾环","织锦颈圈","冰蚕丝圈"}
	n[26] = {"竹藤甲","皮甲","刺甲","骨排甲","青铜披甲","玛瑙软甲","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲","缚龙甲","凤凰彩衣","织锦软褡","冰蚕织甲"}
	return n
end

function 取随机装备名称(等级)
	local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
	local 随机装备=绑定等级物品()
	local 临时等级=等级
	local 临时参数=取随机数(1,#书铁范围)
	local 临时序列=临时参数
    if 临时序列==25 then
     临时序列=23
    elseif 临时序列==24 then
     临时序列=22
    elseif 临时序列==23 or 临时序列==22 then
     临时序列=21
    elseif 临时序列==21 then
     临时序列=20
    elseif 临时序列==20 or 临时序列==19 then
     临时序列=19
    end
    if 临时序列<=18 and 临时等级>=9 then --是武器 10-12是普通光武
     临时等级=取随机数(9,11)
    else
      if 临时等级>=12 then
         临时等级=13
      end
    end
	local 临时类型=随机装备[临时序列][临时等级+1]
    if type(临时类型)=="table" then
       if 临时参数 ==23 then
         临时类型=临时类型[2]
        elseif 临时参数 ==22 then
         临时类型=临时类型[1]
        elseif 临时参数 ==20 then
         临时类型=临时类型[2]
        elseif 临时参数 ==19 then
         临时类型=临时类型[1]
        else
          临时类型=临时类型[取随机数(1,2)]
        end
     end
 return 临时类型
end

function 取官职任务物品(id)
	local 物品名称=玩家数据[id].装备.打造物品[取随机数(1,23)][取随机数(1,3)]
	if type(物品名称)=="table" then
		物品名称=物品名称[取随机数(1,#物品名称)]
	end
 return 物品名称
end

function 取武器数据(名称,级别)
	if 名称==nil or 级别==nil then return  end
	local 道具 = 物品类()
	道具:置对象(名称)
	道具.级别限制 = 级别
	return {名称=名称,级别限制=级别,子类=道具.子类}
end

function 取物品数据(wd)
local wds = {}
if wd == "飞刀" then
wds[1] = "锋利的飞刀，普通的暗器"
wds[2] = 2000
wds[3] = 10
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xA4C811C5
wds[13] = 0x935EC081
elseif wd == "飞蝗石" then
wds[1] = "普通暗器，但如果使用熟了，非常方便"
wds[2] = 2000
wds[3] = 20
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x4C07009E
wds[13] = 0xBF944057
elseif wd == "铁蒺藜" then
wds[1] = "形状似蒺藜的铁制暗器"
wds[2] = 2000
wds[3] = 30
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x2851A8EC
wds[13] = 0x5D501D52
elseif wd == "无影神针" then
wds[1] = "著名暗器，特点为伤害力较大，极不宜防范"
wds[2] = 2000
wds[3] = 40
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x961527F8
wds[13] = 0x9E5D7895
elseif wd == "孔雀翎" then
wds[1] = "传说中的暗器，据说伤人例不虚发"
wds[2] = 2000
wds[3] = 50
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xB2657A38
wds[13] = 0x454FC9EB
elseif wd == "含沙射影" then
wds[1] = "传说中的暗器，扣动机关，万针齐射，非常不易防"
wds[2] = 2000
wds[3] = 60
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xBE43C96E
wds[13] = 0xE4366820
elseif wd == "回龙摄魂标" then
wds[1] = "著名暗器，发出时阴风阵阵，令人防不胜防"
wds[2] = 2000
wds[3] = 70
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xCD324F8E
wds[13] = 0x3EF314E5
elseif wd == "寸阴若梦" then
wds[1] = "来自阴府的暗器，甩出时带动惨惨阴风"
wds[2] = 2000
wds[3] = 80
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xFB2A8F4C
wds[13] = 0x57255C54
elseif wd == "魔睛子" then
wds[1] = "魔王妖王所用的邪恶暗器，会自己追被攻击人"
wds[2] = 2000
wds[3] = 90
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x82A15466
wds[13] = 0x69404DEA
elseif wd == "顺逆神针" then
wds[1] = "此暗器，一旦被伤害，神针不易取出，极为厉害"
wds[2] = 2000
wds[3] = 100
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xA1716F61
wds[13] = 0x7AFB7396
elseif wd == "修篁斧" then
wds[1] = "仙界的五行秘宝之一，为普陀山砍伐紫竹之物。"
wds[2] = 150
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x25F0FF04
wds[13] = 0x34EF726D
elseif wd == "炼金鼎" then
wds[1] = "仙界的五行秘宝之一，为五庄观修炼金丹之物。 "
wds[2] = 150
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x6BEC70D0
wds[13] = 0x45968E54
elseif wd == "定海针" then
wds[1] = "仙界的五行秘宝之一，为龙宫的镇海之宝。"
wds[2] = 150
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xF524FB0F
wds[13] = 0xD75D34DE
elseif wd == "凤头钗" then
wds[1] = "雕刻着凤头的金钗，可以起到防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 40
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 1305963475
wds[13] = 1323749060
elseif wd == "雁翅刀" then
wds[1] = "刀背布满粗大的锯齿，上挂银环，铿锵入耳如雁过九天"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 40
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1719719282
wds[13] = 3277123413
elseif wd == "面具" then
wds[1] = "用皮制的面具，可以起到防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 20
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1622680174
wds[13] = 544766765
elseif wd == "勾魂爪" then
wds[1] = "状似银勾，夺命勾魂"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 40
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 2945873492
wds[13] = 3529952713
elseif wd == "铁腕" then
wds[1] = "铁做的护腕，可以起到伤害力"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2535965770
wds[13] = 1102893761
elseif wd == "皮衣" then
wds[1] = "用兽皮制的皮衣，防御力较布衣要好的多"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 10
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1569129428
wds[13] = 4004133926
elseif wd == "双面斧" then
wds[1] = "两面均制成半月状锋刃，双面制敌，力猛势强"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 20
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 595341788
wds[13] = 917777182
elseif wd == "七彩罗刹" then
wds[1] = "用各式丝绸编织而成的丝带"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 60
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 4216697314
wds[13] = 1196299810
elseif wd == "五色飞石" then
wds[1] = "仙人炼制的饰品，佩带在身上有极强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 10
wds[11] = "item.wdf"
wds[12] = 3139664596
wds[13] = 374271655
elseif wd == "梅花簪子" then
wds[1] = "因簪子外端有梅花形状而得名，可以起到防御作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 20
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2353187566
wds[13] = 3355592593
elseif wd == "霓裳羽衣" then
wds[1] = "非常美丽的羽衣，可以起到一定的防御作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 60
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3005484634
wds[13] = 2665296729
elseif wd == "黄金钺" then
wds[1] = "以华丽的黄金装饰,使其更加沉重威猛,金光起处血光飞溅"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 50
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 804669659
wds[13] = 3468478581
elseif wd == "魔兽要诀" then
wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 1241924823
wds[13] = 2950829831
elseif wd == "高级魔兽要诀" then
wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x6CAD36E8
wds[13] = 0xD86D89B8
elseif wd == "特殊魔兽要诀" then
wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x04694A50
wds[13] = 0xC3A8BEA9
elseif wd == "超级魔兽要诀" then
wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 1
wds[4] = 0
wds[11] = "超级技能.wdf"
wds[12] = 0xAABB0195
wds[13] = 0xAABB0194
elseif wd == "召唤兽内丹" then
wds[1] = "上古魔兽遗留下来的精气经万年而成的内丹，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x722F3F52
wds[13] = 0x46D073B2
elseif wd == "高级召唤兽内丹" then
wds[1] = "上古魔兽遗留下来的精气经万年而成的高级内丹，可供你的召唤兽学习。"
wds[2] = 3
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x02A776DE
wds[13] = 0x4E43EBFF


elseif wd == "龙鳞羽衣" then
wds[1] = "用龙鳞制成的羽衣，有相当的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 30
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 4057563157
wds[13] = 2734928170
elseif wd == "夜灵珠" then
wds[1] = "白日之时看似平平无奇，置于灯火昏昏之处，方有幽光融融。其夜愈深，而光华愈明。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 50
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3855395369
wds[13] = 814300484
elseif wd == "风月宝链" then
wds[1] = "名家制成的精致饰品，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 91099687
wds[13] = 1990243519
elseif wd == "云龙绸带" then
wds[1] = "绸如云彩，龙隐其间"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 50
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 140457428
wds[13] = 4041408902
elseif wd == "黄色导标旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 1
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 1953229980
wds[13] = 1011605557
wds[14] = 13000
elseif wd == "蓝色合成旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 2
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 0x78C6828D
wds[13] = 0x4D27A80E
wds[14] = 13000
elseif wd == "绿色合成旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 2
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 0xC87EF093
wds[13] = 0x498354A0
wds[14] = 13000
elseif wd == "黄色合成旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 2
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 0x409FA7D1
wds[13] = 0x3D64E066
wds[14] = 13000
elseif wd == "白色合成旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 2
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 0x306FE9B9
wds[13] = 0xB06EE4C6
wds[14] = 13000
elseif wd == "红色合成旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 2
wds[4] = 20
wds[11] = "item.wdf"
wds[12] = 0x0DE87173
wds[13] = 0x4F8723DA
wds[14] = 13000
elseif wd == "硬木弓" then
wds[1] = "柳木头制成的短弓，质轻便携，很适合新手练习使用"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1102238567
wds[13] = 322855055
elseif wd == "缎带" then
wds[1] = "高级丝绸制成的腰带，能起到不错的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 10
wds[11] = "item.wdf"
wds[12] = 3002795508
wds[13] = 4182781118
elseif wd == "幽冥鬼爪" then
wds[1] = "精钢打造，饰以冥文，透出森森鬼气"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 20
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 473959188
wds[13] = 3711514054
elseif wd == "五彩裙" then
wds[1] = "五彩绵制成的裙子，可以起到一定的防御作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 20
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2890413629
wds[13] = 3454325495
elseif wd == "河虾" then
wds[1] = "生长在河水中的小虾"
wds[2] = 10
wds[3] = 1
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 1697773646
wds[13] = 1542469648
elseif wd == "墨铁拐" then
wds[1] = "墨铁打造而成的法杖，冰冷坚硬，似乎含有奇妙的力量。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 30
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 6277753
wds[13] = 2738948963
elseif wd == "红色导标旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 1
wds[4] = 10
wds[11] = "item.wdf"
wds[12] = 2856215948
wds[13] = 3379177744
wds[14] = 7000
elseif wd == "玄铁矛" then
wds[1] = "枪头玄铁制成，宽大沉重，可刺可砍，威势不可挡"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 60
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 4108563339
wds[13] = 1450072521
elseif wd == "双弦钺" then
wds[1] = "铁杆黝黑，银月如弦，舞动时眩人眼目"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 30
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2083951632
wds[13] = 709060887
elseif wd == "紫檀弓" then
wds[1] = "精致的紫楠木弓箭，云纹雕花流畅雅致。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 20
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1817338084
wds[13] = 1474683356
elseif wd == "绿色导标旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 1
wds[4] = 100
wds[11] = "item.wdf"
wds[12] = 1060779522
wds[13] = 662138631
wds[14] = 120000
elseif wd == "开山斧" then
wds[1] = "铁铸的巨大战斧，沉重无比，力大者用以开石裂碑"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 10
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2876225806
wds[13] = 511692637
elseif wd == "神行靴" then
wds[1] = "非常轻便的靴子，可以起到防御的作用"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 40
wds[11] = "item.wdf"
wds[12] = 3963558258
wds[13] = 1110999757
elseif wd == "风火圈" then
wds[1] = "钢制的边缘有似火焰般的刀锋"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 40
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3696047428
wds[13] = 3443374908
elseif wd == "幽路引魂" then
wds[1] = "通体乌黑，引魂归冥"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 50
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3655607718
wds[13] = 496189030
elseif wd == "蓝色导标旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 1
wds[4] = 50
wds[11] = "item.wdf"
wds[12] = 53543608
wds[13] = 340145338
wds[14] = 60000
elseif wd == "珍宝珠" then
wds[1] = "东海海底方能寻得的巨大珍珠，光华缓缓流动，似是凝聚了海底之中游鱼的灵气。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 20
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2649110916
wds[13] = 1758505762
elseif wd == "青铜短剑" then
wds[1] = "青铜制成，上铸有简单的图案纹饰，初学者练习常用"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1261240304
wds[13] = 4201657972
elseif wd == "玉钗" then
wds[1] = "用玉制成的钗，可以起到防御作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 10
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 509457918
wds[13] = 3519518702
elseif wd == "毛蟹" then
wds[1] = "常见于近海深水区域，身小壳薄，肉质细嫩而有香味"
wds[2] = 10
wds[3] = 2
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 602109723
wds[13] = 3555868873
elseif wd == "丝绸长裙" then
wds[1] = "用名贵丝绸制成的长裙，女子用，可以起到防御作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 10
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 1759000550
wds[13] = 451022751
elseif wd == "绿靴" then
wds[1] = "绿水晶制成的鞋子，防御作用非常的强"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 2631819456
wds[13] = 3993409018
elseif wd == "布裙" then
wds[1] = "普通的布裙，女子用，可以起到防御的作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2415237558
wds[13] = 4137686182
elseif wd == "荧光坠子" then
wds[1] = "有荧光的宝石，佩带在身上有相当强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 240077184
wds[13] = 4212393181
elseif wd == "龙凤双剑" then
wds[1] = "双剑剑身一刻龙纹一刻凤饰，可同入一鞘"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 20
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 2574377494
wds[13] = 2688315512
elseif wd == "破甲战锤" then
wds[1] = "精钢打造的巨型战锤，上部粗大的尖齿，可破甲裂碑"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 50
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2961406351
wds[13] = 2582952463
elseif wd == "骷髅吊坠" then
wds[1] = "皮绳上吊着一个骷髅，佩带在身上有一定法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 30
wds[11] = "item.wdf"
wds[12] = 3414243240
wds[13] = 3509217536
elseif wd == "神火扇" then
wds[1] = "扇面用红绸制，此扇动则似神火四起，使敌人心不能宁"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 60
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 1646280508
wds[13] = 2148260737
elseif wd == "玉如意" then
wds[1] = "细长的白玉棒，白玉使魔棒能力得到加强"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 20
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 1722461164
wds[13] = 4043165218
elseif wd == "狼牙双剑" then
wds[1] = "剑身向前方密布粗长的狼牙锯齿，令人胆寒长"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 40
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 1830383421
wds[13] = 885886005
elseif wd == "海马" then
wds[1] = "生活在热带及温带深海，头部弯曲，形状与马头相似"
wds[2] = 10
wds[3] = 3
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 2901285604
wds[13] = 2563380359
elseif wd == "铁骨扇" then
wds[1] = "铁制的扇骨会对敌人造成较大的威胁"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 10
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 290823954
wds[13] = 1443372759
elseif wd == "金枪鱼" then
wds[1] = "温热带海洋鱼类，身型细长，游速非常快"
wds[2] = 10
wds[3] = 3
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 1109845536
wds[13] = 3822216681
elseif wd == "玄铁牛角杖" then
wds[1] = "用寒铁锻冶的牛角状法杖，尖锐坚硬，闪着寒光，隐含奇妙的法力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 40
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 3096649690
wds[13] = 1043225710
elseif wd == "纶巾" then
wds[1] = "真丝织成的白色头巾，可以起到防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 30
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1730098396
wds[13] = 2497291232
elseif wd == "玉女发冠" then
wds[1] = "仙女常带的头环，有相当强的防御力"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 60
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3770740399
wds[13] = 438307144
elseif wd == "媚狐头饰" then
wds[1] = "狐眼嵌着宝石的狐头帽，魔女们喜爱的头饰"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 50
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 413224440
wds[13] = 798712466
elseif wd == "鲤鱼" then
wds[1] = "淡水鱼类，肉质坚实，味道鲜美"
wds[2] = 10
wds[3] = 3
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 3865632193
wds[13] = 2442761904
elseif wd == "折扇" then
wds[1] = "普通的纸扇改装而成，可以此练习最基本的使扇方法"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3563784870
wds[13] = 817774560
elseif wd == "甲鱼" then
wds[1] = "右键使用可以增加10点积分"
wds[2] = 10
wds[3] = 5
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 174833964
wds[13] = 3829834695
elseif wd == "破天宝刀" then
wds[1] = "刀光八面，劈风破天"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 50
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1201880064
wds[13] = 3191505206
elseif wd == "河豚" then
wds[1] = "肉食鱼类，主要捕食小鱼小虾和贝类，部分内脏有毒，但肉味非常鲜美，是难得的佳肴"
wds[2] = 10
wds[3] = 3
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 2328042941
wds[13] = 2165741719
elseif wd == "夜魔弯刀" then
wds[1] = "精钢制成的细弯刀，刀背密布细齿，如夜魔之牙。"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 20
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 2386679785
wds[13] = 2763619781
elseif wd == "娃娃鱼" then
wds[1] = "右键使用可以增加20点积分"
wds[2] = 10
wds[3] = 3
wds[4] = 6
wds[11] = "item.wdf"
wds[12] = 2884328689
wds[13] = 1455411021
elseif wd == "水晶珠" then
wds[1] = "晶莹水晶打磨而成的水晶球，发出微微的光晕。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 10
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 424958581
wds[13] = 517101356
elseif wd == "丁香水" then
wds[1] = "从仙岛上的丁香花中精心提炼而成"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 2
wds[10] = 75
wds[11] = "item.wdf"
wds[12] = 870043705
wds[13] = 598856410
wds[14] = 1000
elseif wd == "河蟹" then
wds[1] = "体型较大的淡水蟹，常见于深水湖泊之中"
wds[2] = 10
wds[3] = 2
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 1298631470
wds[13] = 3041830860
elseif wd == "草鱼" then
wds[1] = "右键使用可以增加10点积分"
wds[2] = 10
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 3951553868
wds[13] = 1888688338
elseif wd == "沙丁鱼" then
wds[1] = "常见海洋鱼类，身型小巧，行动敏捷，喜好群居于暖水海区"
wds[2] = 10
wds[3] = 1
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 1219611956
wds[13] = 3258862526
elseif wd == "白色导标旗" then
wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
wds[2] = 11
wds[3] = 1
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 2217728758
wds[13] = 1751361785
wds[14] = 1500
elseif wd == "乌金鬼头镰" then
wds[1] = "乌金打造的巨镰，透出森森鬼气，令人不寒而栗"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 60
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1269150805
wds[13] = 2315090325
elseif wd == "对虾" then
wds[1] = "常栖于沿岸浅海，肉质鲜嫩，营养丰富"
wds[2] = 10
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 1712326570
wds[13] = 2200846910
elseif wd == "玉树腰带" then
wds[1] = "玉树之丝绦制成的腰带，能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 30
wds[11] = "item.wdf"
wds[12] = 1806472204
wds[13] = 3616026443
elseif wd == "神兽精元" then
wds[1] = "传说中的神兽遗留下来的精元"
wds[2] = 9
wds[3] = 2
wds[4] = 1
wds[9] = 0
wds[10] = 0
wds[11] = "common/item.wdf"
wds[12] = 2858010774
wds[13] = 1581676023
wds[14] = 0
elseif wd == "镔铁双剑" then
wds[1] = "铁制双短剑，轻巧实用"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 10
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 1169767913
wds[13] = 2278749441
elseif wd == "飞行符" then
wds[1] = "一种神奇的符咒，使用后可以穿梭于各大陆之间"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 3496860737
wds[13] = 2592521580
wds[14] = 500
elseif wd == "灵箓" then
wds[1] = "一种神奇的符咒，使用后可以将灵饰特性清除"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "common/item.wdf"
wds[12] = 0x14577FB6
wds[13] = 0x6B665BCC
wds[14] = 500
elseif wd == "钟灵石" then
wds[1] = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于幻化灵饰额外效果。"
wds[2] = 5
wds[3] = 6
wds[4] = 8
wds[11] = "item.wd1"
wds[12] = 0x01000001
wds[13] = 0x01000002
elseif wd == "魔兽残卷" then
wds[1] = "上古魔兽遗留下来的意志,听说唐王正在收集他们。(集齐300个可以找唐王兑换特殊兽决)"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xC3AF882B
wds[13] = 0xCFB770DD
wds[14] = 500
elseif wd == "特殊兽决碎片" then  ---特殊兽决碎片
wds[1] = "上古魔兽遗留下来的意志,听说唐王正在收集他们。(集齐99个可以兑换特殊兽决礼包)"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xC3AF882B
wds[13] = 0xCFB770DD
wds[14] = 500
elseif wd == "超级兽决碎片" then  ---超级兽决碎片
wds[1] = "上古魔兽遗留下来的意志,听说唐王正在收集他们。(集齐99个可以兑换超级兽决礼包)"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "超级技能.wdf"
wds[12] = 0xAABB0195
wds[13] = 0xAABB0194
wds[14] = 500
elseif wd == "新春红包" then  ---新春红包
wds[1] = "蛇年新春红包。(集齐99个红包可以兑换新春礼包)"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "门派界面.wdf"
wds[12] = 0x00000238
wds[13] = 0x00000239
wds[14] = 500
elseif wd == "神兜兜" then
wds[1] = "三界之内神兽们最喜欢的玩具，积攒99个\n#P可以开出商城没有的#Y神兽"
wds[2] = 9
wds[3] = 11
wds[4] = 0
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x50808141
wds[13] = 0x65756770
elseif wd == "灵兜兜" then
wds[1] = "三界之内神兽们最喜欢的玩具，积攒一定数量\n#P可以开出商城没有的#Y神兽"
wds[2] = 9
wds[3] = 11
wds[4] = 0
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x50808141
wds[13] = 0x65756770
elseif wd == "翡翠琵琶" then
wds[1] = "炼丹专用产品,最受欢迎的燃料, 注入炉中可获得大量灵气。"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0X24F1DB12
wds[13] = 0XEE96A30C
wds[14] = 500
elseif wd == "金砂丹" then
wds[1] = "使用可以获得100W银子。"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0X5ECBF9DD
wds[13] = 0X389EAEC4
wds[14] = 500
elseif wd == "银砂丹" then
wds[1] = "使用可以获得10W银子"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0X75E517A5
wds[13] = 0XBBBF65A1
wds[14] = 500
elseif wd == "铜砂丹" then
wds[1] = "使用可以获得1W银子"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0XC36CA6B6
wds[13] = 0xE5F605BF
wds[14] = 500
elseif wd == "坐骑内丹" then
wds[1] = "使用可用使坐骑重新领悟技能！"
wds[2] = 9
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x25492E36
wds[13] = 0x663fc75A
wds[14] = 500
elseif wd == "红木杖" then
wds[1] = "用上好红木刻成的法杖，十分坚硬，内含一点奇妙的法力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 10
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 2519088005
wds[13] = 2809977168
elseif wd == "蛇骨鞭" then
wds[1] = "结似蛇骨，环环相联，抖动时骨节相撞，噼啪作响"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 40
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 2780394861
wds[13] = 2403200026
elseif wd == "乌金三叉戟" then
wds[1] = "玄铁长枪，头部以乌金打造，气势如虹"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 30
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 2487968590
wds[13] = 3770180780
elseif wd == "藏宝图" then
wds[1] = "一张记着藏宝地点的地图"
wds[2] = 7
wds[3] = 1
wds[4] = 1
wds[9] = 0
wds[10] = 0
wds[11] = "item.wdf"
wds[12] = 211127435
wds[13] = 1954996989
elseif wd == "高级藏宝图" then
wds[1] = "一张记着藏宝地点的地图"
wds[2] = 7
wds[3] = 1
wds[4] = 1
wds[9] = 0
wds[10] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xA3DF3AA3
wds[13] = 0x894D37C5
elseif wd == "玲珑宝图" then
wds[1] = "一张记着藏宝地点的地图"
wds[2] = 7
wds[3] = 1
wds[4] = 1
wds[9] = 0
wds[10] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xA3DF3AA3
wds[13] = 0x894D37C5
elseif wd == "金缕羽衣" then
wds[1] = "用金丝缝制的羽衣，可以起到一定的防御作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 50
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 995989694
wds[13] = 4188048378
elseif wd == "心魔宝珠" then
wds[1] = "汲取野妖族精华而成，蕴含着无穷魔力的宝珠"
wds[2] = 6
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 1153796395
wds[13] = 1350319491
elseif wd == "铁爪" then
wds[1] = "镔铁制成的铁爪"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 252413888
wds[13] = 3216807428
elseif wd == "离情环" then
wds[1] = "乌金铁环，通体乌黑，似悠悠离情"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 20
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2588804470
wds[13] = 2925351135
elseif wd == "分解符" then
wds[1] = "用于分解装备"
wds[2] = 5
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 3953209807
wds[13] = 3190197121
elseif wd == "百炼精铁" then
wds[1] = "精铁百炼而成\n这种材料为神兵而存在\n是用来合成装备的神奇矿石"
wds[2] = 5
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 3971456754
wds[13] = 2585045399
elseif wd == "腾云杖" then
wds[1] = "仙人踏云而至，有着祥云之形的云母石法杖，有着奇妙法力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 60
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 4198430474
wds[13] = 1425813651
elseif wd == "制造指南书" then
wds[1] = "记载着各种装备武器制造方法的书卷。"
wds[2] = 5
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 1102456535
wds[13] = 3855535092
elseif wd == "灵饰指南书" then
wds[1] = "记载各种灵饰制造方法的古老书卷"
wds[2] = 5
wds[3] = 20
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xAEB5E00E
wds[13] = 0xD7E29586
elseif wd == "元灵晶石" then
wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
wds[2] = 5
wds[3] = 21
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0x321116AF
wds[13] = 0x13A717B5
elseif wd == "云龙棒" then
wds[1] = "棒身九曲，似云龙腾跃"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 40
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 1889288915
wds[13] = 741134712
elseif wd == "摄妖香" then
wds[1] = "人间流行的一种驱逐妖魔的异香，时效为三个时辰"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 3553509277
wds[13] = 4033100487
wds[14] = 80
elseif wd == "2倍经验丹" then
wds[1] = "基础经验额外增加2倍,可以与双倍、精修、双倍经验丹同时存在,每次使用获得1小时有效时间。无法冻结、无法叠加使用。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0X2A59F2A1
wds[13] = 0X77F1A658
wds[14] = 80
elseif wd == "3倍经验丹" then
wds[1] = "基础经验额外增加3倍,可以与双倍、精修、双倍经验丹同时存在,每次使用获得1小时有效时间。无法冻结、无法叠加使用。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0X2A59F2A1
wds[13] = 0X77F1A658
wds[14] = 80
elseif wd == "神兵图鉴" then
wds[1] = "征战沙场的大唐弟子所撰写的书册，记载着天下武器和铠甲的鉴定心法。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xA523F956
wds[13] = 0x4FB63423
elseif wd == "灵宝图鉴" then
wds[1] = "来自地府的灵宝，记载些一些装备的鉴定心法。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xA80AC05A
wds[13] = 0xF316C979
elseif wd == "灵饰图鉴" then
wds[1] = "颜如玉呕心沥血所写下的书册，记录着灵饰的鉴定心法。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "界面修复.wdf"
wds[12] = 0x91D53565--小
wds[13] = 0x9B651FF7--大
elseif wd == "乾坤袋" then
wds[1] = "一个能装天地万物的乾坤如意袋，在特定战斗中祭起可将对手收入袋中。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xE83A6DBF
wds[13] = 0x9A0EA431
wds[14] = 80
elseif wd == "特赦令牌" then
wds[1] = "阎罗地狱里用来宽恕极恶不赦的鬼魂，非常罕见。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x8FF330C0
wds[13] = 0xFE72166A
wds[14] = 80
wds[13] = 3067278649
elseif wd == "GM令牌" then
wds[1] = "拥有此令牌将获得GM商品购买权限"
wds[2] = 5
wds[3] = 6
wds[4] = 3
wds[11] = "物品图标.wdf"
wds[12] = 0x8FF330C0
wds[13] = 0xFE72166A
elseif string.find(wd,"GM令牌")~=nil then
wds[1] = "拥有此令牌将获得GM商品购买权限"
wds[2] = 5
wds[3] = 6
wds[4] = 3
wds[11] = "物品图标.wdf"
wds[12] = 0x8FF330C0
wds[13] = 0xFE72166A
elseif wd == "空白强化符" then
wds[1] = "传说世间中流传着一些神奇的法术，可以点化装备为其附加某种临时属性。而懂得这些法术的人也能将一张空白的强化符进行点化，使其成为有着神奇功效的灵符。"
wds[2] = 102
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x82CAB6E5
wds[13] = 0xCD6B3CDA
wds[14] = 80
elseif wd == "强化符" then
wds[1] = "神奇的灵符，有着为装备附加临时属性的效果"
wds[2] = 101
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x8FA84829
wds[13] = 0x2DFD9D18
wds[14] = 80
elseif wd == "墨杆金钩" then
wds[1] = "乌金铁杆，枪尖粗大且制有金色的粗大倒钩，威猛无比"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 50
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 1104964498
wds[13] = 3076442266
elseif wd == "秘制醉生忘死" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[9] = 5000
wds[11] = "item.wdf"
wds[12] = 3981927301
wds[13] = 724140283
wds[14] = 15000
elseif wd == "黄铜圈" then
wds[1] = "黄铜制的环圈，握手处缚上丝线，是常用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 8632408
wds[13] = 526420633
elseif wd == "洞冥草" then
wds[1] = "山洞中生长的一种阴暗的小草，可以解除摄妖香效果"
wds[2] = 4
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 3286276407
wds[13] = 3672031387
wds[14] = 80
elseif wd == "秘制红罗羹" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[9] = 10000
wds[11] = "common/item.wdf"
wds[12] = 1928344100
wds[13] = 2602015807
wds[14] = 20000
elseif wd == "秘制绿罗羹" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[10] = 10000
wds[11] = "common/item.wdf"
wds[12] = 0xCDDC07C1
wds[13] = 0x0B070C18
wds[14] = 20000
elseif wd == "超级红罗羹" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[9] = 10000
wds[11] = "物品图标.wdf"
wds[12] = 1928344100
wds[13] = 2602015807
wds[14] = 20000
elseif wd == "超级绿罗羹" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[10] = 10000
wds[11] = "物品图标.wdf"
wds[12] = 0xCDDC07C1
wds[13] = 0x0B070C18
wds[14] = 20000
elseif wd == "高速之星" then
wds[1] = "神秘的项圈，来历至今无人知晓"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 4175067704
wds[13] = 1572566259
elseif wd == "钝铁重剑" then
wds[1] = "废铁弃疗打造出来的重剑，价格低廉，适宜新手。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 4219998266
wds[13] = 3460607829
elseif wd == "秘制翡翠豆腐" then
wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
wds[2] = 1
wds[3] = 4
wds[4] = 3
wds[8] = 1
wds[10] = 5000
wds[11] = "item.wdf"
wds[12] = 299271567
wds[13] = 829957946
wds[14] = 15000
elseif wd == "江湖夜雨" then
wds[1] = "流传于中土的奇异饰物，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 40
wds[11] = "item.wdf"
wds[12] = 3985913426
wds[13] = 293361877
elseif wd == "白面狼牙" then
wds[1] = "白色的神镜片，可束在腰间，能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 40
wds[11] = "item.wdf"
wds[12] = 3575831350
wds[13] = 3209666649
elseif wd == "泥鳅" then
wds[1] = "常见淡水鱼类，肉质细嫩，味道鲜美"
wds[2] = 10
wds[3] = 1
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 1404739243
wds[13] = 2931630332
elseif wd == "白椴杖" then
wds[1] = "用极佳的椴木精心雕凿而成的法杖，杖身光滑，蕴含着奇妙的法力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 20
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 1994971958
wds[13] = 1336522328
elseif wd == "麝香" then
wds[1] = "仙山灵麝的麝香，是名贵的中草药材，可以补充些许法力"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 2
wds[10] = 100
wds[11] = "item.wdf"
wds[12] = 117711803
wds[13] = 1653741198
wds[14] = 1250
elseif wd == "天狼爪" then
wds[1] = "天山雪狼之爪，锐利无比"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 10
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3766972932
wds[13] = 2543379065
elseif wd == "竹编脖环" then
wds[1] = "竹子围成的项圈，可以起到防御作用"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 5
wds[11] = "item.wdf"
wds[12] = 0x12656D50
wds[13] = 0xC15447DE
elseif wd == "钢圈" then
wds[1] = "皮布围成的项圈，可以起到防御作用"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 15
wds[11] = "item.wdf"
wds[12] = 0x51FE104E
wds[13] = 0xF0E9FA42
elseif wd == "荆棘环" then
wds[1] = "荆棘围成的项圈，可以起到防御作用"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 25
wds[11] = "item.wdf"
wds[12] = 0x150942F1
wds[13] = 0x82D15D47
elseif wd == "骨环" then
wds[1] = "骨头围成的项圈，可以起到防御作用"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 35
wds[11] = "item.wdf"
wds[12] = 0x66F4FC81
wds[13] = 0x1A425603
elseif wd == "青铜颈环" then
wds[1] = "铜做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 45
wds[11] = "item.wdf"
wds[12] = 0x56ABA89B
wds[13] = 0x2EDB4111
elseif wd == "玛瑙石环" then
wds[1] = "玛缁做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 55
wds[11] = "item.wdf"
wds[12] = 0x1752FDDE
wds[13] = 0x57655BFD
elseif wd == "琉璃环" then
wds[1] = "琉璃的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 65
wds[11] = "item.wdf"
wds[12] = 0x7120F39D
wds[13] = 0x8BA2F5BA
elseif wd == "九曲环" then
wds[1] = "银做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 75
wds[11] = "item.wdf"
wds[12] = 0xD75A17B9
wds[13] = 0xD1149C66
elseif wd == "笼玉环" then
wds[1] = "玉做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 85
wds[11] = "item.wdf"
wds[12] = 0x6E4AFA78
wds[13] = 0xE18E7C61
elseif wd == "嵌宝金环" then
wds[1] = "金做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 95
wds[11] = "item.wdf"
wds[12] = 0xC3B2AC98
wds[13] = 0xC33B353A
elseif wd == "玳瑁环" then
wds[1] = "玳瑁做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 105
wds[11] = "item.wdf"
wds[12] = 0xC11EADEC
wds[13] = 0x0D69C740
elseif wd == "七星宝环" then
wds[1] = "寒冰沂蒙精心给大家制作的手环，戴上他可以秒天秒地秒空气"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 115
wds[11] = "item.wdf"
wds[12] = 0x286FA969
wds[13] = 0x20E98108
elseif wd == "缚龙圈" then
wds[1] = "龙筋做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 125
wds[11] = "item.wdf"
wds[12] = 0x9BB95D35
wds[13] = 0xD002593F
elseif wd == "鸾尾环" then
wds[1] = "凤凰的羽毛做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 135
wds[11] = "item.wdf"
wds[12] = 0x8BC3A051
wds[13] = 0x60B55501
elseif wd == "织锦颈圈" then
wds[1] = "锦做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] =145
wds[11] = "item.wdf"
wds[12] = 0xF398CA2B
wds[13] = 0x34F1297C
elseif wd == "冰蚕丝圈" then
wds[1] = "冰蚕丝做的项圈"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[5] = 155
wds[11] = "item.wdf"
wds[12] = 0xCAF49FBE
wds[13] = 0x62C51769
elseif wd == "竹藤甲" then
wds[1] = "竹藤制成的衣服，可以起到防御作用。"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 5
wds[11] = "item.wdf"
wds[12] = 0x440C4E35
wds[13] = 0xE497BC0E
elseif wd == "皮甲" then
wds[1] = "皮布制成的衣服，可以起到防御作用"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 15
wds[11] = "item.wdf"
wds[12] = 0x6670FC2C
wds[13] = 0x157D0DC8
elseif wd == "刺甲" then
wds[1] = "精铁制成的衣服，可以起到防御作用"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 25
wds[11] = "item.wdf"
wds[12] = 0xC8E4088B
wds[13] = 0x8D252B7B
elseif wd == "骨排甲" then
wds[1] = "骨头制成的衣服，可以起到防御作用"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 35
wds[11] = "item.wdf"
wds[12] = 0x49C82067
wds[13] = 0x749824D3
elseif wd == "青铜披甲" then
wds[1] = "铜做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 45
wds[11] = "item.wdf"
wds[12] = 0xB9E7C15C
wds[13] = 0x6D01B1A3
elseif wd == "玛瑙软甲" then
wds[1] = "玛缁做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 55
wds[11] = "item.wdf"
wds[12] = 0xAE0769A0
wds[13] = 0xC7E186AA
elseif wd == "琉璃罩甲" then
wds[1] = "琉璃的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 65
wds[11] = "item.wdf"
wds[12] = 0x29804071
wds[13] = 0x9023B123
elseif wd == "连环铠甲" then
wds[1] = "银做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 75
wds[11] = "item.wdf"
wds[12] = 0x2FCBE79A
wds[13] = 0x090B5B8A
elseif wd == "笼玉甲" then
wds[1] = "玉做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 85
wds[11] = "item.wdf"
wds[12] = 0xF8F0B550
wds[13] = 0x1255FE4D
elseif wd == "嵌宝金甲" then
wds[1] = "金做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 95
wds[11] = "item.wdf"
wds[12] = 0x234C440C
wds[13] = 0xF7BC24CE
elseif wd == "玳瑁衣" then
wds[1] = "玳瑁做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 105
wds[11] = "item.wdf"
wds[12] = 0x563F5BD1
wds[13] = 0x16275C8E
elseif wd == "七星宝甲" then
wds[1] = "寒冰沂蒙精心为大家做的铠甲，戴上后可以秒天秒地秒空气"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 115
wds[11] = "item.wdf"
wds[12] = 0x5E6FC760
wds[13] = 0x5037E497
elseif wd == "缚龙甲" then
wds[1] = "龙筋做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 125
wds[11] = "item.wdf"
wds[12] = 0x04037AC1
wds[13] = 0xD0125017
elseif wd == "凤凰彩衣" then
wds[1] = "凤凰的羽毛做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 135
wds[11] = "item.wdf"
wds[12] = 0xED7A9BFE
wds[13] = 0xC47A3765
elseif wd == "织锦软褡" then
wds[1] = "锦做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 145
wds[11] = "item.wdf"
wds[12] = 0xC77EE0B7
wds[13] = 0x4E5F4830
elseif wd == "冰蚕织甲" then
wds[1] = "冰蚕丝做的铠甲"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[5] = 155
wds[11] = "item.wdf"
wds[12] = 0x1F3F4E97
wds[13] = 0x9C023588
elseif wd == "竹编护腕" then
wds[1] = "竹子做的护腕，可以起到伤害力"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 5
wds[11] = "item.wdf"
wds[12] = 0x53F8EBA5
wds[13] = 0x809C04C8
elseif wd == "皮腕" then
wds[1] = "皮布做的护腕，可以起到伤害力"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 15
wds[11] = "item.wdf"
wds[12] = 0x336A2EC6
wds[13] = 0xA8F7F6C0
elseif wd == "针腕" then
wds[1] = "针做的护腕，可以起到伤害力"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 25
wds[11] = "item.wdf"
wds[12] = 0xC1A4E276
wds[13] = 0x1C28FB6F
elseif wd == "骨镯" then
wds[1] = "骨头做的护腕，可以起到伤害力"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 35
wds[11] = "item.wdf"
wds[12] = 0x47680171
wds[13] = 0xDB529E26
elseif wd == "青铜护腕" then
wds[1] = "铜做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 45
wds[11] = "item.wdf"
wds[12] = 0x152B263E
wds[13] = 0x9D0CFE72
elseif wd == "玛瑙护腕" then
wds[1] = "玛缁做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 55
wds[11] = "item.wdf"
wds[12] = 0xB3405C3F
wds[13] = 0xDD8EA49F
elseif wd == "琉璃护腕" then
wds[1] = "琉璃的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 65
wds[11] = "item.wdf"
wds[12] = 0x3FB923E4
wds[13] = 0xC7A0F7FB
elseif wd == "镂空银镯" then
wds[1] = "银做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 75
wds[11] = "item.wdf"
wds[12] = 0xB7B54543
wds[13] = 0xE168F7C1
elseif wd == "笼玉镯" then
wds[1] = "玉做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 85
wds[11] = "item.wdf"
wds[12] = 0x307ACF93
wds[13] = 0xFEE14584
elseif wd == "嵌宝金腕" then
wds[1] = "金做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 95
wds[11] = "item.wdf"
wds[12] = 0xBD98D975
wds[13] = 0xA87273E4
elseif wd == "玳瑁护腕" then
wds[1] = "玳瑁做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 105
wds[11] = "item.wdf"
wds[12] = 0x91CD16B5
wds[13] = 0x0B4042DF
elseif wd == "七星宝腕" then
wds[1] = "寒冰沂蒙精心给大家的护腕，戴上这个可以秒天秒地秒空气"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 115
wds[11] = "item.wdf"
wds[12] = 0x2DEC7C4E
wds[13] = 0x158E1623
elseif wd == "缚龙筋" then
wds[1] = "龙筋做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 125
wds[11] = "item.wdf"
wds[12] = 0x639CF6A5
wds[13] = 0xEA7D3F1C
elseif wd == "凤翎护腕" then
wds[1] = "凤凰的羽毛做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 135
wds[11] = "item.wdf"
wds[12] = 0x5AA77450
wds[13] = 0xD0B093D0
elseif wd == "织锦彩带" then
wds[1] = "锦做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 145
wds[11] = "item.wdf"
wds[12] = 0x196F1418
wds[13] = 0xF15B5332
elseif wd == "冰蚕丝带" then
wds[1] = "冰蚕丝做的护腕"
wds[2] = 2
wds[3] = 7
wds[4] = 1
wds[5] = 155
wds[11] = "item.wdf"
wds[12] = 0x27ECB10D
wds[13] = 0xD015AE2E
elseif wd == "玄冰刺" then
wds[1] = "吸玄冰阴寒之气，可以直透骨骸"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 50
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3220766446
wds[13] = 1038526054
elseif wd == "鲫鱼" then
wds[1] = "体态雍容,有鱼中君子之称"
wds[2] = 10
wds[3] = 2
wds[4] = 6
wds[11] = "item.wdf"
wds[12] = 392448174
wds[13] = 3721203032
elseif wd == "震天锤" then
wds[1] = "寒钢制成的锤头巨大沉重，一击之下威势震天"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 60
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1233600514
wds[13] = 3915438961
elseif wd == "百折扇" then
wds[1] = "采用非常多的扇骨，扇面百折，非常坚固"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 40
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 742792031
wds[13] = 972230490
elseif wd == "缨络丝带" then
wds[1] = "红色的缨络结成的丝带，可以起到防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 40
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1901332626
wds[13] = 1222266422
elseif wd == "腰带" then
wds[1] = "一条普通的腰带，可以起到防御的作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 581742663
wds[13] = 1978200666
elseif wd == "钢甲" then
wds[1] = "用精钢制成的铠甲，防御能力较强"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 50
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1672609844
wds[13] = 1862358389
elseif wd == "宝雕长弓" then
wds[1] = "乌木长弓，弓身镌刻之宝雕，栩栩如生，振翅欲飞。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 30
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2253432731
wds[13] = 1106872316
elseif wd == "金丝魔棒" then
wds[1] = "棒身缠以金丝，显得华丽"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 10
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 2190248338
wds[13] = 850861563
elseif wd == "炼妖石" then
wds[1] = "从仙界散落到人间的“灵”石，拥有强烈的吸附能量的能力。"
wds[2] = 3
wds[3] = 3
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 94724302
wds[13] = 164529735
elseif wd == "上古锻造图策" then
wds[1] = "古代的典籍，详细记录了各种护具的锻造方法。"
wds[2] = 3
wds[3] = 10
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x9F6993FA
wds[13] = 0xF2379F81
elseif wd == "天眼珠" then
wds[1] = "吸收了一定的生物潜能，再通过特别的方式将此潜能转化到召唤兽装备上。"
wds[2] = 3
wds[3] = 11
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xD29E5ECE
wds[13] = 0x859C0204
elseif wd == "八卦阵书" then
wds[1] = "记载着八卦阵奥秘的秘籍，学习后可掌握八卦阵。"
wds[2] = 13
wds[3] = 3
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 4271545734
wds[13] = 1264860140
elseif wd == "天阵眼" then
wds[1] = "蕴含天象之力的阵眼，用于提升八卦阵的伤害属性。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "地阵眼" then
wds[1] = "蕴含地脉之力的阵眼，用于提升八卦阵的防御、法防属性。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "风阵眼" then
wds[1] = "蕴含风灵之力的阵眼，用于提升八卦阵的速度属性。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "云阵眼" then
wds[1] = "蕴含云霞之力的阵眼，用于提升八卦阵的法伤属性。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "雷阵眼" then
wds[1] = "蕴含雷霆之力的阵眼，用于提升八卦阵的固伤及宠物伤害属性。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "大闸蟹" then
wds[1] = "右键使用可以增加15点积分"
wds[2] = 10
wds[3] = 3
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2720292819
wds[13] = 2971511263
elseif wd == "马靴" then
wds[1] = "皮制的马靴，可以起到防御的作用"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 20
wds[11] = "item.wdf"
wds[12] = 3241248586
wds[13] = 3542020689
elseif wd == "藤圈" then
wds[1] = "藤条围成的项圈，可以起到防御作用"
wds[2] = 2
wds[3] = 8
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 4170754053
wds[13] = 2301647242
elseif wd == "侠客履" then
wds[1] = "非常强的鞋，速度和防御作用都属上品"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 30
wds[11] = "item.wdf"
wds[12] = 32184820
wds[13] = 558037323
elseif wd == "八卦坠" then
wds[1] = "以八卦制成的饰物，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 1357232476
wds[13] = 3364357037
elseif wd == "细木棒" then
wds[1] = "看似细小却有不小的威力，可以当作兵器防身"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3647840943
wds[13] = 445770073
elseif wd == "大黄鱼" then
wds[1] = "常见于近海深水区域，身型修长"
wds[2] = 10
wds[3] = 2
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 2350785153
wds[13] = 2912558181
elseif wd == "牛筋鞭" then
wds[1] = "以上等牛筋制成，弹性极佳，抽之有破空之声"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 10
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 156247531
wds[13] = 2779337532
elseif wd == "夜魔披风" then
wds[1] = "来自阴间的披风，隐隐透出神秘的幽冥气息"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 60
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2191193414
wds[13] = 1388622524
elseif wd == "苍魂珠" then
wds[1] = "据说珠里附有魂魄，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 30
wds[11] = "item.wdf"
wds[12] = 4237594230
wds[13] = 1893159766
elseif wd == "护身符" then
wds[1] = "一块护身符，佩带在身上有一定法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2460748358
wds[13] = 359787750
elseif wd == "烈焰锤" then
wds[1] = "锤面上制造了不少火焰波浪一般的锋刃，可怕的武器"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 40
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1937110983
wds[13] = 2558099166
elseif wd == "锁子甲" then
wds[1] = "胸部是铁环，如铁锁加身，防御力相当不错"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 30
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2078226169
wds[13] = 2963205363
elseif wd == "苗刀" then
wds[1] = "苗疆常用的兵器，极细极尖锐"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 10
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 183813784
wds[13] = 3883026774
elseif wd == "青铜斧" then
wds[1] = "以硬木和青铜制造的大斧，是常用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1194618546
wds[13] = 1823715223
elseif wd == "麻衣" then
wds[1] = "麻布制成的衣服，可以起到防御作用"
wds[2] = 2
wds[3] = 9
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 3547852010
wds[13] = 276685974
elseif wd == "精钢日月圈" then
wds[1] = "精钢打造的圆环，外缘锋利"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 10
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2611939848
wds[13] = 523588802
elseif wd == "小黄鱼" then
wds[1] = "也称黄花鱼，喜欢在近海底层结群活动，是常见的海产鱼类"
wds[2] = 10
wds[3] = 2
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 3155849929
wds[13] = 1939631478
elseif wd == "方巾" then
wds[1] = "普通人常带的帽子"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 4205295661
wds[13] = 266830706
elseif wd == "青刚刺" then
wds[1] = "寒刚玉所制，坚硬无比，可断金"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 60
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 1950914816
wds[13] = 414938796
elseif wd == "蛇形月" then
wds[1] = "划动时锋刃似盘卷的黑蛇，令人防不胜防"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 60
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3576968772
wds[13] = 2783575959
elseif wd == "银腰带" then
wds[1] = "银制的腰带，可以起到防御的作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 20
wds[11] = "item.wdf"
wds[12] = 3920753159
wds[13] = 1636787949
elseif wd == "镔铁锤" then
wds[1] = "镔铁打造的锤是价廉而常被采用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 10
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2560759534
wds[13] = 2680776140
elseif wd == "如意宝珠" then
wds[1] = "琅嬛福地生香橼，百年方熟，熟而坠地，化为如意宝珠，鲜明莹洁，祥瑞兆也。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 60
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1237441752
wds[13] = 296013680
elseif wd == "青龙牙" then
wds[1] = "龙牙状的尖刺，可以透入坚固的衣甲"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 30
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3410109601
wds[13] = 2844091192
elseif wd == "曲柳杖" then
wds[1] = "柳木雕凿的法杖，蕴含一点法力，适合新手使用"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 214558735
wds[13] = 1713378827
elseif wd == "狼牙锤" then
wds[1] = "锤面密布狼牙细齿，杀伤力不可小视"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 30
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 575451669
wds[13] = 3613953095
elseif wd == "莲华珠" then
wds[1] = "来自天竺佛国的灵巧宝珠，晶莹圆润，光华四溢，置于水中，可化作轻盈莲花，净水生香。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 40
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 121754786
wds[13] = 3809551301
elseif wd == "翡翠珠" then
wds[1] = "南蛮之地进献之翡翠，经能工巧匠九琢九磨，方成玲珑宝珠，通体翠绿凝碧，触手冰凉，仿似有仙气缭绕。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 30
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3824352456
wds[13] = 3517783128
elseif wd == "玉腰弯弓" then
wds[1] = "柘木宝弓嵌以碧绿美玉，质坚且韧，精准凌厉。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 50
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3397522151
wds[13] = 106500071
elseif wd == "包子" then
wds[1] = "精面粉制作的肉包子味道非常好"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 1457520669
wds[13] = 1302655530
wds[14] = 100
elseif wd == "女儿红" then
wds[1] = "名酒，酒香浓烈"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x2ECB8558
wds[13] = 0x5F376254
wds[14] = 100
elseif wd == "臭豆腐" then
wds[1] = "虽然闻起来有些臭，吃起来很香的。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x7E096A40
wds[13] = 0xCC401415
wds[14] = 100
elseif wd == "烤鸭" then
wds[1] = "北方特产，油滑可口"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x900198D8
wds[13] = 0xAA17FF00
wds[14] = 100
elseif wd == "烤肉" then
wds[1] = "烤出的肉，非常好吃"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x775117AB
wds[13] = 0x09D51835
wds[14] = 100
elseif wd == "佛跳墙" then
wds[1] = "东吴名厨创制的一道菜，味道鲜美。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x76A70298
wds[13] = 0x01F1ED48
wds[14] = 100
elseif wd == "翡翠豆腐" then
wds[1] = "名厨名菜，炒得色香味美全。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x11D6858F
wds[13] = 0x3178273A
wds[14] = 100
elseif wd == "桂花丸" then
wds[1] = "糯米和桂花制成的食品。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0xCCC8D804
wds[13] = 0xDF9A8FAB
wds[14] = 100
elseif wd == "豆斋果" then
wds[1] = "素食品，豆面制成的各种水果。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0xEA4ED968
wds[13] = 0x58130DB3
wds[14] = 100
elseif wd == "长寿面" then
wds[1] = "一碗热气腾腾的长寿面条。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x9914F83B
wds[13] = 0xC5652305
wds[14] = 100
elseif wd == "珍露酒" then
wds[1] = "用露水酿制的美酒。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x71F4446B
wds[13] = 0xEFFC63BB
wds[14] = 100
elseif wd == "梅花酒" then
wds[1] = "梅花泡成的酒，有梅花的清香。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x717E19FF
wds[13] = 0xF8D6B828
wds[14] = 100
elseif wd == "蛇胆酒" then
wds[1] = "用蛇胆泡的美酒，具有药性。"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x6607309D
wds[13] = 0x67A3D814
wds[14] = 100
elseif wd == "虎骨酒" then
wds[1] = "虎骨泡成的酒，具有药性"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0xCD6FDF37
wds[13] = 0x46A54492
wds[14] = 100
elseif wd == "百味酒" then
wds[1] = "泡了上百味药品的药酒"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0x1FA7B36A
wds[13] = 0xFFB20F40
wds[14] = 100
elseif wd == "醉生梦死" then
wds[1] = "仙酒，瑶池会的必备佳酿"
wds[2] = 1
wds[3] = 4
wds[4] = 1
wds[8] = 1
wds[9] = 100
wds[11] = "item.wdf"
wds[12] = 0xED576385
wds[13] = 0x2B2980FB
wds[14] = 100
elseif wd == "天香披肩" then
wds[1] = "瑶台玉女穿的披肩，有相当的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 40
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3709034410
wds[13] = 3803079314
elseif wd == "琉璃珠" then
wds[1] = "三色琉璃熔成的宝珠，轻盈剔透，适合新手携带"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2607779407
wds[13] = 3954061095
elseif wd == "连珠神弓" then
wds[1] = "玲珑连珠，发机如电，一发连五，绝无虚矢。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 60
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 4094037333
wds[13] = 2641579130
elseif wd == "点金棒" then
wds[1] = "华丽的蛇形棒，相传作法之人常用其点石成金"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 30
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3187022651
wds[13] = 2074779560
elseif wd == "錾金宝弓" then
wds[1] = "黑檀宝弓，经巧匠之手精雕细錾，华贵不可方物。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 40
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 234218100
wds[13] = 706673394
elseif wd == "铁胆弓" then
wds[1] = "硬木制成的弓箭，背嵌铁条，射程很远。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 10
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1814282557
wds[13] = 2181027484
elseif wd == "鹰眼法杖" then
wds[1] = "孤鹰展翅，划破长空，依照孤鹰之形打造的法杖，蕴含神奇法力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 50
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 3849435987
wds[13] = 2058809879
elseif wd == "金背大砍刀" then
wds[1] = "刀身挺直，以黄金镶背，刀道沉猛"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 30
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1741978907
wds[13] = 3104242640
elseif wd == "佛光舍利子" then
wds[1] = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
wds[2] = 1
wds[3] = 2
wds[4] = 3
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 529664613
wds[13] = 362856580
wds[14] = 15000
elseif wd == "无极丝" then
wds[1] = "天地无极尽收于其间"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 30
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 85830180
wds[13] = 4066138115
elseif wd == "海星" then
wds[1] = "生活在深海，因身型呈五角星状而得名"
wds[2] = 10
wds[3] = 3
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 320725587
wds[13] = 1259406158
elseif wd == "牛皮靴" then
wds[1] = "牛皮缝制的靴子，速度和防御作用都比较强"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 10
wds[11] = "item.wdf"
wds[12] = 4095390557
wds[13] = 2232108129
elseif wd == "鱼骨双剑" then
wds[1] = "剑身似鱼骨，长满倒钩刺"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 50
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 741866499
wds[13] = 1761353936
elseif wd == "赤炎环" then
wds[1] = "环边有锯齿，如太阳之火焰"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 50
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 692700444
wds[13] = 609650976
elseif wd == "珍珠链" then
wds[1] = "一串珍珠，佩带在身上有一定法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 20
wds[11] = "item.wdf"
wds[12] = 2451318875
wds[13] = 4232202616
elseif wd == "牛皮鞭" then
wds[1] = "用牛皮制的皮鞭，很容易得到的练习用品"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 1637717692
wds[13] = 799104265
elseif wd == "布帽" then
wds[1] = "布制，普通人家使用的头冠"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 10
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2131362658
wds[13] = 1813515840
elseif wd == "彩果" then
wds[1] = "神奇的果子，可以改变角色的造型"
wds[2] = 8
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 567106113
wds[13] = 4251752243
elseif wd == "青藤柳叶鞭" then
wds[1] = "采深山古藤制成，上缚柳叶刀片，刀光闪动，杀气逼人"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 60
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 962191784
wds[13] = 996954971
elseif wd == "铁面扇" then
wds[1] = "连扇面也用铁片构成，更易格挡，晃动可出声，乱敌耳目"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 30
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3848744867
wds[13] = 2633687797
elseif wd == "八棱金瓜" then
wds[1] = "锤似金瓜，八棱突起，是实用的战锤"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 20
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2288044564
wds[13] = 959970229
elseif wd == "幻彩银纱" then
wds[1] = "上等蚕丝与银丝混织成的纱带"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 10
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 3727411355
wds[13] = 1872145487
elseif wd == "精钢扇" then
wds[1] = "精钢制的扇骨，可以格挡锋利的兵器攻击"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 20
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 742558490
wds[13] = 208678969
elseif wd == "鱼竿" then
wds[1] = "用于垂钓的工具"
wds[2] = 10
wds[3] = 4
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2523388870
wds[13] = 1932648737
elseif wd == "黄宝石" then
wds[1] = "闪耀着金色光彩的宝石，代表友情、友爱与希望；传说有着护主的奇效。\n增加4*宝石等级%的雷系法术吸收率\n【镶嵌对象】饰品、鞋子"
wds[2] = 12
wds[3] = 4
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2523388870
wds[13] = 1932648737
elseif wd == "珍珠头带" then
wds[1] = "珍珠结成的头带，非常好看女性饰品，可以起到防御作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 30
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3660503604
wds[13] = 1074719537
elseif wd == "紧身衣" then
wds[1] = "紧身的皮衣，非常轻便，有不错的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 40
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2338366605
wds[13] = 4031115015
elseif wd == "曲尖枪" then
wds[1] = "采用上等合木，枪尖九曲，是常用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 10
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3971589602
wds[13] = 632407849
elseif wd == "劈水扇" then
wds[1] = "挥舞之下可使狂风止，水断流"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 50
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 1676697803
wds[13] = 108510315
elseif wd == "狼牙刀" then
wds[1] = "精钢打造，刀背密布狼牙锯齿"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 60
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 2655796221
wds[13] = 295875160
elseif wd == "追星踏月" then
wds[1] = "非由于鞋上有云月图案而得名，有不错的防御力"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 1891477910
wds[13] = 4017464926
elseif wd == "黄金剑" then
wds[1] = "真金铸脊，精钢淬锋，其光灿烂夺人眼，魔障远避不及；沉于渭水，可镇河魔。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 50
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 2052074173
wds[13] = 1174324866
elseif wd == "松木锤" then
wds[1] = "松木质轻，制成的锤主要作练习用"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 753815448
wds[13] = 3891646017
elseif wd == "天蚕丝带" then
wds[1] = "以名贵天蚕丝制成，可通生命之灵气"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 40
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 794010110
wds[13] = 140768110
elseif wd == "金丝彩带" then
wds[1] = "金丝与彩缎编成的丝带"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 20
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 3086295697
wds[13] = 81211738
elseif wd == "红缨枪" then
wds[1] = "白腊木制成的枪杆，柔韧有弹性"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3032516444
wds[13] = 661869979
elseif wd == "琥珀腰链" then
wds[1] = "用琥珀制的腰链，能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 1085821316
wds[13] = 4041311819
elseif wd == "簪子" then
wds[1] = "女孩子们喜欢的簪子，可以起到防御作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 1004476789
wds[13] = 2338230752
elseif wd == "金柳露" then
wds[1] = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品#Y/(仅可作用于参战等级≤95级的召唤兽身上)"
wds[2] = 3
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 2911364506
wds[13] = 1443777343
elseif wd == "羊角盔" then
wds[1] = "以羊角为装饰的盔，有非常强的防御力"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 50
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 48596533
wds[13] = 1115249525
elseif wd == "火焰枪" then
wds[1] = "以火焰状的精铁代替枪缨，焰缘锋利无比"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 40
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 382126947
wds[13] = 2230233436
elseif wd == "九宫坠" then
wds[1] = "以九宫制成的坠子，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 40
wds[11] = "item.wdf"
wds[12] = 1591157328
wds[13] = 2581108802
elseif wd == "柳叶刀" then
wds[1] = "形如柳叶的细弯刀"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1159059801
wds[13] = 388221160
elseif wd == "竹节双剑" then
wds[1] = "精钢制成，剑身似竹节般伸长"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 30
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 1329171010
wds[13] = 2218313214
elseif wd == "龙泉剑" then
wds[1] = "精铁铸造，又以龙泉之水淬制，上刻青龙，其利无比。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 40
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 3230696706
wds[13] = 3094355456
elseif wd == "双短剑" then
wds[1] = "青铜制的双短剑，制造简单，是练习常用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 3212246691
wds[13] = 1334943898
elseif wd == "布鞋" then
wds[1] = "布缝制的鞋子，可以起到防御的作用"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 2418869371
wds[13] = 2669010133
elseif wd == "赤焰双剑" then
wds[1] = "剑身赤红，齿如焰苗窜动，有一股刚烈之势"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 60
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 1459131170
wds[13] = 1669329241
elseif wd == "青锋剑" then
wds[1] = "剑长三尺，用起来方便灵活，是常用的兵器"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 30
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 3995192813
wds[13] = 1523776943
elseif wd == "五色缎带" then
wds[1] = "五色蚕丝织成的彩缎"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 964324271
wds[13] = 359839285
elseif wd == "精钢禅钺" then
wds[1] = "精钢打造，环随舞动，铿锵入耳，震人心魄"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 40
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 4268709342
wds[13] = 1201979768
elseif wd == "玉竹金铃" then
wds[1] = "由玉制的竹节联结而成,节间缚着金铃,铃随鞭动,声声悦耳"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 50
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 462481146
wds[13] = 478344459
elseif wd == "金刺轮" then
wds[1] = "由多片精铁打造的极薄的锋刃组成，刃口白光闪闪"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 30
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 1780092674
wds[13] = 2925351135
elseif wd == "游龙剑" then
wds[1] = "剑体九曲如龙形，覆鳞片，手弹其锋刃，鸣如龙吟。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 60
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 3272689235
wds[13] = 2801949288
elseif wd == "钢结鞭" then
wds[1] = "以细钢环联结起一个个钢条，柔中带刚"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 30
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 3232417863
wds[13] = 2274385367
elseif wd == "满天星" then
wds[1] = "棒头细密的镶嵌了无数宝石，闪闪发光，似满天星辰"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 60
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3427188370
wds[13] = 1777161115
elseif wd == "吴越剑" then
wds[1] = "吴越之地产名剑，极其锐利"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 20
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 2309179882
wds[13] = 118455348
elseif wd == "锯齿矛" then
wds[1] = "枪尖三陷三突，枪杆红绸缠绕，彩缨闪动令人眼花瞭乱"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 20
wds[7] = {"神天兵","龙太子"}
wds[11] = "item.wdf"
wds[12] = 2315151120
wds[13] = 1069998337
elseif wd == "布衣" then
wds[1] = "普通的布衣，可以起到防御的作用"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2686301321
wds[13] = 2162639125
elseif wd == "水晶腰带" then
wds[1] = "佩带在腰间的水晶腰带，能起到不错的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 30
wds[11] = "item.wdf"
wds[12] = 588758831
wds[13] = 684918234
elseif wd == "乌龙鞭" then
wds[1] = "以鲨鱼皮制成，表皮毛糙，极其坚韧"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 20
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 3122588387
wds[13] = 3141830232
elseif wd == "鳞甲" then
wds[1] = "用铁鳞制成的铠甲，有相当的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 20
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 391851478
wds[13] = 2281395560
elseif wd == "铁齿剑" then
wds[1] = "铁制的短剑，边缘带齿"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 10
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 3620311050
wds[13] = 2592140397
elseif wd == "熊胆" then
wds[1] = "千年熊罴的胆"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 2
wds[9] = 200
wds[11] = "item.wdf"
wds[12] = 1374442124
wds[13] = 278044265
wds[14] = 1250
elseif wd == "水晶帽" then
wds[1] = "水晶制成的帽子，因为坚硬，有相当强的防御力"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 60
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 606790429
wds[13] = 2525896057
elseif wd == "金蛇信" then
wds[1] = "神木制杆，弯曲似蛇形，金枪透甲，腥红双叉似金蛇出信"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 70
wds[7]  = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 3443351294
wds[13] = 2134413363
elseif wd == "丈八点钢矛" then
wds[1] = "通体百精纯钢，如天雷击落、蛟龙出海"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 80
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 853333771
wds[13] = 2376999944
elseif wd == "暗夜" then
wds[1] = "通体乌黑,极细的枪尖无形中直抵咽喉,如暗夜中引魂之手"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 90
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 2297122969
wds[13] = 4085619601
elseif wd == "梨花" then
wds[1] = "锋刃五裂似梨花绽放,粉红的枪缨银白的枪,尽显潇洒风流"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 100
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 1491619643
wds[13] = 3901170806
elseif wd == "霹雳" then
wds[1] = "以万古溶岩之火锤炼，枪杆似古树盘结，枪尖似雷霆霹雳"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 100
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 1553552793
wds[13] = 1828152464
elseif wd == "刑天之逆" then
wds[1] = "刑天应劫而出，劫分天兵火水土，此即为其应兵劫之武器。形长两丈，刃如月牙，锋似寒星，身雕百龙蟠纹，挥舞直欲搅碎银汉，号为枪中霸君。"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 120
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 3591831101
wds[13] = 3656521229
elseif wd == "五虎断魂" then
wds[1] = "出如虎奔，刺如虎爪，扫如虎尾，锁如虎噬，声如虎啸；使敌魂断胆破，不战自溃，谓之“五虎断魂”，有枪中王者之气。"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 130
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 1491403685
wds[13] = 1403609878
elseif wd == "飞龙在天" then
wds[1] = "曾为文殊菩萨降妖密宝，如今幻化为一杆金龙宝枪。此枪掷出可化为飞龙，从万丈高空俯冲而下，撕碎敌人。"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 140
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 4100462769
wds[13] = 3889305017
elseif wd == "天龙破城" then
wds[1] = "天外陨石炼九日九夜，雷生地底、天坠神龙，乃成此戟。霸王项羽持之横行当世，睥睨天下，故名“天龙破城”。霸王既殁，佚于乌江，龙衔乃出。"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 150
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wdf"
wds[12] = 1375567358
wds[13] = 1041126896
elseif wd == "弑皇" then
wds[1] = "炎黄之战，杀怨之气俱归此兵。黄帝得胜，以此兵祭祀天地，誓曰:若治下三界失靖、四海不宁，则天下之人皆可持此兵取吾之首级！"
wds[2] = 2
wds[3] = 3
wds[4] = 1
wds[5] = 160
wds[7] = {"龙太子","神天兵"}
wds[11] = "item.wd1"
wds[12] = 439395128
wds[13] = 127581936
elseif wd == "狂魔镰" then
wds[1] = "沉于万魔之地，染魔性，映魔心，挥之即魔瘴四起"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 70
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2105378421
wds[13] = 1325914922
elseif wd == "恶龙之齿" then
wds[1] = "寒钢为柄，龙齿为刃，风过龙鸣，摄破敌胆"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 80
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2656260066
wds[13] = 2796123546
elseif wd == "破魄" then
wds[1] = "集艳日与阴月之精华，挥舞如日月同晖，中者形神俱灭"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 90
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 3159282811
wds[13] = 4245622670
elseif wd == "肃魂" then
wds[1] = "吸取无尽黑暗之气，肃清无规、无序、无章之魂"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 100
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 0x2D6D80DE
wds[13] = 0x1CE23AB4
elseif wd == "无敌" then
wds[1] = "斧杆以千年古木之根打造，盘桓虬曲；寒铁锻造的双面巨斧发出魔气逼人的暗光"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 110
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 872395348
wds[13] = 3255150154
elseif wd == "五丁开山" then
wds[1] = "古蜀有五力士奉命凿通群山，见一大蛇尾在洞外，乃曳之出，其身长数十里。惊讶间，山崩，五丁与蛇俱死，化为神斧，执之者有开山之力。"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 120
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1781160921
wds[13] = 354227088
elseif wd == "元神禁锢" then
wds[1] = "阴司轮转王司过之宝。若有鬼仙犯大恶，即以此物拟其头，吸尽元神，再无转生可能。细看刃缘，可见无数痛苦鬼脸。"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 130
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1793469736
wds[13] = 3058265679
elseif wd == "护法灭魔" then
wds[1] = "佛门护法之武器，柄为鲁班所雕吴刚伐桂之枝，斧为老君所炼炉中千年玄铁，上有佛门梵文，妖怪见之退避三舍。"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 140
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 3099472859
wds[13] = 2571183494
elseif wd == "碧血干戚" then
wds[1] = "刑天与帝争神，身首异处，碧血零落，干缺戚残；后人冶于一炉乃得神兵。长戚舞处，风云雷动，碧波流转，巨盾透体而出，其鸣呜咽，如英雄泣。"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 150
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 3681089967
wds[13] = 1076008261
elseif wd == "裂天" then
wds[1] = "蚩尤随身魔武之一，取大荒四极异兽骨所制，形如巨镰，镰刃淬海皇兽魂，隐然有嘶鸣之声，裂天笞地，割风断雨。"
wds[2] = 2
wds[3] = 3
wds[4] = 2
wds[5] = 160
wds[7] = {"巨魔王","虎头怪"}
wds[11] = "item.wd1"
wds[12] = 3711850827
wds[13] = 1944978391
elseif wd == "北斗七星剑" then
wds[1] = "精炼白金之铁铸造，有北斗七星之纹饰"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 70
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1102206433
wds[13] = 2931293335
elseif wd == "碧玉剑" then
wds[1] = "以寒冰碧玉制成,剑身如竹节,刚硬无比,难得的奇珍之物"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 80
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 3706066988
wds[13] = 2167893769
elseif wd == "鱼肠" then
wds[1] = "上古名剑，细短柔软，可入鱼腹"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 90
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 703624793
wds[13] = 3087768505
elseif wd == "倚天" then
wds[1] = "上古名剑，雾中山神铁所制，剑光如电，切金如泥"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 100
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1234219918
wds[13] = 1100401070
elseif wd == "湛卢" then
wds[1] = "上古名剑，剑身宽大，湛然如墨，骨锻其脊，血淬其锋，成绝世名剑"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 100
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1556155532
wds[13] = 559555740
elseif wd == "魏武青虹" then
wds[1] = "通体青亮如玉，长八尺余，可于千里外取人首级，吸血如虹。曾为魏王曹操配剑，后在战乱中失传，如今又重现江湖。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 120
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1705858659
wds[13] = 2821638391
elseif wd == "灵犀神剑" then
wds[1] = "剑长七寸，有鼻有眼，与主人心有灵犀。常藏于宝葫芦内，主人有令，则出三丈白光扣敌泥丸宫，尽斩仙魔鬼神。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 130
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 2712960569
wds[13] = 866429909
elseif wd == "四法青云" then
wds[1] = "上有符印，分别为地，火，风，水四字。挥舞时天昏地暗，火蛇狂舞，飞沙走石，龙腾海啸。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 140
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 1749029011
wds[13] = 1989171435
elseif wd == "霜冷九州" then
wds[1] = "冰晶雪魄，浑然天成；出则霜华满地，朔风回舞。其气凛冽，砭人肌骨；其意萧条，山川寂寥。乃天下至寒至洁之物，惟赤子心可驭之。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 150
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wdf"
wds[12] = 2892720118
wds[13] = 1286710645
elseif wd == "擒龙" then
wds[1] = "上古魔神所铸神兵，可抗八部天龙。型如鱼骨，伸缩随心；刃化千万剑丝，柔如春蚕吐丝，韧如天地经纬。"
wds[2] = 2
wds[3] = 3
wds[4] = 3
wds[5] = 160
wds[7] = {"逍遥生","剑侠客","偃无师"}
wds[11] = "item.wd1"
wds[12] = 1088458361
wds[13] = 3004473909
elseif wd == "墨玉双剑" then
wds[1] = "体采寒冰墨玉所制，暗光流动"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 70
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 3841664619
wds[13] = 3428424501
elseif wd == "梅花双剑" then
wds[1] = "千年古木所制，剑似梅枝"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 80
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 956549407
wds[13] = 353661251
elseif wd == "阴阳" then
wds[1] = "赤阳之铁成阳，玄冰之玉成阴，两仪相生，气韵非凡"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 90
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 2351851050
wds[13] = 2463244045
elseif wd == "月光双环" then
wds[1] = "清明无暇，似映月之光"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 100
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3562014914
wds[13] = 2953019352
elseif wd == "灵蛇" then
wds[1] = "采千年寒冰碧玉制成，通体碧绿，剑出似灵蛇出洞"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 100
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 3192742770
wds[13] = 1950373522
elseif wd == "金龙双剪" then
wds[1] = "传说乃是一对金龙所化，头并头如剑，尾交尾如股。从半空中呼啸而下，一绞之力无人能挡。"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 120
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 2674540671
wds[13] = 2242603958
elseif wd == "连理双树" then
wds[1] = "一对痴情男女坟前精魂所化双树，攀枝连理，象征在世虽不能合枕，来世愿永无分离。以此木为剑，因至情贯其中，也可成绕指柔，也可以断金玉。"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 130
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 835871520
wds[13] = 1841177480
elseif wd == "祖龙对剑" then
wds[1] = "三国时蜀帝刘备所用双剑。据说一为白龙所化，一为赤龙所化。白龙乃是秦皇，赤龙乃是汉祖。执之者当有九五之尊。"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 140
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 4254611708
wds[13] = 3430248664
elseif wd == "紫电青霜" then
wds[1] = "鸿蒙灵气所钟，诸天精魄所禳。异器天生，一派自然。紫电稚弱，性如婴孩；青霜老沉，俨如兄长。翛忽隐现，捷如流星，啾啾呢喃，紫燕青虬。"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 150
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 1921395100
wds[13] = 3349222718
elseif wd == "浮犀" then
wds[1] = "九天玄女以夔牛之角所制双剑，锋锐无双，轻如无物，曾助黄帝擒杀蚩尤。其上书天书密咒，丹血为文，翠莹如碧。"
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 160
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wd1"
wds[12] = 3650328746
wds[13] = 2262501629
elseif wd == "缚神绫" then
wds[1] = "丝带可紧可松，传言可缚神灵"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 70
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 2774766030
wds[13] = 316900368
elseif wd == "九天仙绫" then
wds[1] = "存于九天，吸日月玄灵"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 80
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 812342002
wds[13] = 262652275
elseif wd == "彩虹" then
wds[1] = "以七彩天蚕丝制成，似天边彩虹"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 90
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 1130709640
wds[13] = 3920434794
elseif wd == "流云" then
wds[1] = "流光溢彩，似天边云彩幻生幻灭"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 100
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 1567038678
wds[13] = 2712300537
elseif wd == "碧波" then
wds[1] = "聚海之灵气，碧波起，天地清"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 100
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 3222386953
wds[13] = 2391803383
elseif wd == "秋水落霞" then
wds[1] = "“落霞与孤鹜齐飞，秋水共长天一色。”此带乃天女掬长空之色，染落霞之艳织成。展开绚烂无比，使人俗念顿消，心无点尘。"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 120
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 604608093
wds[13] = 1182432751
elseif wd == "晃金仙绳" then
wds[1] = "“此物可随主人意捆住神仙魔怪，令其不能再施展变化之术。且此绳坚韧异常，火烧刀砍不断。"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 130
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 730252838
wds[13] = 2065742633
elseif wd == "此最相思" then
wds[1] = "“道是无情却有情，从来最苦是相思。”此物乃太虚幻境警幻仙子敕令还情债之物，一旦缠住，至死方休；虽有金石心，也顿为绕指柔，神仙难逃。"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 140
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 1161776179
wds[13] = 1438567800
elseif wd == "揽月摘星" then
wds[1] = "翩若惊鸿，婉若游龙，仿佛兮若轻云之蔽月，飘飖兮若流风之回雪。三垣为画布，此带为软毫，可清夜起舞，拟为漫天星宿平添花鸟虫鱼。"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 150
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wdf"
wds[12] = 3130490807
wds[13] = 1909699944
elseif wd == "九霄" then
wds[1] = "九霄澄云所凝，诸天护佑，乾坤氤氲。形随意动，其高则冠盖乎九霄，其旷则笼罩乎八隅，祥瑞纷现，异香扑鼻。"
wds[2] = 2
wds[3] = 3
wds[4] = 5
wds[5] = 160
wds[7] = {"舞天姬","玄彩娥","桃夭夭"}
wds[11] = "item.wd1"
wds[12] = 3468947580
wds[13] = 3104627686
elseif wd == "华光刺" then
wds[1] = "百炼纯钢打造，华光刺目"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 70
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 1028689229
wds[13] = 127658579
elseif wd == "龙鳞刺" then
wds[1] = "金色似龙鳞的针刺"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 80
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 111030939
wds[13] = 1177500748
elseif wd == "撕天" then
wds[1] = "天如幕，白光起，破九重天"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 90
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3339488013
wds[13] = 1471615949
elseif wd == "毒牙" then
wds[1] = "恐惧，只有经历无尽虚空中袭来的毒牙才知其真意"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 100
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3832046145
wds[13] = 3854364995
elseif wd == "胭脂" then
wds[1] = "血红的颜色，胭脂的香气，将缤纷的灵魂凝结为黑白"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 100
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3460551634
wds[13] = 3441823945
elseif wd == "九阴勾魂" then
wds[1] = "爪有九刺，阴寒冷酷，破颅勾魂，使正道名门闻之色变。为地藏王所得，将要销毁，不知何人盗出，又重现江湖。"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 120
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 393789023
wds[13] = 3180402786
elseif wd == "雪蚕之刺" then
wds[1] = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 130
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 2033558106
wds[13] = 712813114
elseif wd == "贵霜之牙" then
wds[1] = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 140
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3540442244
wds[13] = 989722994
elseif wd == "忘川三途" then
wds[1] = "忘川为生死界河，水分三途，缓急不同。此爪凝三途之水，可证罪业，望之似缓，暗流甚疾。伤者不可骤脱，如坠地狱、饿鬼、畜生道。"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 150
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wdf"
wds[12] = 4114737939
wds[13] = 1943604910
elseif wd == "离钩" then
wds[1] = "鸿蒙初辟，混沌之气混焉；后清浊渐离，有神识之气胶而不舍，亦聚亦离，愁丝千丈，钩绊难舍，岁月风化遂成离钩。"
wds[2] = 2
wds[3] = 3
wds[4] = 6
wds[5] = 160
wds[7] = {"狐美人","骨精灵","鬼潇潇","影精灵"}
wds[11] = "item.wd1"
wds[12] = 3368946268
wds[13] = 3833664365
elseif wd == "阴风扇" then
wds[1] = "扇骨采玄冰制，阴风习习，让人不寒而粟"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 70
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 1174967558
wds[13] = 466225414
elseif wd == "风云雷电" then
wds[1] = "气势勇猛的大型折扇，扇开似风云突变，扇出似雷鸣电闪"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 80
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3812625478
wds[13] = 876675307
elseif wd == "太极" then
wds[1] = "包容太极于其内，博采天地之灵气"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 90
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 795792061
wds[13] = 2262423432
elseif wd == "玉龙" then
wds[1] = "白玉制的扇骨，优雅灵巧，似白龙出海"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 100
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3052815805
wds[13] = 896644877
elseif wd == "秋风" then
wds[1] = "一纸折扇，荡平天下事，一缕秋风，吹尽凡尘心"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 100
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 516817499
wds[13] = 1806626143
elseif wd == "画龙点睛" then
wds[1] = "本是一把普通的折扇，只因张僧繇画神龙于上，并点其睛，挥动时则隐有风雷之声、云雨之气，展开更有神龙奔出。"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 120
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 848845144
wds[13] = 1782681953
elseif wd == "秋水人家" then
wds[1] = "扇面上所画《秋水人家图》出神入化，栩栩如生；展扇更可进入其中，游山玩水，身临其境。其中定有道家仙法无疑。"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 130
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 2332586416
wds[13] = 1923582221
elseif wd == "逍遥江湖" then
wds[1] = "持此扇行走江湖，可预先知晓福祸吉凶。据说是钦天监台正先生袁天罡书奇门妙法于其上，方使此扇有逍遥美名。"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 140
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 1361205238
wds[13] = 1457973706
elseif wd == "浩气长舒" then
wds[1] = "持之若登高望远，五湖四海俱在眼前。不以物喜，不以己悲，心旷神怡，宠辱偕忘。感浩然之气至大至刚，以直养而无害，充盈天地。不亦快哉！"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 150
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wdf"
wds[12] = 3595165574
wds[13] = 2725529530
elseif wd == "星瀚" then
wds[1] = "三垣中坠，不知其故。展则漫天星辰失色，收则幽渺万籁无声。万顷星瀚，无始无终，无他无我，怎不使人目眩神驰？"
wds[2] = 2
wds[3] = 3
wds[4] = 7
wds[5] = 160
wds[7] = {"逍遥生","龙太子"}
wds[11] = "item.wd1"
wds[12] = 2182063168
wds[13] = 1649810470
elseif wd == "水晶棒" then
wds[1] = "通体以水晶制成，棒头镶嵌了纯净的水晶球，灵光闪闪"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 70
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3433794516
wds[13] = 1032230318
elseif wd == "日月光华" then
wds[1] = "棒端有日月神珠，半黑半白，收太极其内，五行其间"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 80
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 1445409930
wds[13] = 345311421
elseif wd == "沧海" then
wds[1] = "静如海之渊深博从，动似海之激荡翻腾"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 90
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3417923595
wds[13] = 32733626
elseif wd == "红莲" then
wds[1] = "碧杆红莲，阅众生相，度众生孽"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 100
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 2931792494
wds[13] = 2090478337
elseif wd == "盘龙" then
wds[1] = "身若九曲盘龙，口吞八卦金珠"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 100
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 2599922092
wds[13] = 1006965180
elseif wd == "降魔玉杵" then
wds[1] = "乃一块绝世好玉雕刻而成，杵头刻有仙家符咒。拿在手中，轻如鸿毛，打在人身，重如泰山。"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 120
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 969185484
wds[13] = 1480701803
elseif wd == "青藤玉树" then
wds[1] = "翡翠藤蔓缠绕于碧玉树干之上，红宝石所雕的鲜花正怒放枝头；它是完美的艺术品，更是仙家妙宝、除魔利器。"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 130
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 3608519305
wds[13] = 1933825756
elseif wd == "墨玉骷髅" then
wds[1] = "魔棒上镶嵌着一个刻画精美的墨水晶骷髅，流露出神秘的死亡气息，似乎与地府有很深的渊源。"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 140
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 758533892
wds[13] = 1365535468
elseif wd == "丝萝乔木" then
wds[1] = "上古仙侣所化，丝萝出尘，花分五色；中为桐木，曾栖彩凤。千秋万载，其情不泯。仙气缠绕，百邪不侵：“醉向丝萝惊自醒，与君清耳听松湍。”"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 150
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wdf"
wds[12] = 832692260
wds[13] = 18189260
elseif wd == "醍醐" then
wds[1] = "天地未分时，混沌有异树，亿万年长成，亿万年花开，亿万年结果，果落化为醍醐。持此杖者洞悉天地，与万物同息。"
wds[2] = 2
wds[3] = 3
wds[4] = 8
wds[5] = 160
wds[7] = {"玄彩娥","骨精灵","影精灵"}
wds[11] = "item.wd1"
wds[12] = 493750456
wds[13] = 3429406352
elseif wd == "巨灵神锤" then
wds[1] = "巨灵神所用神锤，锤似流星，非凡力可举，可挡十万天兵"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 70
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 4112468633
wds[13] = 977830532
elseif wd == "天崩地裂" then
wds[1] = "静似天柱巍巍，动则天崩地裂"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 80
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 708738253
wds[13] = 1573610528
elseif wd == "八卦" then
wds[1] = "八卦其间，太极天成，天地造化，混沌无常"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 90
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 4244312578
wds[13] = 928644092
elseif wd == "鬼牙" then
wds[1] = "以万炼钢，合猛鬼牙，噬三界"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 100
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 737823355
wds[13] = 25218036
elseif wd == "雷神" then
wds[1] = "一击天地轰鸣，再击电光四起，三击万物俱灰"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 100
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 3048546465
wds[13] = 4287755866
elseif wd == "混元金锤" then
wds[1] = "锤按六道之纹，柄接阴阳之气，持之者自有五行造化，诸天看护。"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 120
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1164647107
wds[13] = 2379160869
elseif wd == "九瓣莲花" then
wds[1] = "此锤乃仙池中的一朵婷婷玉莲，花开九瓣，蕊露金蓬。不知被谁采来，炼为兵器。虽已过五百年，依然盛开如新发。"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 130
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 2151061457
wds[13] = 432377528
elseif wd == "鬼王蚀日" then
wds[1] = "斩魔王之头为锤，隐隐发出邪气，使日月无光。执此物则将与魔神契约，可拥魔王之力。"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 140
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 1075077021
wds[13] = 3952974465
elseif wd == "狂澜碎岳" then
wds[1] = "水神共工至宝，内收九曲黄河，出则天地齐喑，奔涛如雷。共工怒触不周山，天柱折地维绝，水潦尘埃俱归东南，双锤亦泯然其中，为黄帝所得。"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 150
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wdf"
wds[12] = 3300988828
wds[13] = 3989323201
elseif wd == "碎寂" then
wds[1] = "盘古龙齿所化，固若金汤。嘘为风雨，吹为雷电，舞之铿锵如鸣金铁，乃天下至阳至刚之物，邪魔宵小望之丧魂。"
wds[2] = 2
wds[3] = 3
wds[4] = 9
wds[5] = 160
wds[7] = {"神天兵","虎头怪"}
wds[11] = "item.wd1"
wds[12] = 0xEA5B0F34
wds[13] = 0xE977DF0B
elseif wd == "雷鸣嗜血鞭" then
wds[1] = "管节空洞，银钩闪闪，挥动时隐隐有风雷之音"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 70
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 1854489623
wds[13] = 3234780066
elseif wd == "混元金钩" then
wds[1] = "混元钢索之上缚有金钩，追命勾魂"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 80
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 0x6182C9F2
wds[13] = 0x8AB6DF4B
elseif wd == "龙筋" then
wds[1] = "以恶龙之筋制成，挥舞若龙腾"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 90
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 1054575251
wds[13] = 2303382990
elseif wd == "百花" then
wds[1] = "龙藤塑其筋，百花其上，集仙灵之气，香飘四海"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 100
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 3472315232
wds[13] = 1331779470
elseif wd == "吹雪" then
wds[1] = "鞭上石晶经千年生长，成雪花密布，映日月之光"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 100
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 3293208513
wds[13] = 1657462890
elseif wd == "游龙惊鸿" then
wds[1] = "此鞭舞之矫如游龙，翩若惊鸿，宛如活物。据传是因仙家点化，方有此功效。"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 120
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 722618703
wds[13] = 3699553560
elseif wd == "仙人指路" then
wds[1] = "此鞭之奇，在于打斗时会自寻敌之弱点，或攻或守，或点或缠，如仙人指路，变化万端；又如灵蛇狂舞，眼花缭乱。"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 130
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 2337416369
wds[13] = 3100047545
elseif wd == "血之刺藤" then
wds[1] = "此鞭遍体生有倒刺，散发黑色邪气。据传打斗之时会如巨蟒缠住敌人，倒刺嵌入敌人体内，吸食其血肉。"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 140
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 3451408733
wds[13] = 3574831487
elseif wd == "牧云清歌" then
wds[1] = "此鞭具大神通，持之则神虑清明，可驭使万物。苍穹为牧野，云霞为羔犊，驱鞭行九天，驭风乘云，竞雷逐电。"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 150
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wdf"
wds[12] = 422685665
wds[13] = 4192744388
elseif wd == "霜陨" then
wds[1] = "昆仑之巅有涧曰冰溪，灿然如银，凝霜聚雪。溪流九曲，矫然若蛟，后凝为软玉长鞭，姑射仙子倚为护身仙器。"
wds[2] = 2
wds[3] = 3
wds[4] = 10
wds[5] = 160
wds[7] = {"英女侠","狐美人"}
wds[11] = "item.wd1"
wds[12] = 3829142397
wds[13] = 522032539
elseif wd == "子母双月" then
wds[1] = "锋刃似弯月一般交错，可四面制敌"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 70
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3736409706
wds[13] = 1612643041
elseif wd == "斜月狼牙" then
wds[1] = "青玉制成，锋似狼牙"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 80
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 4116561830
wds[13] = 2276604919
elseif wd == "如意" then
wds[1] = "白玉制成，光滑清丽，如意随心"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 90
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2711948052
wds[13] = 952271091
elseif wd == "乾坤" then
wds[1] = "集天地乾坤之灵，可制万物"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 100
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2571022629
wds[13] = 338904132
elseif wd == "月光" then
wds[1] = "清明无暇，似映月之光"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 100
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3562014914
wds[13] = 2953019352
elseif wd == "别情离恨" then
wds[1] = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 120
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2437493189
wds[13] = 3959090370
elseif wd == "金玉双环" then
wds[1] = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 130
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 2908362125
wds[13] = 1659862730
elseif wd == "九天金线" then
wds[1] = "此物套在手上，金光闪闪。圈飘金线，声音清越，守中有攻，刚柔并济，使敌人不知所措。"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 140
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 1468552095
wds[13] = 2047583638
elseif wd == "无关风月" then
wds[1] = "精玉双环一名“离风”，一名“遮月”，舞之月影憧憧，别愁离绪，俱上心头。诗云：人生自是有情痴，此恨不关风与月。"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 150
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wdf"
wds[12] = 3036111619
wds[13] = 3104854202
elseif wd == "朝夕" then
wds[1] = "此双环伴日月而生，沐浴光华，吞吐烟云，三清将其置于天穹之上，日夜吸纳诸天亿兆流光，朝夕霞雾源出于此。"
wds[2] = 2
wds[3] = 3
wds[4] = 11
wds[5] = 150
wds[7] = {"飞燕女","舞天姬"}
wds[11] = "item.wd1"
wds[12] = 1379061378
wds[13] = 1662428245
elseif wd == "龙鳞宝刀" then
wds[1] = "百练寒钢打造，以龙鳞装饰，身份的象征"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 70
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 668589754
wds[13] = 2944368377
elseif wd == "黑炎魔刀" then
wds[1] = "刀身透出森森鬼气，有着摄人心魄的魔力"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 80
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 162972978
wds[13] = 279098730
elseif wd == "冷月" then
wds[1] = "夜清冷，月露眉尖，笑引幽冥路"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 90
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 603925505
wds[13] = 407135953
elseif wd == "屠龙" then
wds[1] = "上古神兵，宝刀屠龙"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 100
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1961749850
wds[13] = 155455945
elseif wd == "血刃" then
wds[1] = "血红的刃，血红的光，以血洗天地"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 100
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 1138002761
wds[13] = 3952677662
elseif wd == "偃月青龙" then
wds[1] = "关公之配刀，青龙化刀柄，刀身如半月，百万军中取上将首级如探囊取物。关公死，刀柄不知去向，唯余此刀身。"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 120
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 241494943
wds[13] = 2525360226
elseif wd == "晓风残月" then
wds[1] = "迅如晓风，刃如残月。此非中土大唐之物，乃海外大食国宝刀，其上蛩伏可实现愿望之神明。但如何召唤已不可知。"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 130
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 293054687
wds[13] = 3069402462
elseif wd == "斩妖泣血" then
wds[1] = "大唐名匠半生心血所成的宝刀，因其妻子被妖魔所害，故将满腔愤恨倾注于刀中。谁能为他复仇，便以此刀相赠。"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 140
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 2680057538
wds[13] = 1425981787
elseif wd == "业火三灾" then
wds[1] = "周身暗红如浴血池，刃裂三线引为三灾，中有赤瞳勾人心火。敌心神既失，十方俱灭，惟余红莲：“汝一念起，业火炽然，非人燔汝，乃汝自燔。”"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 150
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wdf"
wds[12] = 2013357951
wds[13] = 2366906872
elseif wd == "鸣鸿" then
wds[1] = "刀长三尺，与轩辕剑同炉而成。黄帝见其刀意过盛，恐反噬刀主，欲以轩辕剑毁之；此刀乃化玄红云鹊，穿霞而逝。"
wds[2] = 2
wds[3] = 3
wds[4] = 12
wds[5] = 160
wds[7] = {"剑侠客","巨魔王"}
wds[11] = "item.wd1"
wds[12] = 3497244314
wds[13] = 3024786057
elseif wd == "引魂杖" then
wds[1] = "点点萤光，引路幽魂，指引迷途幽魂的法杖，有着强大的法力"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 70
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 2962804578
wds[13] = 1687273756
elseif wd == "碧玺杖" then
wds[1] = "碧霞莹莹，玉暖生烟，浑然天成的碧玉法杖，神妙异常"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 80
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 264053858
wds[13] = 203186473
elseif wd == "业焰" then
wds[1] = "取地狱燧石锻冶，燃万年业火之杖。“以业火乾枯，酬其宿债”，业焰之舞，焚尽世间罪孽。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 90
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 1824574630
wds[13] = 2003240450
elseif wd == "玉辉" then
wds[1] = "琉璃玉辉，星降人间，熠熠生辉的琉璃法杖，挥舞时如繁星落尽，蕴含无限灵力。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 100
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 3341482479
wds[13] = 3389535995
elseif wd == "鹿鸣" then
wds[1] = "牡鹿凄鸣，风云雷动，天下至寒之墨玉炼成鹿角之形，夹风雷之势，让敌人闻之色变。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 100
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 4184601743
wds[13] = 1009912375
elseif wd == "庄周梦蝶" then
wds[1] = "“昔者庄周梦为蝴蝶，栩栩然蝴蝶也”梦中蝶舞花落，焉知人世几何？杖取冥府幽灯为首，引路之蝶翩飞，最善蛊惑人心。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 120
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 4210455798
wds[13] = 3003334713
elseif wd == "凤翼流珠" then
wds[1] = "有凤来仪，祥瑞兆也。炎帝融千金，取明珠，塑凤凰振翅衔珠之形，炼得一杖，光华灿烂，百鸟朝凤，深蕴妙法。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 130
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 3777157831
wds[13] = 1526765929
elseif wd == "雪蟒霜寒" then
wds[1] = "刘邦斩白蛇，取其精魄封于至阴至寒之地，吸寒冰精华千年，蛇魄化杖，成“雪蟒霜寒”，阴鸷寒毒，唯奇人异士方可驾驭自如。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 140
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 1585143397
wds[13] = 3652569447
elseif wd == "碧海潮生" then
wds[1] = "应龙伏旱魃，寻深海冰晶，取潮涌奔腾之势，融白浪连山之气，吐龙息为灵珠，成龙神逐珠之形，终获一杖，名曰“碧海潮生”。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 150
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 859134972
wds[13] = 2904010505
elseif wd == "弦月" then
wds[1] = "盘古开天辟地之时，一外化陨铁落于不周山之巅，沐月华，吸星魄，尽得天地清明之气，化一杖，清辉万丈，疏影琉璃，曰之“弦月”。"
wds[2] = 2
wds[3] = 3
wds[4] = 13
wds[5] = 160
wds[7] = {"巫蛮儿","羽灵神"}
wds[11] = "common/item.wdf"
wds[12] = 1620809403
wds[13] = 481332718
elseif wd == "沧海明珠" then
wds[1] = "东海之浪，西海之湍，南海之潮，北海之涌，凝为玲珑明珠，置于耳畔，可闻四海浪涛奔涌。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 70
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3775040856
wds[13] = 1581614754
elseif wd == "无量玉璧" then
wds[1] = "奇珍璞玉，历神工鬼斧琢磨百年，方成无瑕白璧，明澈如镜，可见本心。心无旁骛，不惹尘埃。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 80
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 219820456
wds[13] = 1327897055
elseif wd == "离火" then
wds[1] = "北地铁骨，质坚且寒，南疆离火，熔之成珠。铁骨灼灼，烈火熊熊，炽焰炎炎，刚猛之至。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 90
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3130687183
wds[13] = 295884750
elseif wd == "飞星" then
wds[1] = "河汉渺渺，星华灿灿。流星坠地，而光华不灭，繁光云影，剔透灵动。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 100
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2857125772
wds[13] = 3385292234
elseif wd == "月华" then
wds[1] = "芙蓉出水，风荷凌波。采月宫新荷之叶，凝流金月色之光，成琳琅花灯一盏，暖光融融，晴光皎皎。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 100
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3767404245
wds[13] = 776402569
elseif wd == "回风舞雪" then
wds[1] = "洛水汤汤，钟灵毓秀。河洛之女质比霜雪，态似惊鸿；一日童心乍起，采河滨之蝶、沉水之冰，吟清歌而成宝珠，蝶舞之时回风舞雪，琴音泠泠。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 120
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3065427050
wds[13] = 269710225
elseif wd == "紫金葫芦" then
wds[1] = "混沌初分，天开地辟，昆仑山脚下生仙藤一缕，上结葫芦七枚，名曰紫金葫芦，千年方得瓜熟蒂落，有吞吐万象之力。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 130
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1536710915
wds[13] = 2788268887
elseif wd == "裂云啸日" then
wds[1] = "烛龙之鳞，采璇玑之华，待千年。浴羲和之光，再千年。经九煅九灼，方熔为赤金之珠，其光煌煌，可照千里，其势熊熊，耀日贯虹。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 140
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3954481057
wds[13] = 3032716270
elseif wd == "云雷万里" then
wds[1] = "北溟之鲲，化而为鹏，凌风而起，翼若垂天之云，啸如雷霆之怒，水击三千，风驰如电。沉眠时化作神异之珠，聚风雷云电之力，有呼山啸海之能。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 150
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3251343750
wds[13] = 3115679889
elseif wd == "赤明" then
wds[1] = "盘古开天辟地后，齿骨为金石，精髓为珠玉，灵窍一点聚天地浩气，化为宝珠“赤明”，虹霓为衣，金螭为息，吞云吐明，异光万里。"
wds[2] = 2
wds[3] = 3
wds[4] = 15
wds[5] = 160
wds[7] = {"巫蛮儿","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1303853669
wds[13] = 4145962850
elseif wd == "游鱼戏珠" then
wds[1] = "弓箭之形仿若双鱼，共戏剔透宝珠。出箭之势，亦如游鱼嬉水，婉转灵动，让对手无从躲避。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 70
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1424340640
wds[13] = 4113025121
elseif wd == "灵犀望月" then
wds[1] = "天降奇石，锻为兵器，自生光华。美玉做灵犀之形，嵌于弓腰，祥瑞兆也。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 80
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2652946197
wds[13] = 3194521736
elseif wd == "非攻" then
wds[1] = "墨家机关之术神秘莫测，相传有采玉人偶得其残片，上记“非攻”弓弩，机括精妙，威力非常。遂寻美玉，勤琢磨，终得天下难见之绝品。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 90
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3157963095
wds[13] = 1966338355
elseif wd == "幽篁" then
wds[1] = "潮音洞外梵音悠悠，云岚缭绕，幽篁万杆，满目翠色。林中紫竹既坚且韧，扣之琅然有金石声，金童子置之于老君炉中，锻成神弓，名曰“幽篁”。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 100
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3823221168
wds[13] = 3873525610
elseif wd == "百鬼" then
wds[1] = "春秋时古墓中，青铜之樽，凝百鬼之魂，锻九千日，乃成。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 100
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1920235031
wds[13] = 878233843
elseif wd == "冥火薄天" then
wds[1] = "幽冥之地，麒麟衔火而生，踏火而行，所经处金石皆熔，游九州聚天地精华，得遇有缘之士，乃化作良弓一柄，凌风驭火，箭矢如焰，有燎日之能。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 120
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 3592078104
wds[13] = 944851297
elseif wd == "龙鸣寒水" then
wds[1] = "云龙居寒水，可呼云雨，开江海，鸣动天地，腾云起风。此弩熔云龙之鳞，凝万年寒水之底，聚玄冰苦寒之气，千年方成，出矢如冰，霜寒雪冷。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 130
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 4125263988
wds[13] = 566006425
elseif wd == "太极流光" then
wds[1] = "天地之道，以阴阳二气造化万物，日月、风雨，刚柔、动静莫不合此道也。此番水火相逢，相生相克，有大神通。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 140
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1065909571
wds[13] = 453912996
elseif wd == "九霄风雷" then
wds[1] = "灵凰栖九天，高飞穿云，清音裂石。妙手仙匠采灵凰之魄，河汉之星，云雷之怒，以九霄长风锻造千载而成此弓，箭簇既出，风雷声动，江海怒号。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 150
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 1632354244
wds[13] = 4026131118
elseif wd == "若木" then
wds[1] = "金乌栖若木，振翅日升，归巢日落，十鸟齐飞，则十日齐出，民不聊生。后羿采若木为弓，连射九日，凝金乌之魂于弓上，羲和光华，日夜不息。"
wds[2] = 2
wds[3] = 3
wds[4] = 14
wds[5] = 160
wds[7] = {"羽灵神","杀破狼"}
wds[11] = "common/item.wdf"
wds[12] = 2281686232
wds[13] = 1581270869
elseif wd == "月光双剑" then
wds[1] = "皎洁如白玉，清明如月光  "
wds[2] = 2
wds[3] = 3
wds[4] = 4
wds[5] = 100
wds[7] = {"英女侠","飞燕女"}
wds[11] = "item.wdf"
wds[12] = 38511533
wds[13] = 2184315991
elseif wd == "桃印铁刃" then
wds[1] = "常见铁剑，以桃木为剑柄。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 10
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 3651866845
wds[13] = 151833112
elseif wd == "赭石巨剑" then
wds[1] = "以赭石去杂质锻淬而成，色泽沉郁。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 20
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 1525417198
wds[13] = 2861515391
elseif wd == "壁玉长铗" then
wds[1] = "精铁重剑，剑身嵌美玉。碧波流光，颇有君子之风。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 30
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x51105074
wds[13] = 0x976BFD27
elseif wd == "青铜古剑" then
wds[1] = "青铜宝剑，古朴大气，然剑锋凌厉，不可小觑。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 40
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x809D1FDD
wds[13] = 0xCC013376
elseif wd == "金错巨刃" then
wds[1] = "铁匠采丹阳铜矿冶炼锻造，剑身以镶金包裹，工艺精湛，灼灼夺目。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 50
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0xBD5C010E
wds[13] = 0xE8F34110
elseif wd == "惊涛雪" then
wds[1] = "铸剑师偶得深海晶石一块，冶炼成剑，挥斩之时，流光溢彩。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 60
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x1F648228
wds[13] = 0x0B0AB6FB
elseif wd == "醉浮生" then
wds[1] = "浮生若梦，一醉解忧，以布裹之，掩锋芒，平杀气，大巧不工，颇具豪侠之意。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 70
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x379213E4
wds[13] = 0xE98BD873
elseif wd == "沉戟天戊" then
wds[1] = "原为沙场断戟，后经人收敛重铸，以缅忠魂。握之，勇武无惧。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 80
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x2E58E991
wds[13] = 0xE7692943
elseif wd == "鸦九" then
wds[1] = "剑痴鸦九得欧冶子所遗铸剑秘法，铸长剑无名。因不舍爱剑磨损，剑成当日。即以冰匣封之。十余年后得人点拔开悟，欲拔剑出匣，然而冰匣早已与剑芯融为一体，不可分离，寻得熔岩炼化三年，方重铸此剑，剑身自此红雾缭绕。后人得之，为此剑冠以剑痴鸦九之名。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 90
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0xEE633A71
wds[13] = 0x3ADE1603
elseif wd == "昆吾" then
wds[1] = "前朝君主雄才大略，文治武功皆成鼎盛，有邦国朝献天降陨铁。以为祥瑞，遂寻当世铸剑高手，炼化成剑，彪炳功勋。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 100
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x458E5B98
wds[13] = 0xF9D8AF7B
elseif wd == "弦歌" then
wds[1] = "乐师师旷以剑为胆，棹伏羲木，铺天蚕丝，制成琴身重剑，以酬知己，友人闻弦歌而知雅意，奏高山流水，成一段佳话。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 110
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x7B631424
wds[13] = 0x2952AF91
elseif wd == "墨骨枯麟" then
wds[1] = "东海龙冢有龙骨万千，尤以黑龙龙骨为尊，取其残骨，熔以业火，成墨骨重剑。弹触剑身，争鸣作响，似有龙吟。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 120
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x84131194
wds[13] = 0xEDAE8F1A
elseif wd == "腾蛇郁刃" then
wds[1] = "中山之州有赤目飞蛇，乘雾游云，于柴桑之山嬉戏，疲乏后盘松石小憩，留蛇蜕一副，化为巨剑，此乃王道之师。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 130
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x6F6CAC00
wds[13] = 0x9B3ACC82
elseif wd == "秋水澄流" then
wds[1] = "泑水之畔盛产婴垣之玉，得蓐收赤足踏过而成金秋之色，胜碧玉琼瑶。有人界巧匠偶得之，不知何物，投剑炉一试，不想即刻炉毁剑成，更一日入秋，遂得此名。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 140
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x5F69A15B
wds[13] = 0x60665CA2
elseif wd == "百辟镇魂" then
wds[1] = "千年以前，世间妖魔横行，有神将除妖邪，斩厉鬼，力竭而亡，然其精魂不灭，附于生前所用神兵重剑，继续护佑四方。此剑祭出，则正气浩然冲天，可诛邪平患，可定历熄灾。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 150
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0xF88C7462
wds[13] = 0x18605DF5
elseif wd == "长息" then
wds[1] = "洪水滔天，鲧窃帝之息壤以堙洪水，息壤生生不息，却于疏洪无益。帝令祝融取息壤，复命禹布土疏洪，以定九州。此时山川逼仄，水塞不出。禹借祝融火龙之力，熔炼息壤成重剑之体，以之开山疏浚，方江河倾泻，洪水东去。"
wds[2] = 2
wds[3] = 3
wds[4] = 16
wds[5] = 160
wds[7] = {"偃无师"}
wds[11] = "common/item.wdf"
wds[12] = 0x14412394
wds[13] = 0x50C65EB2
elseif wd == "素纸灯" then
wds[1] = "轻巧的纸灯笼，最适合新手练习使用。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 0
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xC2554C5A
wds[13] = 0x053A2EC4
elseif wd == "竹骨灯" then
wds[1] = "以竹骨扎成的灯笼，看起来精致又风雅。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 10
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x3EC471A0
wds[13] = 0xEA6DAE59
elseif wd == "红灯笼" then
wds[1] = "节日时方可悬挂起来的红灯笼，看到它就能感到喜庆的氛围。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 20
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xC7DFDFEE
wds[13] = 0x38E5EA0B
elseif wd == "鲤鱼灯" then
wds[1] = "仿照锦鲤的样子精致而成的花灯，说不定会和锦鲤一样带给人好运呢！"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 30
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x97F6C50B
wds[13] = 0x97DB902B
elseif wd == "芙蓉花灯" then
wds[1] = "晶莹剔透的白瓷灯笼，更有名家所绘之工笔芙蓉，美轮美奂。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 40
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xCD622A06
wds[13] = 0x7E3F070B
elseif wd == "如意宫灯" then
wds[1] = "宫廷巧匠耗费月余精制而成的宫灯，象征着平安吉祥，如意你心。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 50
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xB4FBA38A
wds[13] = 0xCE867B66
elseif wd == "玲珑盏" then
wds[1] = "西域工匠以 费盘斯 工艺烧制的灯笼，其色流云清彩，其质晶莹剔透，玲珑奇巧，引人注目。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 60
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x97987F5C
wds[13] = 0xA3B8F8E5
elseif wd == "玉兔盏" then
wds[1] = "白璧无瑕琢成团绒玉兔，碧玉青翠雕琢剔透环珮，光润莹然，美不胜收。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 70
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xD1839465
wds[13] = 0x9C3DDB33
elseif wd == "冰心盏" then
wds[1] = "北俱寒冰，澄澈剔透，经年不化。炽焰为刃，琢成玲珑灯盏，寒光为焰，凛风逼人。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 80
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x06427E44
wds[13] = 0xF2575943
elseif wd == "蟠龙" then
wds[1] = "风从龙出，云有龙息，夜放光华，金碧辉煌。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 90
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xA2DC05D6
wds[13] = 0x73DE6960
elseif wd == "云鹤" then
wds[1] = "饥餐瑶草，渴饮琼泉。朝飞阆苑，暮宿云烟。白鹤雪羽为灯盏，光耀如雪，不惹尘埃。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 100
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x5470130D
wds[13] = 0x7B377B2F
elseif wd == "风荷" then
wds[1] = "清莲出水，玉立亭亭。其灵性卓然者，化为灵仙，凡胎肉身，则凝为灯盏。含苞欲放，清芬十里。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 110
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xE61D828A
wds[13] = 0x03F289DB
elseif wd == "金风玉露" then
wds[1] = "今日云軿渡鹊桥，应非脉脉与迢迢。灵鹊仙羽，织就金凤，七夕月华，酿作玉露。皎皎华光，可照良人。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 120
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0xD9D63E3A
wds[13] = 0x56ECB65C
elseif wd == "凰火燎原" then
wds[1] = "凰与凤，生相伴，死同归。一方离世，则生者必引颈而鸣，唤涅槃之火，双双浴火重生。此火五百年不灭，奔腾炽烈，可焚八方。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 130
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x9129C027
wds[13] = 0x9DD18309
elseif wd == "月露清愁" then
wds[1] = "三界之西，有湖曰灵，湖水乃天女眼泪所化，夜色深浓时，有溶溶光华。水滴如泪，泪干为夜明灵珠，风流藴籍，清光冷冷。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 140
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x7DB16375
wds[13] = 0x17020397
elseif wd == "夭桃秾李" then
wds[1] = "桃之夭夭，灼灼其华。烂漫春光，转瞬即逝。九重天上仙娥取之以为灯盏，光华所至处，枯木吐芽，桃李争芳。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 150
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x71FEDD98
wds[13] = 0xEAEFA73D
elseif wd == "荒尘" then
wds[1] = "星河浩瀚，繁星若尘，亿万星尘聚沙为塔，是以沧海桑田，人世幻变，其光华永恒也。"
wds[2] = 2
wds[3] = 3
wds[4] = 18
wds[5] = 160
wds[7] = {"桃夭夭"}
wds[11] = "common/item.wdf"
wds[12] = 0x889E6AB7
wds[13] = 0xFEEAD4B6
elseif wd == "油纸伞" then
wds[1] = "普通的油纸伞，美观轻巧，最适合新手使用。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 0
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x75285B05
wds[13] = 0x63C38A86
elseif wd == "红罗伞" then
wds[1] = "当下最时兴的雨伞样式，正红色的罗缎伞面看起来甚是喜庆。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 10
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xABC1FF05
wds[13] = 0x1485AABF
elseif wd == "紫竹伞" then
wds[1] = "伞骨及伞柄皆是紫竹制成，非常坚韧。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 20
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x7EB4CE4A
wds[13] = 0x28EEC31C
elseif wd == "锦绣椎" then
wds[1] = "巧手绣娘，择上品丝绸，飞针走线，历时年逾，方成此伞，设色精妙，光彩夺目。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 30
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x38E84E48
wds[13] = 0xA0A62144
elseif wd == "幽兰帐" then
wds[1] = "本为一尺无暇素锦，不慎沾染墨痕，幸得雅士泼墨挥毫，绘幽兰一枝，其清俊姿态，栩栩如生，其清雅香气，扑鼻欲来。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 40
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x898B70A3
wds[13] = 0xF2391CAB
elseif wd == "琳琅盖" then
wds[1] = "《般若经》有七宝：乃金、银、琉璃、珊瑚、琥珀、砗磲、玛瑙。能工巧匠以金银为骨，饰以琉璃、砗磲之属，方成此伞。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 50
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xD105662F
wds[13] = 0x38B4CA6B
elseif wd == "孔雀羽" then
wds[1] = "西域巧匠，取珍兽孔雀之尾羽，以玄妙秘法织造而成，碧彩闪烁，金翠辉煌。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 60
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xFEBE2460
wds[13] = 0x24BD153A
elseif wd == "金刚伞" then
wds[1] = "金刚怒目，降妖四魔。金刚伞以精钢百炼而成，铁骨刚叶，坚不可摧。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 70
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xCC7106BF
wds[13] = 0x4FD7BCC4
elseif wd == "落梅伞" then
wds[1] = "北俱苦寒之地，生千年老梅。一甲子方开花一次，色若胭脂，香欺兰蕙。梅枝落雪上，苦心雕琢，方成此伞。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 80
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xC0151FE6
wds[13] = 0x25E301EE
elseif wd == "鬼骨" then
wds[1] = "昆山有玉，性阴厉，蓄百年煞气，幻为枯骨，谓之鬼玉。此玉为伞骨，伞下阴魂环绕，寒气森然。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 90
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xC1D8FB19
wds[13] = 0x5CBC9754
elseif wd == "云梦" then
wds[1] = "高唐有梦，水阔花飞，梦有神女取巫山之风云为伞，谓之云梦。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 100
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x9DF0BB9B
wds[13] = 0x32DC87DD
elseif wd == "枕霞" then
wds[1] = "瑶池有仙蝶，枕霞沐云而生，其态纤巧翩然，其色艳若丹霞，取其羽翼为伞，霞光云影，如在目前。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 110
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x28771B6D
wds[13] = 0x4FBB679F
elseif wd == "碧火琉璃" then
wds[1] = "金蛇之鳞，可萃命魂之焰。以百枚金蛇之鳞，取百鬼命魂之火，成此伞。碧火幽幽，杀气腾腾，此伞过处，百鬼夜哭，绕梁不绝。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 120
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xEB48DDFB
wds[13] = 0x284DD72B
elseif wd == "雪羽穿云" then
wds[1] = "昆仑山中，有仙禽雪鸢，振翅可穿云，歌有裂石音，灵气所钟，位列仙班，其羽裳化伞，持此者，身轻如燕，振翅可至九天。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 130
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xD189B9E5
wds[13] = 0x14945888
elseif wd == "月影星痕" then
wds[1] = "汲天河之水，取星河之光。凝月华之露，锻千日，成此伞。其光灿然，其色清灵，伞起时，月华照人，清辉泻地。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 140
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x8E5D6A40
wds[13] = 0x45CB2F4A
elseif wd == "浮生归梦" then
wds[1] = "三生河畔，彼岸花开，殷红似火，灼灼其华。曼珠沙华一株，藏浮生忆念一世。幽梦为瓣，情丝若蕊，墨蝶翩翩，归梦何时？"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 150
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0xE1EC0610
wds[13] = 0x2DF481E2
elseif wd == "晴雪" then
wds[1] = "燕山雪，大如席，有华胥之女幽娴娇丽，踏凌云风波，乘逐月之辇，辇有华盖，正是燕山晴雪，清光冷冷，不可逼视。"
wds[2] = 2
wds[3] = 3
wds[4] = 17
wds[5] = 160
wds[7] = {"鬼潇潇"}
wds[11] = "common/item.wdf"
wds[12] = 0x8020E83B
wds[13] = 0x4C2F3E26
elseif wd == "四叶花" then
wds[1] = "具有药性的中草药，长着四片叶子的药草，可以补充少量气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[10] = 20
wds[11] = "item.wdf"
wds[12] = 2403345371
wds[13] = 2730519933
wds[14] = 100
elseif wd == "七叶莲" then
wds[1] = "“出污泥而不染”七片叶子的莲花更是稀有品种，难能可贵的是，这种莲花具有药性。可以补充少量气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 1559451305
wds[13] = 3792310897
wds[14] = 150
elseif wd == "天青地白" then
wds[1] = "产于北方的药草，天青色的花，青白色的叶，具有药性。可以补充少量气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 2832513988
wds[13] = 296513300
wds[14] = 200
elseif wd == "鬼切草" then
wds[1] = "产自阴间的药草，由于常年在阴湿之地，故而有很强的药力,可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x4CE95CD4
wds[13] = 0x405AE01C
wds[14] = 80
elseif wd == "紫丹罗" then
wds[1] = "产自东胜神洲的药草,紫色的叶子上散发出阵阵清香，可以补充少许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 3370160386
wds[13] = 1385083912
wds[14] = 80
elseif wd == "佛手" then
wds[1] = "非常常见的药物，因其外貌酷似佛的手指而得名，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 2548894140
wds[13] = 383352299
wds[14] = 80
elseif wd == "旋复花" then
wds[1] = "产于东海海滨的药草,花开三色，暗和三才之术数，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 3005200763
wds[13] = 1826111581
wds[14] = 80
elseif wd == "百色花" then
wds[1] = "海外仙草，原产于方壶岛，兼百花之灵气，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 542670697
wds[13] = 2739363770
wds[14] = 140
elseif wd == "香叶" then
wds[1] = "散发香气的药草叶子可以补充少量的法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 1613933236
wds[13] = 4251066160
wds[14] = 140
elseif wd == "龙须草" then
wds[1] = "《古今注》曰：“世称皇帝炼丹凿砚山，乃得仙，乘龙上天。群臣援龙须，须堕而生草，曰龙须”，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 1050552246
wds[13] = 2301092035
wds[14] = 140
elseif wd == "灵脂" then
wds[1] = "采天地灵气而生的药物，又称三秀，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 2234254574
wds[13] = 4179146971
wds[14] = 200
elseif wd == "白玉骨头" then
wds[1] = "东方白民国药兽的骨头，具有很强的药性，可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 3784788337
wds[13] = 3455660261
wds[14] = 200
elseif wd == "曼陀罗花" then
wds[1] = "常用的药草之一，华佗当年配制麻沸散的主要原料。可以补充少量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 1670376717
wds[13] = 351908663
wds[14] = 275
elseif wd == "天不老" then
wds[1] = "南瞻部洲常见的药草，花期非常之长，故而得名，可以补充些许气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xA1292738
wds[13] = 0x812F04D7
wds[14] = 1000
elseif wd == "紫石英" then
wds[1] = "紫色的千年英石，具有药性，可以补充些许气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x388CCEE9
wds[13] = 0x8AC7636D
wds[14] = 1000
elseif wd == "鹿茸" then
wds[1] = "南极仙翁仙鹿之茸,可以补充些许气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x92DCE8F4
wds[13] = 0x4B5BF1AF
wds[14] = 2000
elseif wd == "血色茶花" then
wds[1] = "出自南方的野生茶花,可以补充些许气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x50B560E1
wds[13] = 0x4DE946B5
wds[14] = 2000
elseif wd == "六道轮回" then
wds[1] = "天宫的异花，六种颜色可以清楚的反映出六道的轮回，故而得名，可以补充大量气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x7A231B4A
wds[13] = 0x6F66E996
wds[14] = 2000
elseif wd == "熊胆" then
wds[1] = "千年熊罴的胆，是十分难得可遇不可求的宝物，可以补充大量气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x51EC528C
wds[13] = 0x10929E69
wds[14] = 2000
elseif wd == "凤凰尾" then
wds[1] = [[“彩凤双飞翼，心犀一点通。”这是一根灵鸟鸾凤尾部的羽毛，可以补充大量气血。]]
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x5BC584A7
wds[13] = 0x9E720FD5
wds[14] = 3000
elseif wd == "硫磺草" then
wds[1] = "在硫磺地长大的圣草，可以补充大量气血"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x338422D9
wds[13] = 0xA49FDDC1
wds[14] = 3000
elseif wd == "龙之心屑" then
wds[1] = "用龙心提炼出的灵药,只在魔界存在，可以补充极大量的气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xBF847936
wds[13] = 0xC26FA33C
wds[14] = 4000
elseif wd == "火凤之睛" then
wds[1] = "无色界天的火凤凰的眼睛，可以补充极大量的气血。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xD0B9CCDF
wds[13] = 0x7756A846
wds[14] = 4000
elseif wd == "丁香水" then
wds[1] = "从仙岛上的丁香花中精心提炼而成，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x33DBD039
wds[13] = 0x23B1D2DA
wds[14] = 4000
elseif wd == "月星子" then
wds[1] = "五台山的名产，用水研化后使用，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x18450CD6
wds[13] = 0xE3307E95
wds[14] = 4000
elseif wd == "仙狐涎" then
wds[1] = "东方青丘国九尾仙狐的涎水制成的药草，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xB5F99FA9
wds[13] = 0x1E547A7E
wds[14] = 5000
elseif wd == "地狱灵芝" then
wds[1] = "产自地狱深处的灵芝草，由于吸取了阴魂怨气，药力很强，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x2F7C81CE
wds[13] = 0x696C18EE
wds[14] = 5000
elseif wd == "麝香" then
wds[1] = "仙山灵麝的麝香，是名贵的中草药材，可以补充些许法力"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x070423BB
wds[13] = 0x6292168E
wds[14] = 5000
elseif wd == "血珊瑚" then
wds[1] = "东海海底的千年珊瑚，具有强大的灵力,可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x0789B660
wds[13] = 0x92583E49
wds[14] = 5000
elseif wd == "餐风饮露" then
wds[1] = "南海普陀山的仙竹枝，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xEB07E77A
wds[13] = 0x28AF1886
wds[14] = 5000
elseif wd == "白露为霜" then
wds[1] = "五庄观前的仙松之枝,服用后可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xC94308D2
wds[13] = 0x95A825DD
wds[14] = 5000
elseif wd == "天龙水" then
wds[1] = "九天真龙的血液炼成的药物，可以补充些许法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x3256793E
wds[13] = 0xDA628B3B
wds[14] = 6000
elseif wd == "孔雀红" then
wds[1] = "用仙家孔雀的精华制成的药品，有很强的魔性，可以补充大量法力。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xF4A285EE
wds[13] = 0x82670C5A
wds[14] = 6000
elseif wd == "金创药" then
wds[1] = "用云南白药制成的疗伤药，可以止血、消毒，是常见的药品。具有补充气血的作用。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 3360268674
wds[13] = 3769489910
wds[14] = 10000
elseif wd == "金香玉" then
wds[1] = "仙子仙女常用的药物，除了可以养颜之外，服用后具有恢复气血的作用。"
wds[2] = 1
wds[3] = 1
wds[4] = 1
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 875333087
wds[13] = 2395394781
wds[14] = 12500
elseif wd == "小还丹" then
wds[1] = "载于中国古老药书《千金方》，散发着香气的紫色药丸，具有补充气血的功效。"
wds[2] = 1
wds[3] = 1
wds[4] = 1
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 1261161767
wds[13] = 4110383651
wds[14] = 10000
elseif wd == "千年保心丹" then
wds[1] = "用大量名贵药品，经名师的精心加工制成的药丹，具有补充气血的功效。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 3968259402
wds[13] = 212192249
wds[14] = 15000
elseif wd == "风水混元丹" then
wds[1] = "有混元之神效，用各类名贵药品精炼的丹药，具有补充法力和恢复战斗中某些情况下损失的灵力的功效。"
wds[2] = 1
wds[3] = 1
wds[4] = 1
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 1613137255
wds[13] = 3441623302
wds[14] = 10000
elseif wd == "定神香" then
wds[1] = "有定神凝气的功效，名贵药物，精心练成的丹药，具有补充法力的功效。"
wds[2] = 1
wds[3] = 1
wds[4] = 1
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 2570329553
wds[13] = 4232010254
wds[14] = 11000
elseif wd == "蛇蝎美人" then
wds[1] = "魔王妖王常用的药物，具有补充法力的功效。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 2982020731
wds[13] = 2737638149
wds[14] = 15000
elseif wd == "十香返生丸" then
wds[1] = "用十种仙山上奇香的药草制成，奇异的药丸，具有补充法力和解除酒类异常状态的作用。"
wds[2] = 1
wds[3] = 1
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xC4D733DA
wds[13] = 0x3D4A4DFD
wds[14] = 15000
elseif wd == "九转回魂丹" then
wds[1] = "炼过九转的仙丹，用极为珍贵而特殊的药物制成，具有补充气血、疗伤和起死回生的功效。"
wds[2] = 1
wds[3] = 2
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 68961914
wds[13] = 1116089577
wds[14] = 40000
elseif wd == "佛光舍利子" then
wds[1] = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
wds[2] = 1
wds[3] = 2
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 68961914
wds[13] = 1116089577
wds[14] = 20000
elseif wd == "五龙丹" then
wds[1] = "来自东海龙宫的珍贵药品，是用五颗龙珠凝练的，具有补充气血和解除封类异常状态的功效（解封几率与品质相关）。若未在封类异常状态服用五龙丹，会进入睡眠状态。"
wds[2] = 1
wds[3] = 2
wds[4] = 2
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 260113467
wds[13] = 3795878131
wds[14] = 17500
elseif wd == "一级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 1241680878
wds[13] = 4046019597
wds[14] = 10000
elseif wd == "二级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xBB35E1EE
wds[13] = 0xBB35E1EE
wds[14] = 10000
elseif wd == "三级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xE7FC64D2
wds[13] = 0xE7FC64D2
wds[14] = 10000
elseif wd == "四级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xA00740F6
wds[13] = 0xA00740F6
wds[14] = 10000
elseif wd == "五级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x21838782
wds[13] = 0x21838782
wds[14] = 10000
elseif wd == "六级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xF1C84EB5
wds[13] = 0xF1C84EB5
wds[14] = 10000
elseif wd == "七级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xEFA4BA2C
wds[13] = 0xEFA4BA2C
wds[14] = 10000
elseif wd == "八级变身卡" then
wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
wds[2] = 12
wds[3] = 1
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x2E030271
wds[13] = 0x2E030271
wds[14] = 10000
elseif wd == "乾坤帽" then
wds[1] = "天下名冠，暗藏乾坤玄机，有相当强的防御力"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 70
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1272695123
wds[13] = 1771271296
elseif wd == "黑魔冠" then
wds[1] = "魔王妖王常戴的冠帽，有相当强的防御力"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 80
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 685770468
wds[13] = 1237041059
elseif wd == "白玉龙冠" then
wds[1] = "高贵雅致的冠帽，镶有上等白玉精雕之飞龙图案"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 90
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 4284490218
wds[13] = 1412110631
elseif wd == "水晶夔帽" then
wds[1] = "其状如牛,苍色无角,一足能走,出入水即风雨,目光如日月,其声如雷,名曰夔。黄帝杀之,取皮以冒鼓,声闻五百里。”相传远古奇兽夔牛皮最终为一能工巧匠所得，辅以水晶玉石经上经千锤百炼雕琢编制而成一件冠帽。据传此帽拥有奇兽的庇佑，千年不坏"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 100
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 77382880
wds[13] = 2164041151
elseif wd == "翡翠曜冠" then
wds[1] = "相传为三清之一灵宝天尊佩戴过的帽冠。七颗翡翠分别代表“日、月、火、水、金、木、土”环绕在玉石宝珠上。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 110
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 482138369
wds[13] = 830308889
elseif wd == "金丝黑玉冠" then
wds[1] = "远古盘古开天辟地，混沌初开时凝结而成的玉石雕琢而成的冠帽，充满着神奇的灵气。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 120
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1140741771
wds[13] = 948281107
elseif wd == "白玉琉璃冠" then
wds[1] = "太上老君曾佩戴过的冠帽，用仙界白玉与琉璃珠辅以天丝编织而成。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 130
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 778966943
wds[13] = 243238969
elseif wd == "兽鬼珐琅面" then
wds[1] = "上古神魔所戴，虽经几千年，面具独角四周仍散发着神奇的魔力。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 140
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2310107289
wds[13] = 125393860
elseif wd == "紫金磐龙冠" then
wds[1] = "火神遗留之物。冠上用金雕琢为吉龙盘云，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 150
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 447473455
wds[13] = 3859378496
elseif wd == "浑天玄火盔" then
wds[1] = "黄帝征伐四方之时所配战盔，刀枪不入，水火不侵，瘟邪难近，更添无尽战意。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 160
wds[6] = "男"
wds[11] = "item.wd1"
wds[12] = 3566352403
wds[13] = 1502470676
elseif wd == "魔女发冠" then
wds[1] = "魔女们常带的头环，可以起到非常强的防御作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 70
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2508308579
wds[13] = 845102994
elseif wd == "七彩花环" then
wds[1] = "用七彩神花编成的花环，可以起到极强防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 80
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3183056480
wds[13] = 2570521405
elseif wd == "凤翅金翎" then
wds[1] = "以凤翅和凤翎编织而成的金丝头环，有极强防御的作用"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 90
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2373769150
wds[13] = 3600964026
elseif wd == "寒雉霜蚕" then
wds[1] = "由寒玉以及蚕丝编制而成，相传为七仙女常戴之物"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 100
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 86765519
wds[13] = 42155348
elseif wd == "曜月嵌星" then
wds[1] = "瑶池圣母所戴之物。冠上镶有七星宝珠环绕在月光石周围形成七星曜月的图案。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 110
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3373770544
wds[13] = 2683232345
elseif wd == "郁金流苏簪" then
wds[1] = "白晶晶佩戴的发髻。白色玉石与金丝编织而成。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 120
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3156867369
wds[13] = 2529030399
elseif wd == "玉翼附蝉翎" then
wds[1] = "嫦娥仙女佩戴过的帽冠。将月宫中玉石经千年雕琢而成，羽翼薄如蝉翼"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 130
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 678644164
wds[13] = 3321477618
elseif wd == "鸾羽九凤冠" then
wds[1] = "九只五彩凤凰的羽翼与金丝编织而成的冠帽。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 140
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 1580187502
wds[13] = 2242355262
elseif wd == "金珰紫焰冠" then
wds[1] = "水神遗留之物。上古神兽凤凰羽翼制成的帽冠，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 150
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3789475693
wds[13] = 3128529272
elseif wd == "乾元鸣凤冕" then
wds[1] = "有感于女娲造人之德，三界名匠合力铸造献上的帝王冠冕。五德齐聚，凤仪天下。"
wds[2] = 2
wds[3] = 1
wds[4] = 1
wds[5] = 160
wds[6] = "女"
wds[11] = "item.wd1"
wds[12] = 2064393561
wds[13] = 364230466
elseif wd == "龙骨甲" then
wds[1] = "以龙骨制成的宝甲，有惊人的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 70
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 541785355
wds[13] = 1741806040
elseif wd == "死亡斗篷" then
wds[1] = "魔王妖王梦寐以求的防具，非常有价值"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 80
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1766901621
wds[13] = 1885524269
elseif wd == "神谕披风" then
wds[1] = "受到神谕祝福的银色披风，带有灵动之气"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 90
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1771196770
wds[13] = 1105958467
elseif wd == "珊瑚玉衣" then
wds[1] = "相传为龙王所用铠甲，穿上后能获得仙界的庇护。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 100
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2065701734
wds[13] = 2474213076
elseif wd == "金蚕披风" then
wds[1] = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 110
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 2152164595
wds[13] = 1839718700
elseif wd == "乾坤护心甲" then
wds[1] = "为道教流传的宝物，内有八卦乾坤玄机，能抵御极强的伤害。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 120
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 3449582254
wds[13] = 3993401193
elseif wd == "蝉翼金丝甲" then
wds[1] = "月宫桂树上的灵蝉身上的蝉翼辅以金丝编织而成的铠甲。绝非寻常仙家之物"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 130
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 3962403816
wds[13] = 60903505
elseif wd == "金丝鱼鳞甲" then
wds[1] = "水神遗留之物。时隔千年，依然充满着灵气。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 140
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 1521396689
wds[13] = 340629621
elseif wd == "紫金磐龙甲" then
wds[1] = "相传为黄帝的遗物。紫金磐龙，四周散发着神奇的力量"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 150
wds[6] = "男"
wds[11] = "item.wdf"
wds[12] = 400462349
wds[13] = 54627476
elseif wd == "混元一气甲" then
wds[1] = "混元一气所凝成的宝甲，至坚不摧之物，可与天地同寿"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 160
wds[6] = "男"
wds[11] = "item.wd1"
wds[12] = 1802888376
wds[13] = 3052290356
elseif wd == "流云素裙" then
wds[1] = "相传是织女用流云织成的裙子，有很非常的防御力"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 70
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 3322971644
wds[13] = 1771157433
elseif wd == "七宝天衣" then
wds[1] = "所谓天衣无缝，上有七宝华文，是可遇不可求的极品"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 80
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 4180182573
wds[13] = 4034456555
elseif wd == "飞天羽衣" then
wds[1] = "相传以玉女飞天时所着衣装，受到天地精华的凝炼"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 90
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2637194038
wds[13] = 1353325810
elseif wd == "穰花翠裙" then
wds[1] = "翠玉宝珠装饰而成的镶花裙，为王母娘娘赏赐之物。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 100
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 869673869
wds[13] = 1836280211
elseif wd == "金蚕丝裙" then
wds[1] = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 110
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2107840682
wds[13] = 1711858998
elseif wd == "紫香金乌裙" then
wds[1] = "汲取三界花魂而制成的裙子，穿上此裙香飘千里。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 120
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2898176567
wds[13] = 273903801
elseif wd == "碧霞彩云衣" then
wds[1] = "收集了天界的碧霞五彩祥云编织而成的彩云衣，相传七仙女下凡时就是穿的这件。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 130
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 1972600201
wds[13] = 2452196507
elseif wd == "金丝蝉翼衫" then
wds[1] = "月宫桂树上的灵蝉身上的蝉翼，并取自瑶池的金丝，经仙界仙女七七四十九天编织而成的软甲"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 140
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 910126967
wds[13] = 2753459745
elseif wd == "五彩凤翅衣" then
wds[1] = "相传女娲娘娘所穿。穿上此衣能得到上古神灵的庇佑"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 150
wds[6] = "女"
wds[11] = "item.wdf"
wds[12] = 2784730653
wds[13] = 4139222799
elseif wd == "鎏金浣月衣" then
wds[1] = "以日月光芒所织造的霞衣，对敌之时往往令其目眩神驰"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 160
wds[6] = "女"
wds[11] = "item.wd1"
wds[12] = 1359780053
wds[13] = 2596354317
elseif wd == "九州履" then
wds[1] = "天下名履，有非常不错的防御力和速度"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 70
wds[11] = "item.wdf"
wds[12] = 1192033620
wds[13] = 1060649976
elseif wd == "万里追云履" then
wds[1] = "可在任何地形疾走的神履，有不错的防御力可在任何地形疾走的神履，有不错的防御力"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 80
wds[11] = "item.wdf"
wds[12] = 2928326681
wds[13] = 1121748353
elseif wd == "踏雪无痕" then
wds[1] = "包蓄地之灵气，穿之幻影如风，踏雪无痕"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 90
wds[11] = "item.wdf"
wds[12] = 1140435077
wds[13] = 888533789
elseif wd == "平步青云" then
wds[1] = "寻常仙界之物，穿上此靴可平步青云，借风云飞腾。"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 100
wds[11] = "item.wdf"
wds[12] = 1930941353
wds[13] = 771313116
elseif wd == "七星逐月靴" then
wds[1] = "天罡星所穿之靴。穿之及疾如风，三界之地任我遨游。"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 130
wds[11] = "item.wdf"
wds[12] = 1623857733
wds[13] = 2763463360
elseif wd == "碧霞流云履" then
wds[1] = "相传天界神匠以五彩天霞为材料，缝制而成的靴子。"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 140
wds[11] = "item.wdf"
wds[12] = 3450927651
wds[13] = 1312286829
elseif wd == "九州履" then
wds[1] = "相传是织女用流云织成的裙子，有很非常的防御力"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 100
wds[11] = "item.wdf"
wds[12] = 1192033620
wds[13] = 1060649976
elseif wd == "追云逐电" then
wds[1] = "相传为雷公电母经过千万年炼化而成，穿上后可以追逐云电，日行万里。"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 110
wds[11] = "item.wdf"
wds[12] = 1149904553
wds[13] = 3062275612
elseif wd == "乾坤天罡履" then
wds[1] = "相传为太上老君所穿。乃天地之气编织而成"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 120
wds[11] = "item.wdf"
wds[12] = 1238537463
wds[13] = 2413633901
elseif wd == "金丝逐日履" then
wds[1] = "相传神匠为纪念夸父特造此靴。穿上可追逐太阳，风云皆抛于脑后"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 150
wds[11] = "item.wdf"
wds[12] = 967718944
wds[13] = 2734810061
elseif wd == "辟尘分光履" then
wds[1] = "上古秘宝，着此履者可于星尘间穿梭，与霞光相竞逐"
wds[2] = 2
wds[3] = 6
wds[4] = 1
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 2907023969
wds[13] = 3418242860
elseif wd == "乱牙咬" then
wds[1] = "神铁制的腰箍，能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 4081289026
wds[13] = 1830358071
elseif wd == "魔童大牙" then
wds[1] = "巨大的魔牙，系在腰间能起到极强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 50
wds[11] = "item.wdf"
wds[12] = 3917101017
wds[13] = 246498213
elseif wd == "攫魂铃" then
wds[1] = "来自阴间的魔铃，佩在腰间，能起到极强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 3503405586
wds[13] = 4282767598
elseif wd == "双魂引" then
wds[1] = "来自阴间的宝物，可以佩在腰间，能起到极强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 3493684718
wds[13] = 2691281237
elseif wd == "兽王腰带" then
wds[1] = "兽王曾使用过的腰饰，能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 70
wds[11] = "item.wdf"
wds[12] = 2946790593
wds[13] = 281570977
elseif wd == "百窜云" then
wds[1] = "神秘的缎带，系在腰间能起到较强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 70
wds[11] = "item.wdf"
wds[12] = 1956418448
wds[13] = 457288512
elseif wd == "八卦锻带" then
wds[1] = "暗藏八卦玄机的腰带，能起到极强的防御作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 80
wds[11] = "item.wdf"
wds[12] = 4238438306
wds[13] = 3676875648
elseif wd == "圣王坠" then
wds[1] = "相传为Saber的缠腰带,不如被谁偷走了,流入市场."
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 80
wds[11] = "item.wdf"
wds[12] = 4161518362
wds[13] = 2601988852
elseif wd == "幻彩玉带" then
wds[1] = "以集天界灵气之幻彩宝玉制成，有强大的护佑作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 90
wds[11] = "item.wdf"
wds[12] = 2383008893
wds[13] = 871942394
elseif wd == "珠翠玉环" then
wds[1] = "集合千年地气生出的翡翠宝珠雕琢而成的腰带，有强大的庇佑作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 100
wds[11] = "item.wdf"
wds[12] = 4092702542
wds[13] = 4023277032
elseif wd == "金蟾含珠" then
wds[1] = "相传“蟾”能口吐金钱为旺财之物。由金身蟾口含夜光珠再辅以金丝编织而成的腰带，世间少有，绝非人界之物"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 110
wds[11] = "item.wdf"
wds[12] = 1436553780
wds[13] = 415633459
elseif wd == "乾坤紫玉带" then
wds[1] = "千年紫玉雕琢而成的腰带，相传为道家失传的宝物，有极强的庇佑作用"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 120
wds[11] = "item.wdf"
wds[12] = 1070699611
wds[13] = 885196883
elseif wd == "琉璃寒玉带" then
wds[1] = "天界银河之水经亿万年凝结而成的玉石制成的腰带，不为寻常仙物"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 130
wds[11] = "item.wdf"
wds[12] = 761737729
wds[13] = 290193038
elseif wd == "蝉翼鱼佩带" then
wds[1] = "月宫桂树上的灵蝉身上的蝉翼以及金丝编织而成的腰带，所散发出来的灵气能抵御极强的伤害。"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 140
wds[11] = "item.wdf"
wds[12] = 1344450765
wds[13] = 2406174850
elseif wd == "磐龙凤翔带" then
wds[1] = "远古天神遗物，龙飞凤舞呈吉祥之态，佩戴起来能受到上古神兽的庇护。"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 150
wds[11] = "item.wdf"
wds[12] = 2563450676
wds[13] = 4015638612
elseif wd == "紫霄云芒带" then
wds[1] = "以云霞束起雷电所制成的腰带，会散发出闪电自行防御来袭的攻击。"
wds[2] = 2
wds[3] = 5
wds[4] = 1
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 2824149864
wds[13] = 2230161080
elseif wd == "碧水青龙" then
wds[1] = "龙形环状可戴在项部，有相当的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 70
wds[11] = "item.wdf"
wds[12] = 2761659977
wds[13] = 4002371974
elseif wd == "鬼牙攫魂" then
wds[1] = "来自阴间的饰物，佩带在身上有较强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 70
wds[11] = "item.wdf"
wds[12] = 3973878954
wds[13] = 2356109296
elseif wd == "万里卷云" then
wds[1] = "据说是大禹留下的宝物，佩带在身上有极强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 80
wds[11] = "item.wdf"
wds[12] = 2814775714
wds[13] = 3789092586
elseif wd == "疾风之铃" then
wds[1] = "来历不详的神秘饰物，佩带在身上有极强的法力作用"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 80
wds[11] = "item.wdf"
wds[12] = 1790391367
wds[13] = 3931720117
elseif wd == "七彩玲珑" then
wds[1] = "串有七彩玲珑的珍珠，集海之灵气，给予佩戴者祥瑞祝福"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 90
wds[11] = "item.wdf"
wds[12] = 61182840
wds[13] = 1790107582
elseif wd == "黄玉琉佩" then
wds[1] = "女娲补天遗留下的神石雕琢而成，拥有神奇的灵力。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 100
wds[11] = "item.wdf"
wds[12] = 4273718431
wds[13] = 3596201129
elseif wd == "鸾飞凤舞" then
wds[1] = "仙界仙女们常佩之物。呈祥瑞和平之气，定能给佩戴者带来好运。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 110
wds[11] = "item.wdf"
wds[12] = 234019286
wds[13] = 805892737
elseif wd == "衔珠金凤佩" then
wds[1] = "相传曾为嫦娥仙子佩戴之物。此物寓示着美好的追求与向往。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 120
wds[11] = "item.wdf"
wds[12] = 1808237370
wds[13] = 1175473770
elseif wd == "七璜珠玉佩" then
wds[1] = "以七个天珠以及天丝编制而成的坠子。集天地之灵气，能给予佩戴者吉祥如意。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 130
wds[11] = "item.wdf"
wds[12] = 150576745
wds[13] = 3350488882
elseif wd == "鎏金点翠佩" then
wds[1] = "玉皇大帝平常佩戴之物，集合了仙界之力，给予佩戴者神奇的魔力。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 140
wds[11] = "item.wdf"
wds[12] = 91896384
wds[13] = 2019827339
elseif wd == "紫金碧玺佩" then
wds[1] = "上古神兽遗留之物。四颗碧玉珠似乎依附着神奇的魔力。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 150
wds[11] = "item.wdf"
wds[12] = 782330888
wds[13] = 2103726062
elseif wd == "落霞陨星坠" then
wds[1] = "以陨落的星辰制成的宝玉，带有莫名的灵气与能量。"
wds[2] = 2
wds[3] = 2
wds[4] = 1
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 4104259920
wds[13] = 1986550511
elseif wd == "翠叶环" then
wds[1] = "以翠色欲滴的嫩叶为耳饰，似乎可见盎然春意。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 60
wds[11] = "item.wd1"
wds[12] = 0x447CB949
wds[13] = 0x841B1A0B
elseif wd == "明月珰" then
wds[1] = "珍珠如明月，盈盈有辉光；故名为明月珰。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 80
wds[11] = "item.wd1"
wds[12] = 0xD99DA265
wds[13] = 0xED4BFC24
elseif wd == "玉蝶翩" then
wds[1] = "彩蝶成双，翩然而舞；有双蝶偶然停驻于灵泉之畔，感其气息，化而为此玉饰。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 100
wds[11] = "item.wd1"
wds[12] = 0xDC6E80FB
wds[13] = 0x0890D479
elseif wd == "点星芒" then
wds[1] = "福禄寿三星以自身星芒点化而成的异石，紫芒莹然，贵不可言。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 120
wds[11] = "item.wd1"
wds[12] = 0x97353053
wds[13] = 0x718C161F
elseif wd == "凤羽流苏" then
wds[1] = "灵凤舞九霄，振翼遗金羽；仙人偶得，以火元培之、以仙气养之，又缀以流苏，成一耳饰。静心而听，有凤鸣隐隐，奏大道之声。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 140
wds[11] = "item.wd1"
wds[12] = 0x32534D07
wds[13] = 0xC855E37F
elseif wd == "焰云霞珠" then
wds[1] = "后羿射日，十去其九；三足金乌之血化为丹霞，灼烈而烧，火光冲天。许久之后，其血方凝为此珠，赤光熠然。"
wds[2] = 2
wds[3] = 10
wds[4] = 1
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 0xED104336
wds[13] = 0xF36D99FC
elseif wd == "芝兰佩" then
wds[1] = "玉树芝兰生于其中，良才美质现于其外。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 60
wds[11] = "item.wd1"
wds[12] = 0xE07ABFDD
wds[13] = 0x0B70B0FC
elseif wd == "逸云佩" then
wds[1] = "飘逸如云，洒脱如风；君子之行也。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 80
wds[11] = "item.wd1"
wds[12] = 0x44B729A2
wds[13] = 0x8B0683BC
elseif wd == "莲音玦" then
wds[1] = "仙池清莲所化的玉玦，隐隐可闻其中仙音缭绕，长佩于身，有助修行。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 100
wds[11] = "item.wd1"
wds[12] = 0x09A1563F
wds[13] = 0x9AD70885
elseif wd == "相思染" then
wds[1] = "一寸相思一寸灰，牛郎织女分离之时滴落相思血泪，遇相思灰而化为鸳鸯之形，故名为“相思染”。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 120
wds[11] = "item.wd1"
wds[12] = 0x59D5C544
wds[13] = 0x3AB4C90B
elseif wd == "玄龙苍珀" then
wds[1] = "潜龙出世，纵情一啸，声震凌霄宝殿；玉帝罪之，命天将封其龙气入苍珀之中，以为惩罚；又将玄龙苍珀送入红尘，以待有缘人。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 140
wds[11] = "item.wd1"
wds[12] = 0x20FA6A66
wds[13] = 0x5E226429
elseif wd == "碧海青天" then
wds[1] = "鲲鹏破海而出，水浪滔天，排空怒卷；其化形之蜕则凝为一明玉，聚海中灵气而成奇宝，名曰“碧海青天”。"
wds[2] = 2
wds[3] = 11
wds[4] = 2
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 0x91E363E8
wds[13] = 0xBB4BFFCB
elseif wd == "枫华戒" then
wds[1] = "以红枫饰于梧桐木上，炼以为戒。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 60
wds[11] = "item.wd1"
wds[12] = 0x8245870F
wds[13] = 0xBB24BAC3
elseif wd == "芙蓉戒" then
wds[1] = "涉江采芙蓉，饰于白玉之上，是为芙蓉戒。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 80
wds[11] = "item.wd1"
wds[12] = 0x9D1BB8EC
wds[13] = 0x4694CB26
elseif wd == "金麟绕" then
wds[1] = "金麒麟之影投于其上，使得此戒有护主之能，故名之“金麟绕”。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 100
wds[11] = "item.wd1"
wds[12] = 0x629A6E47
wds[13] = 0x33446FE4
elseif wd == "悦碧水" then
wds[1] = "智者乐水，观音于水边有所悟，故以佛力凝碧水以为戒。迎光观之，清波荡漾。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 120
wds[11] = "item.wd1"
wds[12] = 0x81A29179
wds[13] = 0x92E3D4EB
elseif wd == "九曜光华" then
wds[1] = "九曜星君为谢王母娘娘蟠桃会之请，特凝聚九曜光华，成此宝戒；戒中聚星辰之力，华彩耀目，仙气袅然。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 140
wds[11] = "item.wd1"
wds[12] = 0x3EC26F1F
wds[13] = 0x215BBE3E
elseif wd == "太虚渺云" then
wds[1] = "九霄云气飘渺无踪，自在逍遥；太上老君采撷七七四十九缕云气，以道法凝练九九八十一回，终成此戒，名为“太虚渺云”。"
wds[2] = 2
wds[3] = 12
wds[4] = 3
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 0x86693F55
wds[13] = 0xC416CB3D
elseif wd == "香木镯" then
wds[1] = "楠木所制，可辟邪护身。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 60
wds[11] = "item.wd1"
wds[12] = 0x5B5A5A7B
wds[13] = 0xBA5B693B
elseif wd == "翡玉镯" then
wds[1] = "山灵水秀，方出璞石；翡玉镯以翡翠打造而成，自有光华。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 80
wds[11] = "item.wd1"
wds[12] = 0x59E948D9
wds[13] = 0x243475F0
elseif wd == "墨影扣" then
wds[1] = "仙人绘山水，留影玉石中；巧匠采墨影仙石制为手镯，形制奇巧，内蕴仙力。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 100
wds[11] = "item.wd1"
wds[12] = 0xFF46F65C
wds[13] = 0xCF27B111
elseif wd == "花映月" then
wds[1] = "嫦娥于广寒宫内观月照花、花映月，思念人间冷暖，故凝月华而成此手镯。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 120
wds[11] = "item.wd1"
wds[12] = 0x39BFA707
wds[13] = 0x9630B1CE
elseif wd == "金水菩提" then
wds[1] = "佛于西天观芸芸众生，有感于凡间诸般喜怒哀乐，故以纯净佛力凝为金水菩提，愿渡红尘之苦。佩戴此镯者，可得佛力为护，趋吉避凶。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 140
wds[11] = "item.wd1"
wds[12] = 0xD7A907DD
wds[13] = 0xCF3E45BF
elseif wd == "浮雪幻音" then
wds[1] = "混沌初开，天地生成；其时也，有初生霜雪自天而降。此雪遇混沌清气后凝而不化，成一奇物，静听则有天地玄音。"
wds[2] = 2
wds[3] = 13
wds[4] = 4
wds[5] = 160
wds[11] = "item.wd1"
wds[12] = 0xB2326701
wds[13] = 0xFB5EEB41



elseif 新加战斗锦衣[wd]~=nil  then
wds[1] = "战斗锦衣，穿上后改变人物造型"
wds[2] = 2
wds[3] = 15
wds[4] = 1
wds[5] = 60
wds[11] = "锦衣.npk"
wds[12] = wd.."小"
wds[13] = wd.."大"

elseif wd=="青春" or wd=="素颜" or wd=="绝色" or wd=="春秋" or  wd=="夏蚕"
  or wd=="星河" or wd=="白峨" or wd=="糖果" or wd=="青涩" or wd=="傲然"
  or wd=="牛仔" or  wd=="试剑" or  wd=="斗战神" or  wd=="斗战胜佛" then
wds[1] = "战斗锦衣，穿上后改变人物造型"
wds[2] = 2
wds[3] = 15
wds[4] = 1
wds[5] = 60
wds[11] = "房屋图标.wdf"
wds[12] = 0x20000012
wds[13] = 0x20000013
wds[1] = wd
wds[2] = 2
wds[3] = 15
wds[4] = 1
wds[5] = 60
wds[11] = "房屋图标.wdf"
wds[12] = 0x20000012
wds[13] = 0x20000013
elseif wd == "骨龙战骑" then
wds[1] = "幽骨战龙生于北俱极寒之地，初时性情暴戾，地藏菩萨见其体内蕴含庞大幽暗之力，遂点化他与地狱九层之下淬炼身心。\n\n#Y【作用】#Z战斗坐骑模型\n#Y【专属】#Z战斗锦衣"
wds[2] = 2
wds[3] = 15
wds[4] = 1
wds[5] = 60
wds[11] = "房屋图标.wdf"
wds[12] = 0x20000012
wds[13] = 0x20000013

elseif wd == "水嘟嘟·钻白" or wd=="八部天龙马·玄" or  wd=="龙凰·桃" or  wd=="龙凰·皑" then
wds[1] = "在一座远古森林的深处有一棵古树，历经万载岁月，古树上长满了翡翠的果实，藤蔓静静的包裹着它。\n\n#Y【作用】#Z战斗坐骑模型\n#Y【专属】#Z战斗锦衣"
wds[2] = 2
wds[3] = 15
wds[4] = 1
wds[5] = 60
wds[11] = "房屋图标.wdf"
wds[12] = 0x10000112
wds[13] = 0x10000113

elseif wd == "太古" then
wds[1] = "上古凶兽所化的双翼"
wds[2] = 2
wds[3] = 14
wds[4] = 5
wds[5] = 60
wds[11] = "item.wdf"
wds[12] = 0x295FD4C1
wds[13] = 0x00B98599
elseif wd == "浩瀚星河" then
wds[1] = "天河夜转漂回星,银浦流云学水声。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x4DEE1719
wds[13] = 0x7DF7F4C3
elseif wd == "烈焰澜翻" then
wds[1] = "烈焰澜翻为说时，百千诸佛尽攒眉。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0xB585CF35
wds[13] = 0xFBBA047B
elseif wd == "双鲤寄情" then
wds[1] = "鸿雁在云鱼在水，惆怅此情难寄。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x81E3D00A
wds[13] = 0x48A7F40C
elseif wd == "凌波微步" then
wds[1] = "体迅飞凫，飘忽若神。凌波微步，罗袜生尘。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0xF2D53378
wds[13] = 0x6E786275
elseif wd == "水墨游龙" then
wds[1] = "翩若惊鸿，婉若游龙。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x3AA1A218
wds[13] = 0x61053102
elseif wd == "星光熠熠" then
wds[1] = "天接云涛连晓雾，星河欲转千帆舞。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0xC72D37F6
wds[13] = 0xED812000
elseif wd == "荷塘涟漪" then
wds[1] = "池面风来波潋潋,波间露下叶田田。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x9597FC1F
wds[13] = 0x4906ED3E
elseif wd == "雪花飘落" then
wds[1] = "白雪却嫌春色晚,故穿庭树作飞花。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000011
wds[13] = 0x00000012
elseif wd == "月影婆娑" then
wds[1] = "今人不见古时月,今月曾经照古人。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000013
wds[13] = 0x00000014
elseif wd == "祥云瑞气" then
wds[1] = "日日祥云瑞气连,农家应作大神仙。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000009
wds[13] = 0x00000010
elseif wd == "九霄云图" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "九霄云图小"
wds[13] = "九霄云图大"
elseif wd == "财源滚滚" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "财源滚滚小"
wds[13] = "财源滚滚大"
elseif wd == "寒霜冰凌" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "寒霜冰凌小"
wds[13] = "寒霜冰凌大"
elseif wd == "金枝春绽" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "金枝春绽小"
wds[13] = "金枝春绽大"
elseif wd == "九尾庞庞" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "九尾庞庞小"
wds[13] = "九尾庞庞大"
elseif wd == "浪淘沙墨黑" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "浪淘沙墨黑小"
wds[13] = "浪淘沙墨黑大"
elseif wd == "浪淘沙月白" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "浪淘沙月白小"
wds[13] = "浪淘沙月白大"
elseif wd == "凌霄天宫" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "凌霄天宫小"
wds[13] = "凌霄天宫大"
elseif wd == "凌霄天宫墨黑" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "凌霄天宫墨黑小"
wds[13] = "凌霄天宫墨黑大"
elseif wd == "凌霄天宫月白" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "凌霄天宫月白小"
wds[13] = "凌霄天宫月白大"
elseif wd == "流云蝶影" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "流云蝶影小"
wds[13] = "流云蝶影大"
elseif wd == "琪草瑶花" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "琪草瑶花小"
wds[13] = "琪草瑶花大"
elseif wd == "琪花瑶草" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "琪花瑶草小"
wds[13] = "琪花瑶草大"
elseif wd == "沙骨王座" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "沙骨王座小"
wds[13] = "沙骨王座大"
elseif wd == "午夜魔蝠" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "午夜魔蝠小"
wds[13] = "午夜魔蝠大"
elseif wd == "星驰剑阵" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "星驰剑阵小"
wds[13] = "星驰剑阵大"
elseif wd == "星驰剑阵染" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "星驰剑阵染小"
wds[13] = "星驰剑阵染大"
elseif wd == "月半潮" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "月半潮小"
wds[13] = "月半潮大"
elseif wd == "月半潮墨黑" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "月半潮墨黑小"
wds[13] = "月半潮墨黑大"
elseif wd == "月半潮月白" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "月半潮月白小"
wds[13] = "月半潮月白大"
elseif wd == "云龙梦" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "云龙梦小"
wds[13] = "云龙梦大"
elseif wd == "云龙梦墨黑" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "云龙梦墨黑小"
wds[13] = "云龙梦墨黑大"
elseif wd == "云龙梦月白" then      ----新加光环
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "光环.npk"
wds[12] = "云龙梦月白小"
wds[13] = "云龙梦月白大"
elseif wd == "花的海洋" then
wds[1] = "无意苦争春,一任群芳妒。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000005
wds[13] = 0x00000006
elseif wd == "爱的光影" then
wds[1] = "爱心闪动,光影年华。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000001
wds[13] = 0x00000002
elseif wd == "珠落玉盘" then
wds[1] = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000015
wds[13] = 0x00000016
elseif wd == "红叶随风" then
wds[1] = "晚风岸抚柳,看红叶秋色然。"
wds[2] = 2
wds[3] = 16
wds[4] = 2
wds[5] = 60
wds[11] = "WP1.dll"
wds[12] = 0x00000003
wds[13] = 0x00000004
elseif wd == "龙卷风足迹" then
wds[1] = "龙卷风来啦！大家都快闪开，被刮跑了可不是玩的。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000020
wds[13] = 0x00000021
elseif wd == "皮球足迹" then
wds[1] = "真皮球是一种材质的球，适合在木地板上打。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000023
wds[13] = 0x00000022
elseif wd == "雀屏足迹" then
wds[1] = "孔雀开屏，骄傲的尾巴闪耀着灼灼光华。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000025
wds[13] = 0x00000024
elseif wd == "旋律足迹" then
wds[1] = "生动的语言节奏和丰富的生活节奏是旋律节奏的自然基础。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000027
wds[13] = 0x00000026
elseif wd == "枫叶足迹" then
wds[1] = "秋风扫落叶，行走时犹如带着秋风扫起一片片枫叶。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000029
wds[13] = 0x00000028
elseif wd == "飞天足迹" then
wds[1] = "多种颜色至于身后，犹如飞天般的感觉"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000031
wds[13] = 0x00000030
elseif wd == "两心相悦足迹" then
wds[1] = "从我的第一眼看到你，我就爱上你了。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000033
wds[13] = 0x00000032
elseif wd == "心花怒放" then
wds[1] = "故～，髓海难枯，而杰构鸿篇，大率超群出类。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000035
wds[13] = 0x00000034
elseif wd == "雷电足迹" then
wds[1] = "电闪雷鸣，莫装逼，装逼被雷劈。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000037
wds[13] = 0x00000036
elseif wd == "寒冰足迹" then
wds[1] = "行走间，犹如冬天来到。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000039
wds[13] = 0x00000038
elseif wd == "星星祈愿" then
wds[1] = "花一些时间向星星许愿吧。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000041
wds[13] = 0x00000040
elseif wd == "地狱焰火" then
wds[1] = "那闪动的火光肆无忌惮燃烧着，跳跃着。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000043
wds[13] = 0x00000042
elseif wd == "元宝足迹" then
wds[1] = "我是一个财迷，有钱我就会出现。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000045
wds[13] = 0x00000044
elseif wd == "光剑足迹" then
wds[1] = "背后出现了神秘的光晕，有锐利的光芒投射过来。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000047
wds[13] = 0x00000046
elseif wd == "雪花足迹" then
wds[1] = "雪花纷飞，犹如大雪即将来临。"
wds[2] = 2
wds[3] = 17
wds[4] = 3
wds[5] = 60
wds[11] = "jy.wdf"
wds[12] = 0x00000049
wds[13] = 0x00000048
elseif wd == "灵丹" then
wds[1] = "召唤兽进阶的道具，能够唤醒召唤兽体内的潜力，突破界限，完成进阶；进阶后的召唤兽可以增加一定的资质和成长，并额外获得30潜力点"
wds[2] = 3
wds[3] = 3
wds[4] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xE41F5356
wds[13] = 0x5B75710B
elseif wd == "鬼谷子" then
wds[1] = "战国智者鬼谷子所著的兵法兼玄学书籍。"
wds[2] = 13
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 4271545734
wds[13] = 1264860140
elseif wd == "宠物饰品通用丹" then
wds[1] = "所有宠物通用的饰品装备（特色宠物必备）"
wds[11] = "item.wd1"
wds[12] = 0xD99DA265
wds[13] = 0xED4BFC24
wds[2] = 680
wds[3] = 1
wds[4] = 1
elseif wd == "普通宝宝饰品丹" then
wds[1] = "用于普通宝宝装饰品"
wds[11]= "物品图标.wdf"
wds[12]= 0x8029B90A
wds[13]= 0x80237D0F
wds[2] = 680
wds[3] = 1
wds[4] = 1
elseif wd == "神兽宝宝饰品丹" then
wds[1] = "用于神兽宝宝装饰品"
wds[11]= "物品图标.wdf"
wds[12]= 0x8029B90A
wds[13]= 0x80237D0F
wds[2] = 680
wds[3] = 1
wds[4] = 1
elseif wd == "超级金柳露" then
wds[1] = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。"
wds[2] = 3
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 1572601177
wds[13] = 2703428501
elseif wd == "青龙石" then
wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
wds[2] = 5
wds[3] = 4
wds[4] = 1
wds[5] = "装备镶嵌时附加10%气血上限和10%魔法上限"
wds[11] = "item.wdf"
wds[12] = 2289281503
wds[13] = 603616920
elseif wd == "白虎石" then
wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
wds[2] = 5
wds[3] = 4
wds[4] = 2
wds[5] = "装备镶嵌时附加5%伤害"
wds[11] = "item.wdf"
wds[12] = 2867857574
wds[13] = 1492919136
elseif wd == "朱雀石" then
wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
wds[2] = 5
wds[3] = 4
wds[4] = 3
wds[5] = "装备镶嵌时附加5%灵力"
wds[11] = "item.wdf"
wds[12] = 650195920
wds[13] = 3642232128
elseif wd == "玄武石" then
wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
wds[2] = 5
wds[3] = 4
wds[4] = 4
wds[5] = "装备镶嵌时附加5%防御"
wds[11] = "item.wdf"
wds[12] = 727733710
wds[13] = 3146274026
elseif wd == "打狗棒" then
wds[1] = "在四季活动-天狗食月中在战斗中对噬月天狗使用，可以对其造成2000点伤害"
wds[2] = 100
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xA545ABC8
wds[13] = 0xD05BA36C
elseif wd == "月饼" then
wds[1] = "中秋节活动的奖品。食用后可以增加人物2点潜能（不可以对召唤兽使用），但每个人物最多食用50个月饼"
wds[2] = 1
wds[3] = 10
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x846AD205
wds[13] = 0x49B4F6DC
elseif wd == "潜能果" then
wds[1] = "传说中激发人物属性的潜能，吃了吊变的又大又黑又粗，具有治疗肾虚的作用，可延年益寿。食用后可以增加人物1点潜能（不可以对召唤兽使用），但每个人物最多食用对应等级阶段的数量"
wds[2] = 1
wds[3] = 10
wds[4] = 1
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x80622951
wds[13] = 0x8502F80B
elseif wd == "元宵" then
wds[1] = "元宵圆元宵圆元宵不圆不要钱！"
wds[2] = 1
wds[3] = 10
wds[4] = 2
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x522C3747
wds[13] = 0xF04964D3
elseif wd == "月华露" then
wds[1] = "昆仑山顶采集的皓月光华，是增加修为的仙露。由于月有阴晴圆缺，所以不同时间采集的光华效果也不尽相同。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x016F4E03
wds[13] = 0x026E613B
elseif wd == "九转金丹" then
wds[1] = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x5A0E9307
wds[13] = 0x6EB440C8
elseif wd == "修炼果" then
wds[1] = "具有灵气的果子，为修炼之士所常用。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x19CEE771
wds[13] = 0x0F2E3E3F
elseif wd == "超级修炼果" then
wds[1] = "具有灵气的果子，为修炼之士所常用,是修炼果的10倍功效。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "物品图标.wdf"
wds[12] = 0x19CEE771
wds[13] = 0x0F2E3E3F
elseif wd == "炼兽真经" then
wds[1] = "武林秘籍，给予召唤兽学习后可提升成长。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x1B4E9E52
wds[13] = 0x59A1B6CA
elseif wd == "蟠桃" then
wds[1] = "具有灵气的果子，为修炼之士所常用。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x1B4E9E52
wds[13] = 0x59A1B6CA
elseif wd == "三界悬赏令" then
wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0x45BDA0CD
wds[13] = 0x7231709D
elseif wd == "贼王的线索" then
wds[1] = "记载着贼王的线索信息，右键点击后可获得贼王的线索任务。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xDDB28CB8
wds[13] = 0x63F3C3F2
elseif wd == "情报" then
wds[1] = "敌军的情报，速速交给李将军吧！"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xDDB28CB8
wds[13] = 0x63F3C3F2
elseif wd == "天眼通符" then
wds[1] = "天界的灵符,具有洞察世界万物象的神奇作用。\n【效果】可以查看到部分任务要求的NPC准确坐标。"
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xDF37C485
wds[13] = 0x7FA4203F
elseif wd == "附魔宝珠" then
wds[1] = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种特殊效果。（右键使用）"
wds[2] = 4
wds[3] = 1
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0x002A5EAF
wds[13] = 0x575EE64D
elseif wd == "超级附魔宝珠" then
wds[1] = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种特殊效果。（右键使用）"
wds[2] = 4
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x002A5EAF
wds[13] = 0x575EE64D
elseif wd == "传音纸鹤" then
wds[1] = "神仙遗留下来的纸鹤，以无上法力将声音传至千里之外。"
wds[2] = 9
wds[3] = 9
wds[4] = 1
wds[11] = "item.wd1"
wds[12] = 0xE1A5BDA0
wds[13] = 0x0A552700
elseif wd == "碎星锤" then
wds[1] = "蕴含神秘的法力,可以将装备上的等级最高的宝石锻造效果清除,但是宝石同样会被神秘的力量击碎。"
wds[2] = 4
wds[3] = 1
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xBCC5105C
wds[13] = 0x64FECF98
elseif wd == "超级碎星锤" then
wds[1] = "拥有比碎星锤更加强大的法力,可以一次将装备上的宝石锻造效果全部清除,并获得一颗与锻造等级相同的宝石。"
wds[2] = 4
wds[3] = 1
wds[4] = 0
wds[11] = "common/item.wdf"
wds[12] = 0x93DE1D4F
wds[13] = 0x1F211DFE
elseif wd == "小雪块" then
wds[1] = "在堆雪人活动上交给雪人可以增加堆雪人进度2点"
wds[2] = 20
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x9BEE2ED1
wds[13] = 0xBCE0AE05
elseif wd == "大雪块" then
wds[1] = "在堆雪人活动上交给雪人可以增加堆雪人进度4点"
wds[2] = 20
wds[3] = 1
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x43F99886
wds[13] = 0x1E5C9739
elseif wd == "雪人鼻子" then
wds[1] = "在堆雪人中雪人成长最后所需要的物品"
wds[2] = 6
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x925F02E3
wds[13] = 0x587AE336
elseif wd == "雪人帽子" then
wds[1] = "在堆雪人中雪人成长最后所需要的物品"
wds[2] = 6
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xA0502DA4
wds[13] = 0xD487C373
elseif wd == "雪人眼睛" then
wds[1] = "在堆雪人中雪人成长最后所需要的物品"
wds[2] = 6
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x5BD31714
wds[13] = 0xCAFDB990
elseif wd == "点化石" then
wds[1] = "记载着神奇能力的石头\n可以为宝宝的装备#G/打造镶嵌#W/上套装效果"
wds[2] = 5
wds[3] = 5
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xE23B789E
wds[13] = 0x02563911
elseif wd=="精魄灵石" then
wds[1] = "通过特殊技巧从原矿提炼而出，可与召唤兽装备进行合成，以提升召唤兽装备的能力"
wds[2] = 5
wds[3] = 5
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 0xFFED8430
wds[13] = 0xFFED8428


elseif wd == "圣兽丹" then
wds[1] = "与特定召唤兽炼妖合成，讲丹内上古圣兽之态与召唤兽融合，合成出该召唤兽的饰品，饰品能增加新的形态装饰效果。【说明】炼妖过程中使用的召唤兽会被消耗。"
wds[2] = 3
wds[3] = 2
wds[4] = 1
wds[11]= "item.wdf"
wds[12]= 0x8029B90A
wds[13]= 0x80237D0F
elseif wd == "吸附石" then
wds[1] = "记载着神奇能力的石头，可以吸取宝宝身上的技能。"
wds[2] = 3
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x4C07009E
wds[13] = 0xBF944057
elseif wd == "鬼王的密信" then
wds[1] = "从捣乱的鬼怪身上截获的一封密信"
wds[2] = 21
wds[3] = 1
wds[4] = 1
wds[8] = "右键即可领取鬼王任务"
wds[11] = "item.wdf"
wds[12] = 0xD75A7F1C
wds[13] = 0xEA0E76DF
elseif wd == "梦魇幻境" then
wds[1] = "似乎藏着很多人的美梦呢"
wds[2] = 21
wds[3] = 1
wds[4] = 2
wds[8] = "右键即可领取无尽梦魇任务"
wds[11] = "item.wdf"
wds[12] = 0x25492E36
wds[13] = 0x663FC75A
elseif wd == "突厥密令" then
wds[1] = "从突厥军中身上截获的令牌，似乎可以混入其中。"
wds[2] = 21
wds[3] = 1
wds[4] = 3
wds[8] = "右键即可领取突厥入侵任务"
wds[11] = "item.wdf"
wds[12] = 0x79E9E6B0
wds[13] = 0xE84B01F2
elseif wd == "枯萎的金莲" then
wds[1] = "尘世间人性的金莲，已因心魔之灭而焦枯。"
wds[2] = 1001
wds[3] = 1
wds[4] = 1
wds[8] = nil
wds[11] = "item.wdf"
wds[12] = 0x88DCF8C0
wds[13] = 0x3B5F875C
elseif wd == "赤叶甘草" then
wds[1] = "王大嫂的儿子病了，听说这种稀有的赤叶甘草可以救他一命。"
wds[2] = 1001
wds[3] = 2
wds[4] = 1
wds[8] = nil
wds[11] = "item.wdf"
wds[12] = 0x7695864F
wds[13] = 0x398835C0
elseif wd == "红烧鱼" then
wds[1] = "王大嫂独家制作，美味极了。"
wds[2] = 1001
wds[3] = 2
wds[4] = 2
wds[8] = nil
wds[11] = "item.wdf"
wds[12] = 0x92E700A4
wds[13] = 0x4D688A82
elseif wd == "松风灵芝" then
wds[1] = "生长在松林之中的珍贵灵芝，十分稀有"
wds[2] = 1001
wds[3] = 2
wds[4] = 3
wds[8] = nil
wds[11] = "item.wdf"
wds[12] = 0x2F7C81CE
wds[13] = 0x696C18EE
elseif wd == "玲珑" then
wds[1] = "交给观音大士，是锻造照妖镜所需要的材料。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[8] = nil
wds[11] = "item.wdf"
wds[12] = 0xDDA1D3AA
wds[13] = 0xD3DC3123
elseif wd == "普通木材" then
wds[1] = "一种常见的建筑木料，在搭建房屋时必须要用到它。"
wds[2] = 21
wds[3] = 2
wds[4] = 2
wds[8] = "在“车迟斗法副本”中可以增加道观建设度4点"
wds[11] = "item.wdf"
wds[12] = 1192555457
wds[13] = 4056791876
elseif wd == "高级木材" then
wds[1] = "比较稀有的建筑木料，在搭建房屋时必须要用到它。"
wds[2] = 21
wds[3] = 2
wds[4] = 2
wds[8] = "在“车迟斗法副本”中可以增加道观建设度20点"
wds[11] = "item.wdf"
wds[12] = 757799681
wds[13] = 2818741734
elseif wd == "摇钱树苗" then
wds[1] = "摇钱树的树苗，在特定地方种下，可能有意想不到的收获。"
wds[2] = 21
wds[3] = 3
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x2D1399E3
wds[13] = 0x82254575
elseif wd == "金刚石" then
wds[1] = "最坚硬美丽的宝石，是传说中的五宝之一。"
wds[2] = 21
wds[3] = 3
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x517A3AFF
wds[13] = 0x797267D4
elseif wd == "定魂珠" then
wds[1] = "可以用来寻找失散在人间鬼魂的奇妙宝珠，是传说中的五宝之一"
wds[2] = 21
wds[3] = 3
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x3B83CE08
wds[13] = 0x605D073F
elseif wd == "避水珠" then
wds[1] = "用这件宝物，不熟水性的人也可以去到深海底，是传说中的五宝之一"
wds[2] = 21
wds[3] = 3
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xAF394F2F
wds[13] = 0xAF8B6CC5
elseif wd == "珍珠" then
wds[1] = "光彩夺目的珍珠,可镶嵌在武器装备上,恢复装备一定的耐久度,每件装备镶嵌珍珠的数量没有限制,但装备等级高于珍珠等级时无法镶嵌。"
wds[2] = 5
wds[3] = 6
wds[4] = 8
wds[8] = "装备"
wds[9] = "提高装备耐久"
wds[11] = "item.wdf"
wds[12] = 0x611926C4
wds[13] = 0x58C5D6AC
elseif wd == "夜光珠" then
wds[1] = "能在夜里发光的明珠，是传说中的五宝之一。"
wds[2] = 21
wds[3] = 3
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 0x4497E508
wds[13] = 0x91BB3A47
elseif wd == "龙鳞" then
wds[1] = "龙族下颚的鳞，愤怒和威力的象征，是传说中的五宝之一。"
wds[2] = 21
wds[3] = 3
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 0x1C64382E
wds[13] = 0x853BB4DA
elseif wd == "光芒石" then
wds[1] = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
wds[2] = 5
wds[3] = 6
wds[4] = 1
wds[8] = "铠甲、腰带"
wds[9] = "提高40点气血上限"
wds[11] = "item.wdf"
wds[12] = 182374181
wds[13] = 1097166752
elseif wd == "月亮石" then
wds[1] = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
wds[2] = 5
wds[3] = 6
wds[4] = 2
wds[8] = "铠甲、头盔"
wds[9] = "提高12点防御力"
wds[11] = "item.wdf"
wds[12] = 3488952287
wds[13] = 3067278649
elseif wd == "太阳石" then
wds[1] = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
wds[2] = 5
wds[3] = 6
wds[4] = 3
wds[8] = "武器、头盔"
wds[9] = "提高8点伤害力"
wds[11] = "item.wdf"
wds[12] = 1387446262
wds[13] = 2414382713
elseif wd == "舍利子" then
wds[1] = "佛的舍利子是合成装备的神秘材料。"
wds[2] = 5
wds[3] = 6
wds[4] = 4
wds[8] = "铠甲、饰品"
wds[9] = "提高6点灵力"
wds[11] = "item.wdf"
wds[12] = 2228232000
wds[13] = 3414114421
elseif wd == "红玛瑙" then
wds[1] = "红色的玛瑙石，是合成装备的神秘材料。"
wds[2] = 5
wds[3] = 6
wds[4] = 5
wds[8] = "武器、头盔"
wds[9] = "提高25点命中"
wds[11] = "item.wdf"
wds[12] = 2783082158
wds[13] = 3655137177
elseif wd == "黑宝石" then
wds[1] = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
wds[2] = 5
wds[3] = 6
wds[4] = 6
wds[8] = "腰带、鞋子"
wds[9] = "提高8点速度"
wds[11] = "item.wdf"
wds[12] = 4208912380
wds[13] = 1963658266
elseif wd == "神秘石" then
wds[1] = "在民间流传已久的的宝石，来历不详；似乎对外界施与的打击有着一股神秘的抗力。"
wds[2] = 5
wds[3] = 6
wds[4] = 7
wds[8] = "武器、腰带、鞋子"
wds[9] = "提高20点躲避力"
wds[11] = "item.wdf"
wds[12] = 749980813
wds[13] = 3278224394
elseif wd == "星辉石" then
wds[1] = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
wds[2] = 5
wds[3] = 6
wds[4] = 8
wds[8] = "武器、腰带、鞋子"
wds[9] = "提高20点躲避力"
wds[11] = "item.wd1"
wds[12] = 0xD2DFDC4D
wds[13] = 0x1F2B86DF
elseif wd == "融合石" then
wds[1] = "具有神秘而强大的力量，可在熔合装备失败时保护装备不会消失。"
wds[2] = 5
wds[3] = 6
wds[4] = 9
wds[11] = "item.wd1"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "红木短剑" then
wds[1] = "古代儿童玩具，可以提高儿童武学悟性"
wds[2] = 25
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xB88A499A
wds[13] = 0x5E4CC079
elseif wd == "搜神记" then
wds[1] = "古代儿童玩具，可以提高儿童法术悟性"
wds[2] = 25
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xCBE7FC23
wds[13] = 0xD8BCD815
elseif wd == "论语" then
wds[1] = "古代儿童玩具，可以提高儿童心态"
wds[2] = 25
wds[3] = 3
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x6B17D536
wds[13] = 0x8BC893E3
elseif wd == "游戏攻略" then
wds[1] = "#S右键使用#获取:\n#G玩法介绍#和#Y攻略说明\n#P新手玩家#想#S快速上手#:#Y请详看"
wds[2] = 25
wds[3] = 3
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x6B17D536
wds[13] = 0x8BC893E3
elseif wd == "瑶池蟠桃" then
wds[1] = "古代儿童玩具，可以提高儿童体质"
wds[2] = 25
wds[3] = 4
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x58849704
wds[13] = 0x140D0428
elseif wd == "怪物卡片" then
wds[1] = "一张记载着某种怪物造型的神奇卡片，使用后可以变化身形"
wds[2] = 30
wds[3] = 1
wds[4] = 1
elseif wd == "长安战报" then
wds[1] = "记录长安保卫战战况，右键点击使用可以及时查看当前局势"
wds[2] = 25
wds[3] = 3
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 0x6B17D536
wds[13] = 0x8BC893E3
elseif wd == "碧玉葫芦" then
wds[1] = "华佗悬壶济世时\n所带的翡翠葫芦\n此宝长期跟随华佗\n行医也深谙医术\n佩戴此宝会\n#X增加师门法术回复的气血"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[11] = "item.wdf"
wds[12] = 0x60523FF1
wds[13] = 0x7669E147
elseif wd == "金钱镖" then
wds[1] = "财神爷的看家宝贝，散出千枚铜钱伤人，如果碰上不为金钱所动的人就没有办法了。每次使用消耗当前金钱2000。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = 60
wds[7] = 1
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0x3D9C84A5
wds[13] = 0xC876D78A
elseif wd == "五色旗盒" then
wds[1] = "昔日唐王拜将，天将五色旗勤兵。臣民以为祥瑞。丞相乃进五色旗盒，以盛锦旗。江湖素有能人巧士，依样画葫芦得到此宝，为行囊便利之用。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 2
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x2FC44068
wds[13] = 0x5D2FF1BC
elseif wd == "飞剑" then
wds[1] = "此飞剑可以从千里之外出击\n取敌人首级如探囊取物\n精准的袭击令人瞪目\n#X佩戴飞剑可以增加人物命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x1C7633D1
wds[13] = 0xBC2FAF63
elseif wd == "拭剑石" then
wds[1] = "以石拭剑，可以厉其锋\n此乃蜀山上千百仙剑拭剑之石\n#X佩戴此石可增加伤害和固伤"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xF95F660F
wds[13] = 0xF37BA20D
elseif wd == "金甲仙衣" then
wds[1] = "拥有神奇效果的道家仙衣\n穿上它在战斗中\n承受物理攻击时候\n#X可能出现天兵保护"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x081E1FF5
wds[13] = 0x0BDFD09C
elseif wd == "惊魂铃" then
wds[1] = "铃声长鸣，闻者胆战心惊\n战斗中可以恐吓敌方召唤兽\n#X使其丧失斗志试图逃离战场"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = 60
wds[7] = 2
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0xEAA6AD2E
wds[13] = 0x450BE7E8
elseif wd == "嗜血幡" then
wds[1] = "暗红色的布幡\n散发着血腥嗜杀的气息\n拥有此旗在物理攻击时\n#X有几率额外多攻击一个目标\n#X且增加人物必杀几率"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xD92DF835
wds[13] = 0x50997E59
elseif wd == "风袋" then
wds[1] = "风婆系在腰间装风的布袋\n放出风来可吹人至数里外\n#X佩上此袋可增加人物速度"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x9968555F
wds[13] = 0x59E58E52
elseif wd == "清心咒" then
wds[1] = "佛门经文，在心中默念三遍\n可不受外界干扰，清心自如\n#X使用后可解除因法宝异常效果"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = 60
wds[7] = 1
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0xCC7D6870
wds[13] = 0xA284A058
elseif wd == "九黎战鼓" then
wds[1] = "九黎氏族用蛮兽皮所制的战鼓\n佩戴此法宝可以在\n#X战斗中增加召唤兽的攻击力"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xAA69D61E
wds[13] = 0xB4FA2E7D
elseif wd == "盘龙壁" then
wds[1] = "以恶龙之骨制成的饰品\n佩带此宝可以在\n#X战斗中增加召唤兽的防御"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x54C9A8DC
wds[13] = 0xC7F67DF4
elseif wd == "神行飞剑" then
wds[1] = "玄铁打造的雌雄飞剑\n佩戴此法宝可以在\n#X战斗中增加召唤兽的速度"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x5F80A13D
wds[13] = 0x9F57F723
elseif wd == "汇灵盏" then
wds[1] = "凌霄宝殿内的宫灯\n佩戴此法宝可以在\n#X战斗中增加召唤兽的灵力"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x82982E6B
wds[13] = 0x513D3054
elseif wd == "天师符" then
wds[1] = "神奇的符纸，上面记载着\n张天师的秘传制符心法\n是方寸山的不传之秘\n佩戴此符的方寸山弟子\n#X战斗中提升自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x44CA233C
wds[13] = 0xA5310A75
elseif wd == "织女扇" then
wds[1] = "女儿村特有的羽扇\n以织女而得名\n佩戴后可以提升女儿村\n#X战斗中自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x6EA31DE4
wds[13] = 0xD3F4F8DB
elseif wd == "雷兽" then
wds[1] = "李天王为门下弟子\n专门炼制的宝贝\n为五雷之精魄\n祭起时夹风雷之势\n天旋地转飞沙走石\n佩带此物的天宫弟子\n#X战斗中自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x33768EB0
wds[13] = 0xA204F1F0
elseif wd == "迷魂灯" then
wds[1] = "白晶晶的独门法宝\n据说这灯是用\n百只狐妖的眼神为芯\n佩带在身上散发着\n摄人心魂的灯光\n佩带此灯的盘丝洞弟子\n#X战斗中自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xAAC25649
wds[13] = 0x6EB0B809
elseif wd == "定风珠" then
wds[1] = "镇元大仙修炼多年的宝贝\n拥有摄人的威力\n佩带此灯的五庄观弟子\n#X战斗中自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x49D1AE82
wds[13] = 0x62DBF406
elseif wd == "幽灵珠" then
wds[1] = "佩带此珠的无底洞弟子\n#X战斗中自身封印命中"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x910D1F12
wds[13] = 0x25B13C94
elseif wd == "发瘟匣" then
wds[1] = "五瘟正神的密保，匣内盛满着发瘟蛊，一旦开启能使目标晕头转向，无法使用法术并且攻击失误。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7] = 5
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0x5F0D2E50
wds[13] = 0x780299ED
elseif wd == "断线木偶" then
wds[1] = "桃木作的人形玩偶，上面雕刻着古怪的符文，会吸引召唤兽对它进行攻击。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7] = 3
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xA9A08E99
wds[13] = 0x812181A6
elseif wd == "七杀" then
wds[1] = "勘破人间仁与义，七杀下凡啸腥风。此宝为五斗星君的饰物，战斗祭起后战意漫天，令对手丧失斗志，毫无招架之力。战斗中使用后三回合内降低目标防御，效果无法叠加。"
wds[2] = 1000
wds[3] = 2
wds[4] = 2
wds[5] = 1
wds[6] = 80
wds[7] = 4
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0x1715E7DE
wds[13] = 0x3AE1FD6A
elseif wd == "金刚杵" then
wds[1] = "佛门利器，可断除烦恼、除恶魔，代表佛智、空性、真如与智慧。佩戴后可以提升对五行之术的掌握，使五行法术的伤害增加。"
wds[2] = 1000
wds[3] = 2
wds[4] = 2
wds[5] = 0
wds[6] = 80
wds[7] = 6
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x6F9B0510
wds[13] = 0x3E968F47
elseif wd == "附灵玉" then
wds[1] = "增加一定的人物灵力，随着境界提升增加灵力值"
wds[2] = 1000
wds[3] = 2
wds[4] = 2
wds[5] = 0
wds[6] = 80
wds[7] = 6
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x5C571B45
wds[13] = 0x7F16538C
elseif wd == "兽王令" then
wds[1] = "玉麒麟甲制成的令牌，经青毛狮以妖力修炼，拥有号令百兽的威力。佩戴此物战斗中所有召唤兽能力都得到提升。"
wds[2] = 1000
wds[3] = 2
wds[4] = 2
wds[5] = 0
wds[6] = 80
wds[7] = 6
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x6D4DD526
wds[13] = 0xF3F163D2
elseif wd == "摄魂" then
wds[1] = "阎王要你三更死，谁敢留人过五更。此物为黄泉中至阴之物，专门摄取生魂，通常勾魂使者才能携带。祭起后使目标失魂落魄，失去生气，三回合内承受的伤害增加。"
wds[2] = 1000
wds[3] = 2
wds[4] = 2
wds[5] = 1
wds[6] = 80
wds[7] = 3
wds[8] =4
wds[11] = "item.wdf"
wds[12] = 0xBDD4BF97
wds[13] = 0xAFF8536F
elseif wd == "鬼泣" then
wds[1] = "在十八层地狱深处锻造之铃，吸收地府冤怨之气，摇之如闻听百鬼魂群号，可震慑敌方召唤兽，使其丧失斗志试图逃离战场。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 3
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0xF600EEBC
wds[13] = 0xEAF4BEB0
elseif wd == "月光宝盒" then
wds[1] = "神奇的宝盒，可以前去500年，后回500年。对着月光念出咒语，你就可以到达想去的地方。可以在任意地点定下标记，在非战斗中使用直接到达。半小时限使用一次。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 2
wds[6] = 100
wds[7] = 3
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x95DC9FE9
wds[13] = 0x10ADFCD8
elseif wd == "缩地尺" then
wds[1] = "某个神仙制造的逃跑工具，战斗中使用后可以迅速离开战斗逃至其他地方，有可能逃跑失败哟。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 3
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0x58C421DC
wds[13] = 0x8C891F83
elseif wd == "混元伞" then
wds[1] = "多闻天王的巨伞，撑起后可遮天蔽日。它能随机将自己承受的部分伤害反弹给对方单个成员。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 10
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0x7729A9E5
wds[13] = 0x4110011C
elseif wd == "无魂傀儡" then
wds[1] = "眼神涣散、毫无生机的傀儡，他们的魂魄已经消失，只有机械的吸引目标对其发起攻击。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 0
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0x05896BCC
wds[13] = 0x32F92F8A
elseif wd == "苍白纸人" then
wds[1] = "符纸制成的纸人，看起来单薄羸弱，在主人受到伤害时会自动现身护主。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 6
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0xB91E0707
wds[13] = 0x46EC6216
elseif wd == "五彩娃娃" then
wds[1] = "衣着五彩，色泽鲜美的布娃娃，战斗中会替主人承受一定的伤害。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 80
wds[7] = 6
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0x5C86CDBC
wds[13] = 0xEFDC64D0
elseif wd == "聚宝盆" then
wds[1] = "宝盆能聚宝，财源滚滚来。佩带此盆在获得金钱时额外增加一些金钱。每提升3级修炼境界即可获得更多的额外金钱。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 6
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xAE883DD2
wds[13] = 0xCE09A059
elseif wd == "乾坤玄火塔" then
wds[1] = "托塔天王的另一件宝贝，祭起后可增加斗志与杀气，使勇者更勇。使用后可以在一定回合内增加愤怒值。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 5
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0xF5601CC2
wds[13] = 0x1824AF14
elseif wd == "无尘扇" then
wds[1] = "不沾染尘世间恩怨的扇子，可以使人心情大悦。在战斗中祭起后可以在一定回合内减少对目标的愤怒。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 5
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0xA1224711
wds[13] = 0x9F92A376
elseif wd == "无字经" then
wds[1] = "无字无画的经书，据说只有开启天眼之人才可以看到竹简上的文字。战斗中祭起经书有很高几率使目标丧失心神，无法使用主动法宝。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 5
wds[8] = 4
wds[11] = "item.wdf"
wds[12] = 0x7E0AC2BC
wds[13] = 0x83A634D9
elseif wd == "干将莫邪" then
wds[1] = "采五山之精铁，六合之金英，七七四十九日以身赴铜水，血凝剑气而成，削金如泥，吹毛得过，佩带在身上就已剑气横溢，令人心生怯意。战斗中祭起后杀气冲天，三回合内法宝携带者增加极高的伤害。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 5
wds[8] = 5
wds[11] = "item.wdf"
wds[12] = 0x6B5B81EF
wds[13] = 0x5723DCC0
elseif wd == "慈悲" then
wds[1] = "佛门之人慈悲为怀，有普度救世之心，因而得名以广佛门善心。佩带后可以提升恢复效果。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xA68AB260
wds[13] = 0x880E0979
elseif wd == "七宝玲珑灯" then
wds[1] = "佛门至宝，佛祖当年以大雷音寺内玉池白莲所制。携带此灯者气定神闲，不受七情六欲之苦。此灯一旦佩戴，战斗中每回合自动对拥有法宝异常状态的成员进行解除。有一定的几率解除状态失败。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x6099C4D3
wds[13] = 0x10B360A3
elseif wd == "救命毫毛" then
wds[1] = "当年观音大士赠予孙悟空取经路上救急之用的宝贝，孙悟空修成正果后把此宝转增方寸山弟子，佩带毫毛在战斗中死亡后每回合有一定几率复活，每场战斗最多允许复活三次。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xCD4EA3D4
wds[13] = 0xE95997AD
elseif wd == "伏魔天书" then
wds[1] = "上面记载着降魔伏妖的秘法，可以大幅度提升天宫弟子的法术威力。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x36E1F4B7
wds[13] = 0x00A48670
elseif wd == "镇海珠" then
wds[1] = "以大禹治水时的石尺炼化而成，祭起此珠再大的风浪都要平息。佩戴此法宝的龙宫弟子可以领会本门神通的精髓，使自己的法术在战斗中发挥更大的威力。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x9FB5513B
wds[13] = 0xE73D5164
elseif wd == "奇门五行令" then
wds[1] = "镇元大仙的信物，可号令九州土地，其本身还有特殊的功效，战斗中祭起一定几率使目标两回合内神志不清，法术攻击失去准头。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 1
wds[6] = 100
wds[7] = 5
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x3463ADAD
wds[13] = 0x85774C73
elseif wd == "失心钹" then
wds[1] = "以玄铁为材料，在畜生道中历练千年的霸道妖器。祭起后鬼哭狼嚎，可减少自身所收到的召唤兽伤害。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xA2FE6F68
wds[13] = 0xFAB633D8
elseif wd == "五火神焰印" then
wds[1] = "一祭风沙起，再祭烈火燃，三祭浓烟蔽日。红孩儿以内丹在离火内修炼数百年的印章，以龙子狻猊为印饰。佩戴此宝能增加法术暴击的几率。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x2890FFA9
wds[13] = 0xC36E1F99
elseif wd == "九幽" then
wds[1] = "孟婆的茶盏，沉淀着每个鬼魂投胎转世前的怨恨与无奈，其怨之深，其恨之毒，天下无双。此物佩戴者在战斗中可通过尸腐毒造成的伤害为本方玩家成员治疗当前气血，包括持续伤害。每人每回合气血回复血量最多不超过等级*3。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x7E21AF3F
wds[13] = 0xB47273A0
elseif wd == "普渡" then
wds[1] = "观音大士流传下的至宝，佩戴此法宝后在战斗中使用普渡众生法术时有一定几率额外增加一个目标。"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0xF4E2C1E9
wds[13] = 0x1F73D09F
elseif wd == "月影" then
wds[1] = "增加法术连击几率"
wds[2] = 1000
wds[3] = 3
wds[4] = 2
wds[5] = 0
wds[6] = 100
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xDBDE982D
wds[13] = 0x365A8D06
elseif wd == "蟠龙玉璧" then
wds[1] = "增加自身防御和法防=法宝层数*20+100的数值"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0x8BB5755
wds[13] = 0x3078DDD7
elseif wd == "落星飞鸿" then
wds[1] = "进入战斗时，提升自身物理伤害。"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0x1945AAEE
wds[13] = 0xA097B923
elseif wd == "流影云笛" then
wds[1] = "进入战斗时，提升自身法术伤害。"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0x198A6291
wds[13] = 0x3340D267
elseif wd == "千斗金樽" then
wds[1] = "随战斗回合数增加物理暴击率"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0x8B4E9AC5
wds[13] = 0xAA6F6118
elseif wd == "宿幕星河" then
wds[1] = "随战斗回合数增加法术暴击率"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xBCB52ACC
wds[13] = 0x85A009F9
elseif wd == "归元圣印" then
wds[1] = "提升治疗量"
wds[2] = 1000
wds[3] = 4
wds[4] = 2
wds[5] = 0
wds[6] = 120
wds[7] = 10
wds[8] = 0
wds[11] = "common/item.wdf"
wds[12] = 0xEC524D4A
wds[13] = 0x127A05ED
--=================================================灵宝
elseif wd == "断穹巨剑" then
wds[1] ="具有开天辟地威力的巨剑,可直击敌人的灵魂是大唐官府门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "大唐官府"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "对目标造成（伤害力*1.5/2.5/4.5）点气血流失，并对额外3个单位造成25%溅射伤害，伤害结果会有10%上下浮动。"
elseif wd == "静心禅珠" then
wds[1] ="富含至理的佛珠,散发着令人静心安神的佛光是化生寺派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "化生寺"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "为己方全部单位恢复（施法者等级*6/10/20）点气血，同时消耗道具栏中最多两个百炼金乌丸，每个百炼金乌丸增加（品质*0.4）%治疗结果。"
elseif wd == "宁心道符" then
wds[1] ="以神秘口诀驱动的符,可令其定神凝气心无旁鹜是方寸山门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "方寸山"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标提升18%/30%/54%抵抗封印能力，持续12回合。"
elseif wd == "相思寒针" then
wds[1] ="分相思一分决绝,令敌人到无尽寒意的神针是女儿村门派不外传的稀世灵宝。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "女儿村"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标无法使用灵宝，并且封印命中率降低50%，持续2/4/8回合。"
elseif wd == "风舞心经" then
wds[1] ="描述如何在风中汲取自然力量的心法,是神木林门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "神木林"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "将自己当前风灵层数变为4/8/15（可临时突破上限）。"
elseif wd == "锢魂命谱" then
wds[1] ="描述如何在风中汲取自然力量的心法,是神木林门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "阴曹地府"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令敌方所有单位身上存在的锢魂术状态延长2/4/8回合。（包括死亡单位）"
elseif wd == "青狮獠牙" then
wds[1] ="传说中是上古狮王的獠牙,里之即令人心惊胆战是验岭门派不外传的稀世灵宝。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "狮驼岭"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标所有召唤兽和孩子（包括未出战）的最大气血降低10%/20%/50%。"
elseif wd == "冥火炼炉" then
wds[1] ="保存着上古神焰火种的炼炉,在魔力护持下不衰不灭是魔王襄门派不外传的稀世灵"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "魔王寨"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标每回合开始时受到（施法者等级*2/5/10）点气血流失，持续到战斗结束。"
elseif wd == "缚仙蛛丝" then
wds[1] ="可束婷仙魔的幻蛛之丝,令对手难以施展全力是盘丝洞门派不外传的稀世灵"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "盘丝洞"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "禁用目标道具栏中随机3/5/20格物品，持续到战斗结束。"
elseif wd == "煞魂冥灯" then
wds[1] ="可摄人心魄、夺人精血的冥灯是无底洞门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "无底洞"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标最大气血降低9%/20%/50%，持续到战斗结束。"
elseif wd == "九霄龙锥" then
wds[1] ="龙神之怒威九霄,令敌人丧失对法术的抵抗能力是龙宫门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "龙宫"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标受到的法术伤害增加9%/15%/70%，持续到战斗结束。"
elseif wd == "化怨清莲" then
wds[1] ="可化解世界一切思笨的洁净莲花洗涤心灵、消除怨恨,是普陀山门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "普陀山"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令目标当前回合受到伤害和造成伤害同时降低30%/50%/90%，持续2回合。"
elseif wd == "真阳令旗" then
wds[1] ="可化解世界一切思笨的洁净莲花洗涤心灵、消除怨恨,是普陀山门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "五庄观"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] = "令己方1/3/10个单位造成的伤害提高4%（80%），持续到战斗结束。（括号中为目标为召唤兽和孩子的效果）"
elseif wd == "天雷音鼓" then
wds[1] ="附加了唤雷之术的战鼓,酸响后可召唤天雷是天宫门派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "天宫"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="召唤7/13/40道闪电劈向敌方随机单位，每道闪电造成（施法者等级*4）点气血流失并使目标受到的法术伤害增加1%，持续到战斗结束。"
elseif wd == "寒霜盾戟" then
wds[1] ="进可提戟穿云,退可持盾避锋,有破山碎河之势是凌波城派不外传的稀世灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "凌波城"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令自己受到伤害降低2.5%/7.5%/25%、造成伤害提升2.5%/7.5%/25%，持续到战斗结束。(可叠加)"
elseif wd == "乾坤金卷" then
wds[1] = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为金。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="目标的攻击五行变为金，持续到战斗结束。"
elseif wd == "乾坤木卷" then
wds[1] = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为木。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令目标的攻击五行变为木，持续到战斗结束。"
elseif wd == "乾坤水卷" then
wds[1] = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为水。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令目标的攻击五行变为水，持续到战斗结束。"
elseif wd == "乾坤火卷" then
wds[1] = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为火。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令目标的攻击五行变为火，持续到战斗结束。"
elseif wd == "乾坤土卷" then
wds[1] = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为土。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令目标的攻击五行变为土，持续到战斗结束。"
elseif wd == "定神仙琴" then
wds[1] ="能发出清净内心的仙界琴音让自己摆脱控制,超然物外"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="解除自己的异常状态，提升50%抵抗封印能力，持续3回合。"
elseif wd == "赤炎战笛" then
wds[1] ="相传管在上古战场中出现,能令百兽开怒激愤是催发召唤兽潜諓的神奇灵宝"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令指定召唤兽或孩子单位本回合造成的所有伤害提升150%。(可叠加)"
elseif wd == "护体灵盾" then
wds[1] ="失传已久的凝光成盾之术可在战斗中激发一个强大的护盾令敌人难以攻破。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="为目标附加目标等级*12点护盾。此护盾持续期间，目标受到所有伤害降低20%。"
elseif wd == "惊兽云尺" then
wds[1] ="能对召唤曾产生巨大的心灵震慑是克制召唤兽的神奇灵宝。"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="令目标召唤兽和孩子受到所有伤害提升50%，持续到战斗结束。(可叠加)"
elseif wd == "战神宝典" then
wds[1] ="记录了上古战神的武学心得潜心参悟后可获得源源不断的战力如战神附体"
wds[2] = 1005
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = "通用灵宝"
wds[11] = "org.rpk"
wds[12] = 16777477
wds[13] = 16777476
wds[15] ="消耗全部灵元，每回合令自己造成的物理和法术伤害提升一定比例，持续到战斗结束。（效果与消耗灵元数量有关）"

elseif wd == "易经丹" then
wds[1] = "《异兽录》之中记载的奇妙药丸，使用得当可助召唤兽打通筋骨达到形易经之境。"
wds[2] = 9
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xD9BBCB07
wds[13] = 0x8C34FD39
elseif wd == "初级清灵仙露" then
wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
wds[2] = "召唤兽道具"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0x6F4A548E
wds[13] = 0x1287E12D
elseif wd == "中级清灵仙露" then
wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
wds[2] = "召唤兽道具"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xFD5F44C0
wds[13] = 0xC8F9A4D3
elseif wd == "高级清灵仙露" then
wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
wds[2] = "召唤兽道具"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xE0D95C88
wds[13] = 0x253B7A83
elseif wd == "超级清灵仙露" then
wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（100≤灵性≤110）"
wds[2] = "召唤兽道具"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xE0D95C88
wds[13] = 0x253B7A83
elseif wd == "终级清灵仙露" then
wds[1] =  "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性110。"
wds[2] = "召唤兽道具"
wds[3] = 3
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xE0D95C88
wds[13] = 0x253B7A83
elseif wd == "玉葫灵髓" then
wds[1] = "《博物录》之中记载的玄妙丹药，可以将召唤兽已使用的清灵仙露的状态回归原始。"
wds[2] = 9
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0x3FE08883
wds[13] = 0x05104141
elseif wd == "清灵净瓶" then
wds[1] = "自上古流传至今的神奇净瓶，注以灵力之后可以汇聚净瓶仙露。"
wds[2] = 9
wds[3] = 3
wds[4] = 0
wds[11] = "item.wd1"
wds[12] = 0xBB62F78D
wds[13] = 0x455BD7CF
elseif wd == "星辰碎片" then  -------------图标
wds[1] = "星辰碎片，使用后可以穿梭于各大陆之间"
wds[2] = 9
wds[3] = 5
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xC93BEEA5
wds[13] = 0x39DF5C8A
wds[14] = 500
elseif wd == "琉璃盏的碎片" then
wds[1] = "剧情道具,#R不可扔掉\n#G日后定有用处"
wds[2] = 9
wds[3] = 6
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xDB545CED
wds[13] = 0x4E8477A9
wds[14] = 500
elseif wd == "破碎的绿烟如梦" then
wds[1] = "八戒悟空剧情"
wds[2] = 9
wds[3] = 10
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xB841243C
wds[13] = 0x5767358F
wds[14] = 500
elseif wd == "召唤兽饰品碎片" then
wds[1] = "里面记载着远古时期,古人对召唤兽研究的模样,不过后来被人不小心打碎了散落四方,筹齐之后,方可使用,可使参战的召唤兽得到一个【饰品①】效果!"
wds[2] = 9
wds[3] = 11
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xB841243C
wds[13] = 0x5767358F
wds[14] = 500
elseif wd == "宠物口粮" or wd == "口粮" then
wds[1] = "宠物非常喜欢的食物,可以恢复一定的宠物耐力."
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0X73080A8C
wds[13] = 0X33BBE002
wds[14] = 80
elseif wd == "高级宠物口粮" then
wds[1] = "宠物非常喜欢的食物,可以大量恢复宠物耐力."
wds[2] = 4
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0X73080A8C
wds[13] = 0XDBB55CC4
wds[14] = 80
elseif wd == "帮派银票" then
wds[1] = "这是属于某个帮派的银票，上面的钱可不能随便挪用哦。"
wds[2] = "帮派银票"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x97C77FD8
wds[13] = 0x92F6F4CA
elseif wd == "商品盐" then
wds[1] = "东海的特产之一，精细的海盐。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 1
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x1D1B8623
wds[13] = 0x5DA26DF2
elseif wd == "商品武器" then
wds[1] = "使用上好材料精心制作，是学武之日必备的武器。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x3B723D09
wds[13] = 0x5BBC4BD5
elseif wd == "商品帽子" then
wds[1] = "普通人家使用的布制头冠，在冬天可以起到一定御寒的作用。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x455447CE
wds[13] = 0xB3E1E4F1
elseif wd == "商品符" then
wds[1] = "道士所需的灵符，驱邪镇魔之用。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 4
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x4F8A961F
wds[13] = 0x583B0F67
elseif wd == "商品鹿茸" then
wds[1] = "鹿角上长的茸，可强身健体，是上好的药材。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 5
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x1881E054
wds[13] = 0x518D0F0E
elseif wd == "商品纸钱" then
wds[1] = "民间用来烧给阴间亲人使用的冥钞。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 6
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x1214601C
wds[13] = 0xC5D83684
elseif wd == "商品佛珠" then
wds[1] = "檀香木制的佛珠，佩带在身上可以驱邪镇魔。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 7
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x09A396DF
wds[13] = 0x0C23AB02
elseif wd == "商品酒" then
wds[1] = "精心酿制，窖藏多年，是不可多得的好酒。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 8
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xF82AAC0F
wds[13] = 0x2B2980FB
elseif wd == "商品棉布" then
wds[1] = "使用上品棉花编织而成的布匹。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 9
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x2C2D056A
wds[13] = 0x3E45E470
elseif wd == "商品面粉" then
wds[1] = "用小麦等材料精磨而成，可以制作各种可口的食物。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 10
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x7E5D886B
wds[13] = 0x3CE911B4
elseif wd == "商品珍珠" then
wds[1] = "东海珍珠，色泽明润洁白，无论是装饰和入药多可以。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x475C0227
wds[13] = 0x4EB56D11
elseif wd == "商品人参" then
wds[1] = "北方特产，是极好的补品，也可入药。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 12
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xD0FEED23
wds[13] = 0x75EAFA24
elseif wd == "商品木材" then
wds[1] = "百年原木，用于修建房屋的，名贵木材。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 13
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x2D2B1B01
wds[13] = 0xA80295E6
elseif wd == "商品蜡烛" then
wds[1] = "每家每户必备的照明工具，销路很好。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 14
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xCCA5E33A
wds[13] = 0x1111FBA1
elseif wd == "商品扇子" then
wds[1] = "只是普通的折扇，为文人雅士所喜好。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 15
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x10095AF2
wds[13] = 0xADE7E512
elseif wd == "商品铃铛" then
wds[1] = "声音悦耳，为女子所喜，常买回去佩带在身上。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 16
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x254F32EB
wds[13] = 0xDF6AC41C
elseif wd == "商品夜明珠" then
wds[1] = "能再夜中放光的明珠，是价值连城的宝物。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 17
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x17CDA1A8
wds[13] = 0xD6E56581
elseif wd == "商品麻线" then
wds[1] = "坚韧的麻线，商品的一种"
wds[2] = "跑商商品"
wds[3] = 18
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x12E64787
wds[13] = 0xEE14FF0E
elseif wd == "商品剪刀" then
wds[1] = "裁剪衣服所用的剪刀，女儿家常用物品。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 19
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x1583132D
wds[13] = 0xD55F18BB
elseif wd == "商品香油" then
wds[1] = "供奉神明的长明灯中所用的香油。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 20
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x4B45F754
wds[13] = 0x4446AACC
elseif wd == "商品首饰" then
wds[1] = "佩带在身上增添美观的一些精巧小玩意，价值视做工与材料而定。商品的一种。"
wds[2] = "跑商商品"
wds[3] = 21
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x6FFE61EF
wds[13] = 0xDBCC855E
elseif wd == "小额银票" then
wds[1] = "大唐年间，李记钱庄发行的一种银票，可获得100万两银子。"
wds[2] = "银票"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x91B892E4
wds[13] = 0xFA853D52
elseif wd == "大额银票" then
wds[1] = "大唐年间，李记钱庄发行的一种银票，可获得二亿两银子。"
wds[2] = "银票"
wds[3] = 3
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xFA49DAFD
wds[13] = 0x7F1E2D96
--冒泡框类
  elseif wd == "灿烂葵花" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x8af1df70
      wds[13] = 0x2d4ec852
  elseif wd == "冰清玉洁" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x1e2e1e43
      wds[13] = 0x706b9381
  elseif wd == "甜蜜葡萄" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x93f56713
      wds[13] = 0xf2565916
  elseif wd == "觅缘" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x3b06a859
      wds[13] = 0x737ab5c6
  elseif wd == "喜结连理" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xb9e8cc57
      wds[13] = 0x9b531254


  elseif wd == "秋意浓" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x53bfab4a
      wds[13] = 0x110cc05d

  elseif wd == "竹下饮" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x78271e77
      wds[13] = 0x8e7c0a5e
  elseif wd == "午夜惊魂" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xd22e1433
      wds[13] = 0x96c0c430
  elseif wd == "暖暖线球" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xc4c7ff87
      wds[13] = 0x5ac719c1
  elseif wd == "云中传音" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xf22180ca
      wds[13] = 0x2b58bd46
  elseif wd == "夏日西瓜" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x4858709b
      wds[13] = 0x423c7d69

  elseif wd == "中国结" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xeb8ef380
      wds[13] = 0x69922009
  elseif wd == "冰雪天地" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x6949b8ff
      wds[13] = 0x5997460a
  elseif wd == "星月童话" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xc090f28d
      wds[13] = 0x19b3703e
  elseif wd == "绯色蔷薇" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x90e807a7
      wds[13] = 0xf1ce4544

  elseif wd == "如梦似幻" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x14f77e50
      wds[13] = 0x1c790250
  elseif wd == "四叶草" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x951250b2
      wds[13] = 0xd9c07d45

  elseif wd == "木纹回忆" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xc268eee8
      wds[13] = 0x7c4d7435
  elseif wd == "悦动之心" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x3449d74a
      wds[13] = 0x9eff260e
  elseif wd == "飞翔之翼" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x13892b93
      wds[13] = 0x15de1910
  elseif wd == "花之浪漫" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xf4730c1a
      wds[13] = 0x38d8ad3d
  elseif wd == "龙虎斗" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0xc7360f6
      wds[13] = 0x58388303
  elseif wd == "如意结" then
    wds[1] = "当前，队伍频道的发言有特效装饰"
    wds[2] = 144
    wds[3] = 1
    wds[4] = 1
      wds[11] = "新界面.wdf"
      wds[12] = 0x4ced68bf
      wds[13] = 0x91a91d56
  -- elseif wd == "糖果" then
  --   wds[1] = "当前，队伍频道的发言有特效装饰"
  --   wds[2] = 144
  --   wds[3] = 1
  --   wds[4] = 1
  --     wds[11] = "新界面.wdf"
  --     wds[12] = 0x89caa377
  --     wds[13] = 0xaa95f67a



elseif wd == "功德录" then
wds[1] = "购买后可开启功德录"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "房屋图标.wdf"
wds[12] =0x10000057
wds[13] =0x10000058
elseif wd == "功德残卷" then
wds[1] = "仙界的五行秘宝之一，拈此诀处在烈火中也安然无恙"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "迭代.wdf"
wds[12] = 0xFE277256
wds[13] = 0xFE277255
elseif wd == "神兽破封石" then
wds[1] = "可突破神兽技能格子,随机给予一个技能！\n#Y【限制】#P要求最低12技能,最多突破18技能"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "房屋图标.wdf"
wds[12] = 0x10000114
wds[13] = 0x10000115
elseif wd == "避火诀" then
wds[1] = "仙界的五行秘宝之一，拈此诀处在烈火中也安然无恙"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x04694A50
wds[13] = 0xC3A8BEA9


elseif wd == "一级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000409
wds[13] = 0x00000410
elseif wd == "二级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000411
wds[13] = 0x00000412
elseif wd == "三级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000413
wds[13] = 0x00000414
elseif wd == "四级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000415
wds[13] = 0x00000416
elseif wd == "五级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000417
wds[13] = 0x00000418
elseif wd == "六级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000419
wds[13] = 0x00000420
elseif wd == "七级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000421
wds[13] = 0x00000422
elseif wd == "八级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000423
wds[13] = 0x00000424
elseif wd == "九级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000425
wds[13] = 0x00000426
elseif wd == "十级仙缘" then
wds[1] = "记载着仙缘任务信息，右键点击后可获得仙缘任务。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "新界面.wdf"
wds[12] = 0x00000427
wds[13] = 0x00000428



  elseif wd =="魔息角" then
    wds[1] ="上古魔域，四凶尽出，占四方为主。至兵主降世，降穷奇餐餮，伏混沌梼机，折其之角，引至浊魔息，以地火熔铸而得。持之是令域"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "jmtb.wdf"
    wds[12] = 0x10000074
    wds[13] = 0x10000073
elseif wd =="鸿蒙石" then
    wds[1] ="盘古破鸿蒙，清浊之气分化，乃成鸿蒙石。千万年来，此石蕴藉天地灵气，终孕生一九窍石猴。得此石者，可尽收天地灵明之能。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x10000021
    wds[13] = 0x10000022
  elseif wd =="轩辕剑" then
    wds[1] ="黄帝采首山之铜铸此剑，以天文古字铭之，蕴腾龙之魂，光若屈阳之华，寄天地之神，气有顺天之义。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0060
    wds[13] = 0x01AC0061
  elseif wd =="墨魂笔" then
    wds[1] = "挥亳洒落，探玄为奇，墨骨为魂，浓淡由他。此笔蕴浩然之气，绘万物，赋其魂。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0064
    wds[13] = 0x01AC0065
  elseif wd =="泪痕碗" then
    wds[1] =  "忽梦少年时，不语泪潸然。瑾瑜之玉为盏，嵌鲛珠，可贮世间女儿之泪。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0066
    wds[13] = 0x01AC0067
  elseif wd =="黄金甲" then
    wds[1] = "黄金甲胄，三界至坚者。披此金甲者，刀枪不入，志固而愈勇。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0062
    wds[13] = 0x01AC0063
  elseif wd =="独弦琴" then
    wds[1] = "凤栖于桐，鸣而为歌。伏羲削此桐为琴，其形法天象地，曾有七弦，作宫商角徵之音，可动喜怒悲欣之情。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0080
    wds[13] = 0x01AC0081
  elseif wd =="华光玉" then
    wds[1] = "昔时，女娲补天于高山之巅，遗五色之玉，润而有光，华彩淞淞，有修复万物之能。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0086
    wds[13] = 0x01AC0087
  elseif wd =="清泽谱" then
    wds[1] ="沧浪激石，泠泠作响，声成韵，录其谱。应龙乘风来去，云雾瀚然而从，啸而为歌，兴风雨而净万物。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0082
    wds[13] = 0x01AC0083
  elseif wd =="星斗盘" then
    wds[1] ="星移斗转，瀚海灿灿，天而为相，地则成形。颛顼以星斗为棋，司生司杀。星斗之盘，可参天机。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0084
    wds[13] = 0x01AC0085
  elseif wd =="噬魂齿" then
    wds[1] ="昆仑之渊有异兽，顽嚣不友，好行凶德。陆吾杀之，禁其魂于其齿，锐不可当。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0074
    wds[13] = 0x01AC0075
  elseif wd =="明火珠" then
    wds[1] ="煌煌天火，巨焰如帜。祝融以气化珠，珠内藏天火之焰,焚尽魍魉魑魅,明光可照天地。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0072
    wds[13] = 0x01AC0073
  elseif wd =="四神鼎" then
    wds[1] ="禺强以鼎为祀，祭天地，祷众生，纳四海怨怼，佑三界平靖。然恶业无尽，此鼎化为至阴至煞之器。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0070
    wds[13] = 0x01AC0071
  elseif wd =="昆仑镜" then
    wds[1] ="镜者，景也，风后登昆仑之丘，取山中金石以为镜，望而无尽，隐而见影，有影照回忆之能。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0076
    wds[13] = 0x01AC0077
  elseif wd =="玲珑结" then
    wds[1] = "一丝一扣系相思，玲球心意知不螺祖亲桑，抽丝编绢成此结，缠绵情意，令人心驰神往，于不觉间掌控人心。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0078
    wds[13] = 0x01AC0079

  elseif wd =="天罡印" then
    wds[1] =  "风翻云起，震荡乾坤，天罡一出，四海宾服。崔尤行兵所持之印，王霸之气俨然，有号令天下之能。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0088
    wds[13] = 0x01AC0089

  elseif wd =="月光草" then
    wds[1] =  "神木之巅有草，其影亭亭，翩然有凌波之态，其叶葳蕤，皎皎若月华之色。此草乃句芒手植，蕴皓月清辉，可治百病。"
    wds[2] = 1004
    wds[3] = 99
    wds[11] = "神器.wdf"
    wds[12] = 0x01AC0068
    wds[13] = 0x01AC0069
   elseif wd == "灵犀之屑" then
    wds[1] =  "散发着灵气的玉石，但只是一块碎片无法发挥作用。\n#Y【可以在打铁炉处合成灵犀玉】"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "神器.wdf"
    wds[12] =28049443
    wds[13] =28049444
  elseif wd == "未鉴定的灵犀玉" then
      wds[1] =  "还未经打磨的灵犀玉，被一层石灰覆盖，掩盖了内部的光泽。\n#Y【点击后可以获得灵犀玉】"
      wds[2] = 21
      wds[3] = 2
      wds[4] = 0
      wds[11] = "神器.wdf"
      wds[12] =0x01AC0025
      wds[13] =0x01AC0026
  elseif wd == "灵犀玉" then
      wds[1] =  "玉石晶莹剔透，内部华光万丈却不发于外，似乎蕴藏着无穷的力量。"
      wds[2] = 1
      wds[3] = 11
      wds[4] = 0
      wds[11] = "神器.wdf"
      wds[12] =28049443
      wds[13] =28049444

elseif wd == "房屋地契" then
wds[1] = "右键点击可以生成房屋。"
wds[2] = 151
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x97C77FD8
wds[13] = 0x92F6F4CA

elseif wd == "归墟之证" then
wds[1] = "开启轮回之墟的凭证,可以隐隐感觉到其中蕴含着深不可测的法力。\n(5人组队后可以开启对应的轮回之墟，完成后会获得大量奖励)"
wds[2] = 151
wds[3] = 1
wds[4] = 0
wds[11] = "xcwsc.wdf"
wds[12] = 0x69007815
wds[13] = 0x69007814

elseif wd == "绝世英豪&礼包" then
wds[1] = "使用后获得绝世英豪称号,该称号增加全属性5%。右键点击使用。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0x00000017
wds[13] = 0x00000018
elseif wd == "横扫天下&礼包" then
wds[1] = "使用后获得横扫天下称号,该称号增加全属性10%。右键点击使用。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0x00000017
wds[13] = 0x00000018
elseif wd == "独孤求败&礼包" then
wds[1] = "使用后获得独孤求败称号,该称号增加全属性20%。右键点击使用。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0x00000017
wds[13] = 0x00000018

elseif wd == "锦衣碎片" then
wds[1] = "锦衣的碎片，据说集齐99个破裂的蛋后就可以获得一套锦衣。右键点击使用。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0x00000013
wds[13] = 0x00000014
elseif wd == "坐骑蛋" then
wds[1] = "一种神奇的蛋，蛋壳已经破裂，据说集齐99个破裂的蛋后就可以召唤一个随机坐骑。右键点击使用。"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0xA5BF6A02
wds[13] = 0x5CA06154
elseif wd == "副本重置丹" then
wds[1] = "右键使用后可重置人物所有副本."
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x844BFBAE
wds[13] = 0xAEC4695C

elseif wd == "双倍掉宝符" then
wds[1] = "基础银子额外增加1倍,每次使用获得1小时有效时间。无法冻结。(仅限于师门,限时活动,抓鬼)"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "房屋图标.wdf"
wds[12] = 0x56D82E47
wds[13] = 0xA2148CBF
elseif wd == "钟馗令牌" then
wds[1] = "右键打开获得50次自动抓鬼次数。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x3DD12EF3
wds[13] = 0x8F8DC4AF
elseif wd == "解封丹" then
wds[1] = "可用于解封召唤兽内丹格子，会有一定的失败几率。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0X2A59F2A1
wds[13] = 0X77F1A658
elseif wd == "一代神兽礼包" then
wds[1] = "右键打开获得1.3成长神兽，附带天生技能一个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "二代神兽礼包" then
wds[1] = "右键打开获得1.5成长神兽，附带天生技能二个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "三代神兽礼包" then
wds[1] = "右键打开获得1.75成长神兽，附带天生技能三个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "四代神兽礼包" then
wds[1] = "右键打开获得1.85成长神兽，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "一代物理礼包" then
wds[1] = "右键打开获得1.3成长物理神兽，附带天生技能一个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "二代物理礼包" then
wds[1] = "右键打开获得1.5成长物理神兽，附带天生技能二个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "三代物理礼包" then
wds[1] = "右键打开获得1.75成长物理神兽，附带天生技能三个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "四代物理礼包" then
wds[1] = "右键打开获得1.85成长物理神兽，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "一代法术礼包" then
wds[1] = "右键打开获得1.3成长法术神兽，附带天生技能一个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "二代法术礼包" then
wds[1] = "右键打开获得1.5成长法术神兽，附带天生技能二个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "三代法术礼包" then
wds[1] = "右键打开获得1.75成长法术神兽，附带天生技能三个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "四代法术礼包" then
wds[1] = "右键打开获得1.85成长法术神兽，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "一代神兽自选礼包" then
wds[1] = "右键打开获得1.3成长神兽，可自选法术和物理，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "二代神兽自选礼包" then
wds[1] = "右键打开获得1.5成长神兽，可自选法术和物理，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "三代神兽自选礼包" then
wds[1] = "右键打开获得1.75成长神兽，可自选法术和物理，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "四代神兽自选礼包" then
wds[1] = "右键打开获得1.85成长神兽，可自选法术和物理，附带天生技能四个打书不掉。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD2B5D50A
wds[13] = 0x62454D13
elseif wd == "小型奖券" then
  wds[1] = "右键打开获得1次抽奖次数。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000072
  wds[13] = 0x00000071
elseif wd == "中型奖券" then
  wds[1] = "右键打开获得10次抽奖次数。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000079
  wds[13] = 0x00000078
elseif wd == "大型奖券" then
  wds[1] = "右键打开获得50次抽奖次数。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000006
  wds[13] = 0x00000005
elseif wd == "寻龙盘(小)" then
  wds[1] = "右键点击人物打造时出现仙人赐福几率增加1%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000001
  wds[13] = 0x00000092
elseif wd == "寻仙盘(小)" then
  wds[1] = "右键点击人物打造时出现双加几率增加1%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000057
  wds[13] = 0x00000056
elseif wd == "寻宝盘(小)" then
  wds[1] = "右键点击人物打造时出现特技几率增加1%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000093
  wds[13] = 0x00000061
elseif wd == "寻灵盘(小)" then
  wds[1] = "右键点击人物打造时出现特效几率增加1%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000063
  wds[13] = 0x00000062
elseif wd == "寻龙盘(中)" then
  wds[1] = "右键点击人物打造时出现仙人赐福几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000001
  wds[13] = 0x00000092
elseif wd == "寻仙盘(中)" then
  wds[1] = "右键点击人物打造时出现双加几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000057
  wds[13] = 0x00000056
elseif wd == "寻宝盘(中)" then
  wds[1] = "右键点击人物打造时出现特技几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000093
  wds[13] = 0x00000061
elseif wd == "寻灵盘(中)" then
  wds[1] = "右键点击人物打造时出现特效几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000063
  wds[13] = 0x00000062
elseif wd == "寻龙盘(大)" then
  wds[1] = "右键点击人物打造时出现仙人赐福几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000001
  wds[13] = 0x00000092
elseif wd == "寻仙盘(大)" then
  wds[1] = "右键点击人物打造时出现双加几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000057
  wds[13] = 0x00000056
elseif wd == "寻宝盘(大)" then
  wds[1] = "右键点击人物打造时出现特技几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000093
  wds[13] = 0x00000061
elseif wd == "寻灵盘(大)" then
  wds[1] = "右键点击人物打造时出现特效几率增加5%。"
  wds[2] = 21
  wds[3] = 2
  wds[4] = 0
  wds[11] = "状态图标.wdf"
  wds[12] = 0x00000063
  wds[13] = 0x00000062
elseif wd == "仙灵丹" then
 wds[1] = "内涵仙气的灵丹,使用后可以重置被仙人赐福的装备加成属性"
 wds[2] = 21
 wds[3] = 2
 wds[4] = 0
 wds[11] = "物品图标.wdf"
 wds[12] = 0xF5883F17
 wds[13] = 0x60F6CDD8
elseif wd == "特效点化石" then
wds[1] = "蕴含天地精华的宝珠，可为一件人物装备附加无级别限制,如有特效装备会改变特效成为无级别。（右键使用）"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x002A5EAF
wds[13] = 0x575EE64D
elseif wd == "特技点化石" then
wds[1] = "蕴含天地精华的宝珠，可为一件人物装备附加无级别限制,如有特效装备会改变特效成为无级别。（右键使用）"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x002A5EAF
wds[13] = 0x575EE64D
elseif wd == "灵饰点化石" then
wds[1] = "蕴含天地精华的宝珠，可以改变人物灵饰特效,没有特效有5%几率添加特效,有特效会100%重置特效"
wds[2] = 21
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x844BFBAE
wds[13] = 0xAEC4695C
elseif wd == "无级别点化石" then
wds[1] = "蕴含天地精华的宝珠，没有特效有5%几率添加无级别特效,有特效会100%重置特效为无级别特效。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x002A5EAF
wds[13] = 0x575EE64D
elseif wd == "灵饰洗炼石" then
wds[1] = "蕴含天地精华的宝珠，可以重置灵饰附加属性"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "房屋图标.wdf"
wds[12] = 0xDB1897A0
wds[13] = 0x04B28622


elseif wd == "低级胚子礼包" then
wds[1] = "开启后获得一定技能数量的召唤兽宝宝一个"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD7E977F7
wds[13] = 0x6F09B32F
elseif wd == "中级胚子礼包" then
wds[1] = "开启后获得多个技能数量的召唤兽宝宝一个"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD555E56C
wds[13] = 0x942AB7C0
elseif wd == "高级胚子礼包" then
wds[1] = "开启后获得很多技能数量的召唤兽宝宝一个"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xDBB13B82
wds[13] = 0x01B8900E

elseif string.find(wd,"级全套礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别装备一套，请预留6个道具格子。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0xD6363DD6
        wds[13] = 0x5FBAB8DC
elseif string.find(wd,"级随机礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别装备一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0xA3DB661B
        wds[13] = 0x5AAF94C0
elseif string.find(wd,"级灵饰礼包") then
    local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/20) * 20
        if 等级<60 then 等级=60 end
        wds[1] = "右键打开获得"..等级.."无级别灵饰一套，请预留4个道具格子。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x65AE0DFF
        wds[13] = 0x2CE03BE9
elseif string.find(wd,"手镯自选礼包") then
        local 取出=分割文本(wd,"手镯自选")
        local 等级 = math.floor(取出[1]/20) * 20
        if 等级<60 then 等级=60 end
        wds[1] = "右键打开获得"..等级.."属性自选手镯灵饰一件。属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x65AE0DFF
        wds[13] = 0x2CE03BE9
elseif string.find(wd,"佩饰自选礼包") then
        local 取出=分割文本(wd,"佩饰自选")
        local 等级 = math.floor(取出[1]/20) * 20
        if 等级<60 then 等级=60 end
        wds[1] = "右键打开获得"..等级.."属性自选佩饰灵饰一件。属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x65AE0DFF
        wds[13] = 0x2CE03BE9
elseif string.find(wd,"戒指自选礼包") then
        local 取出=分割文本(wd,"戒指自选")
        local 等级 = math.floor(取出[1]/20) * 20
        if 等级<60 then 等级=60 end
        wds[1] = "右键打开获得"..等级.."属性自选戒指灵饰一件。属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x65AE0DFF
        wds[13] = 0x2CE03BE9
elseif string.find(wd,"耳饰自选礼包") then
        local 取出=分割文本(wd,"耳饰自选")
        local 等级 = math.floor(取出[1]/20) * 20
        if 等级<60 then 等级=60 end
        wds[1] = "右键打开获得"..等级.."属性自选耳饰灵饰一件。属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x65AE0DFF
        wds[13] = 0x2CE03BE9
elseif string.find(wd,"级武器礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别武器一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级衣服礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别衣服一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级帽子礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别帽子一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级项链礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别项链一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级腰带礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别腰带一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级鞋子礼包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."无级别鞋子一件。"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"级随机自选包") then
        local 取出=分割文本(wd,"级")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."随机装备一件,自选特效和特技(双加属性只对随机到武器和衣服生效),装备属性为强化打造随机属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2

elseif string.find(wd,"自选武器礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选双加武器装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"自选衣服礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选双加衣服装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"自选头盔礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选头盔装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"自选项链礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选项链装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"自选腰带礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选腰带装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2
elseif string.find(wd,"自选鞋子礼包") then
        local 取出=分割文本(wd,"自选")
        local 等级 = math.floor(取出[1]/10) * 10
        wds[1] = "右键打开获得"..等级.."自选鞋子装备一件,装备属性为强化打造最高属性"
        wds[2] = 21
        wds[3] = 2
        wds[4] = 0
        wds[11] = "物品图标.wdf"
        wds[12] = 0x4A764237
        wds[13] = 0x63C9C2D2

elseif wd == "内丹自选礼包" then
    wds[1] = "选择召唤兽,改变或附加改召唤兽一个满层内丹。（右键使用）"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0x002A5EAF
    wds[13] = 0x575EE64D
elseif wd == "强身传承礼包" then
    wds[1] = "右键打开获得160级强身传承。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "强壮传承礼包" then
wds[1] = "右键打开获得160级强壮传承。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "冥想传承礼包" then
wds[1] = "右键打开获得160级冥想传承。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "健身传承礼包" then
wds[1] = "右键打开获得160级健身传承。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "养生传承礼包" then
    wds[1] = "右键打开获得160级养生传承。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC

elseif wd == "打造传承礼包" then
wds[1] = "右键打开获得160级打造传承。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 1102456535
wds[13] = 3855535092
elseif wd == "炼金传承礼包" then
wds[1] = "右键打开获得160级炼金传承。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 3971456754
wds[13] = 2585045399

elseif wd == "淬灵传承礼包" then
wds[1] = "右键打开获得160级淬灵传承。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xAEB5E00E
wds[13] = 0xD7E29586
elseif  wd == "裁缝传承礼包" then
wds[1] = "右键打开获得160级裁缝传承。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x321116AF
wds[13] = 0x13A717B5
elseif wd == "铃铛盲盒" then
wds[1] = "可以开出稀世物品的盲盒。"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x254F32EB
wds[13] = 0xDF6AC41C
elseif wd == "地宫礼包" then
    wds[1] = "右键打开获得地宫礼包!。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "宠物特惠礼包" then
    wds[1] = "右键打开随机获得宠物道具,有几率获得神兽礼包。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "书铁打造礼包" then
    wds[1] = "右键打开随机获得随机装备书铁。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "高级书铁打造礼包" then
    wds[1] = "右键打开随机获得随机装备书铁。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC

elseif wd == "灵饰打造礼包" then
    wds[1] = "右键打开随机获得随机灵饰书铁。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "高级灵饰打造礼包" then
    wds[1] = "右键打开随机获得随机灵饰书铁。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "神兜兜幸运礼包" then
    wds[1] = "右键打开获得随机数量的神兜兜。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "高级宝石礼包" then
    wds[1] = "右键打开获得随机等级的宝石一个。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "特殊兽决礼包" then
    wds[1] = "右键打开获得随机特殊魔兽要诀一本,有几率开出珍惜特殊兽决。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "超级兽决礼包" then
    wds[1] = "右键打开获得随机超级魔兽要诀一本,有几率开出珍惜超级兽决。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "超级技能.wdf"
    wds[12] = 0xAABB0195
    wds[13] = 0xAABB0194
elseif wd == "新春礼包" then
    wds[1] = "右键打开获得随机新春礼品。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "门派界面.wdf"
    wds[12] = 0x00000238
    wds[13] = 0x00000239
elseif wd == "强化丹幸运礼包" then
    wds[1] = "右键打开获得随机数量的强化升级丹。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif wd == "四打神匠礼包" then
    wds[1] = "右键打开获4种传承礼包各一个。"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0xD6363DD6
    wds[13] = 0x5FBAB8DC
elseif string.find(wd,"级宝石礼包") then
    wds[1] = "右键使用 获得相应等级的太阳石,光芒石,红玛瑙,月亮石,舍利子各一颗"
    wds[2] = 21
      wds[3] = 2
      wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0x9724BCB0
    wds[13] = 0xFE37E4E0

elseif string.find(wd,"级星辉礼包")  then
    wds[1] = "右键使用 获得相应等级的星辉石一颗"
    wds[2] = 21
    wds[3] = 2
    wds[4] = 0
    wds[11] = "物品图标.wdf"
    wds[12] = 0x9724BCB0
    wds[13] = 0xFE37E4E0


elseif wd == "一级法宝碎片" then ---------图标
wds[1] = "99个可以合成一级法宝"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xC93BEEA5
wds[13] = 0x39DF5C8A

elseif wd == "二级法宝碎片" then
wds[1] = "99个可以合成二级法宝"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xDB545CED
wds[13] = 0x4E8477A9

elseif wd == "三级法宝碎片" then
wds[1] = "99个可以合成三级法宝"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xB841243C
wds[13] = 0x5767358F
elseif wd == "仙露丸子" then
wds[1] = "常娥严选，玉兔手作G月宫驰”一首尽享清甜!是超级神柚最钟爱的葫系锁\n\n#Y【用途】交给长安城(226,110)超级神柚，可用手赐福召唤辑"
wds[2] = 21
wds[3] = 2
wds[4] = 0

wds[11] = "赐福图标.wdf"
wds[12] = 0x47180002
wds[13] = 0x47AD0001
elseif wd == "仙露小丸子" then
wds[1] = "嫦娥严选,玉兔手作,是宫驰名。一口尽享清甜!是超级神柚钟爱的甜品。\n\n#Y【用途】在长安城云来酒店制作仙露丸子"
wds[2] = 21
wds[3] = 2
wds[4] = 0

wds[11] = "赐福图标.wdf"
wds[12] = 0xF7180002
wds[13] = 0xF7AD0001
elseif wd == "神兽涎" then
wds[1] = "源自神兽情感极致之时的珍惜涎液,内含纯净的生命力量\n\n#Y【用途】在长安城云来酒店制作仙露丸子"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "赐福图标.wdf"
wds[12] = 0xA3080002
wds[13] = 0xA39D0001


----------------------------装备境界升级道具

elseif wd == "鸿蒙灵宝" then -------品质升级
wds[1] = "可以提升装备境界的鸿蒙宝物,该宝物具有8%|5%|2%几率提升装备到优秀|稀有|传说,提升失败积累一定境界值,境界值在下次提升境界时会有成功几率加成(提升境界后清空)"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000004
wds[13] = 0x00000003
elseif wd == "鸿蒙仙宝" then -------词条附加洗练
wds[1] = "可以对优秀|稀有|传说装备附加或洗练词条,附加词条具有8%|5%|2%对应几率直接附加,装备词条数量达到相应境界可以同时洗练该装备词条,附加或洗练有对应仙宝值,仙宝值会对附加或洗练具有神奇效果"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000040
wds[13] = 0x00000039
elseif wd == "鸿蒙神宝" then -------词条吸附
wds[1] = "可以对有境界装备词条进行吸附,吸附词条后该装备词条会消失,同时获得该词条的鸿蒙原石"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000006
wds[13] = 0x00000005
elseif wd == "鸿蒙原石" then -------词条附魔
wds[1] = "神奇的宝物,附带特殊词条可以对优秀|稀有|传说装备进行附魔操作"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000002
wds[13] = 0x00000001

elseif wd == "破碎的鸿蒙灵宝" then -------品质升级
wds[1] = "破碎的鸿蒙灵宝,99个可以合成完整的鸿蒙灵宝,鸿蒙灵宝可以提升装备境界"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000012
wds[13] = 0x00000011
elseif wd == "破碎的鸿蒙仙宝" then -------词条附加洗练
wds[1] = "破碎的鸿蒙仙宝,99个可以合成完整的鸿蒙仙宝,鸿蒙仙宝可以附加或洗练具有境界的装备词条"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000008
wds[13] = 0x00000007
elseif wd == "破碎的鸿蒙神宝" then -------词条吸附
wds[1] = "破碎的鸿蒙神宝,99个可以合成完整的鸿蒙神宝,鸿蒙神宝可以吸附具有词条的装备"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000014
wds[13] = 0x00000013
elseif wd == "太初灵石" then -------神话品质升级
wds[1] = "可以提升装备境界的太初宝物,该宝物具有3%几率提升传说装备到神话装备,提升失败积累一定境界值,境界值在下次提升境界时会有成功几率加成(提升境界后清空)"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000028
wds[13] = 0x00000027
elseif wd == "太初仙石" then -------神话词条附加洗练
wds[1] = "可以对神话装备附加或洗练词条,附加词条具有3%对应几率直接附加,附加具有对应的仙宝值,仙宝值会对附加具有神奇效果"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000024
wds[13] = 0x00000023
elseif wd == "太初神石" then -------神话词条吸附
wds[1] = "可以对有神话装备词条进行吸附,吸附词条后该装备词条会消失,同时获得该词条的太初原石"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000030
wds[13] = 0x00000029
elseif wd == "太初原石" then -------神话词条附魔
wds[1] = "神奇的宝物,附带特殊词条可以对神话装备进行附魔操作"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000026
wds[13] = 0x00000025
elseif wd == "破碎的太初灵石" then -------神话品质升级
wds[1] = "破碎的太初灵石,99个可以合成完整的太初灵石,太初灵石可以提升传说装备到神品装备"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000028
wds[13] = 0x00000027
elseif wd == "破碎的太初仙石" then -------神话词条附加洗练
wds[1] = "破碎的太初仙石,99个可以合成完整的太初仙石,太初仙石可以附加或洗练神品装备词条"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000024
wds[13] = 0x00000023
elseif wd == "破碎的太初神石" then -------神话词条吸附
wds[1] = "破碎的太初神石,99个可以合成完整的太初神石,太初神石可以吸附神话装备的词条"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "zbpjsjxt.wdf"
wds[12] = 0x00000030
wds[13] = 0x00000029

----------------------------------------------------------------


elseif wd == "镇妖拘魂铃" then
wds[1] = "妖魔的元气暂时收集在这一串带有符咒法力的铜铃中。将他右键炼化妖魔元气，成为各种奇珍异宝。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x254F32EB
wds[13] = 0xDF6AC41C
elseif wd == "种族坐骑礼包" then
wds[1] = "内含坐骑宠物一只,开启后获得\n对应种族的坐骑:\n#R人族:\n神奇小龟,汗血宝马,欢喜羊羊\n#G魔族:\n神奇小龟,魔力斗兽,披甲战狼\n#Y仙族:\n神奇小龟,闲云野鹤,云魅仙鹿\n#S新三角色:\n#P(桃夭夭,偃无师,鬼潇潇)\n只能获得:宝贝葫芦\n#G龙太子和骨精灵因为当年官服版本原因没迭代人物坐骑造型\n故此也可以获得:宝贝葫芦\n#R坐骑任务#Y最后获得的\n#Y坐骑奖励和此物一致"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xD6363DD6
wds[13] = 0x5FBAB8DC

elseif wd == "金砖" then
wds[1] = "闪闪发光，可获得大量的银子。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x5453A471
wds[13] = 0xDDCB73B2
elseif wd == "储备" then
wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0x5453A471
wds[13] = 0xDDCB73B2
elseif wd == "仙丹" then
wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xF5883F17
wds[13] = 0x60F6CDD8
elseif wd == "育兽仙丹" then
wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "item.wdf"
wds[12] = 0xF5883F17
wds[13] = 0x60F6CDD8

elseif wd == "破裂的蛋" then
wds[1] = "一种神奇的蛋，蛋壳已经破裂，据说集齐99个破裂的蛋后就可以召唤出异兽纳为坐骑。右键点击使用。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0xD7478119
wds[13] = 0xE06A6568

elseif wd == "蓝色狐狸" or wd == "黄金狮子" or wd == "七彩祥云" or wd == "粉红火鸡" or wd == "彩虹毛驴"
        or wd == "粉嫩小猪" or wd == "深海狂鲨" or wd == "雷霆黑豹" or wd == "九尾妖狐" or wd == "砖石小马"
        or wd == "七彩神驴" or wd == "水晶芭蕉" or wd == "天南蝙蝠" or wd == "繁星珍珠" or wd == "繁星月亮"
        or wd == "国宝熊猫" or wd == "神偷兔兔" or wd == "圣诞狂欢" or wd == "鬼火南瓜" or wd == "神猫头鹰"
        or wd == "远古恐龙" or wd == "神域孔雀" or wd == "通天金牛" or wd == "雷天红狮" or wd == "飞天神鱼"
        or wd == "飞天神象" or wd == "飞天神虎" then

wds[1] = "这是一种神奇的动物。"
wds[2] = 778
wds[3] = 1
wds[4] = 0
wds[8] = 1
wds[11] = "窗口文字.wdf"
wds[12] = 0x00000015
wds[13] = 0x00000016

elseif wd == "祥瑞坐骑礼包" then
wds[1] = "内含坐骑宠物一只,开启后获得\n#S随机#G祥瑞的坐骑"
wds[2] = 21
wds[3] = 2
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xD6363DD6
wds[13] = 0x5FBAB8DC
elseif wd == "钨金" then
wds[1] = "一种十分稀有的矿产，其坚硬的性能受广大铸造师的喜爱，是熔炼装备的主要配料。"
wds[2] = 5
wds[3] = 6
wds[4] = 9
wds[11] = "item.wdf"
wds[12] = 0x18EAE6A5
wds[13] = 0x248E4364--
elseif string.find(wd, "点卡") then
wds[1] = "经典点卡，可兑换一定的点数。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xB914F9E5
wds[13] = 0xFEF0147A

elseif wd == "月卡" then
wds[1] = "经典月卡,每日可领取一定奖励,持续30日!"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[11] = "item.wdf"
wds[12] = 0xB914F9E5
wds[13] = 0xFEF0147A


elseif wd == "展翅高飞" then
wds[1] = "展翅高飞仰望天空，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "宝贝葫芦"
wds[11] = "item.wdf"
wds[12] = 0xD7E977F7
wds[13] = 0x6F09B32F
elseif wd == "旗开得胜" then
wds[1] = "凯旋之音，百战百胜，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "宝贝葫芦"
wds[11] = "item.wdf"
wds[12] = 0xD555E56C
wds[13] = 0x942AB7C0
elseif wd == "霸王雄风" then
wds[1] = "霸气雄风，拥有王者之气魄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "宝贝葫芦"
wds[11] = "item.wdf"
wds[12] = 0xDBB13B82
wds[13] = 0x01B8900E
elseif wd == "独眼观天" then
wds[1] = "非常有特色的装饰，装配后个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "神气小龟"
wds[11] = "item.wdf"
wds[12] = 0xAD1A3DAA
wds[13] = 0xA8C159D5
elseif wd == "威武不屈" then
wds[1] = "充满着坚贞顽强的气魄，照射出大丈夫的豪气，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "神气小龟"
wds[11] = "item.wdf"
wds[12] = 0xB4448E15
wds[13] = 0xE11D168A
elseif wd == "深藏不露" then
wds[1] = "具备神秘的力量，折射着独特的探险家的气味，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "神气小龟"
wds[11] = "item.wdf"
wds[12] = 0xC210C8A6
wds[13] = 0x38BB89C1
elseif wd == "异域浓情" then
wds[1] = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "汗血宝马"
wds[11] = "item.wdf"
wds[12] = 0x21E6E4AD
wds[13] = 0x2B3BD5AF
elseif wd == "流星天马" then
wds[1] = "如流星划过夜空，如天马飞跃彩虹，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "汗血宝马"
wds[11] = "item.wdf"
wds[12] = 0x4E622591
wds[13] = 0xE99C9229
elseif wd == "威猛将军" then
wds[1] = "战场上的最强者，威猛而无畏，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "汗血宝马"
wds[11] = "item.wdf"
wds[12] = 0x6734E476
wds[13] = 0xCA080495
elseif wd == "知情达理" then
wds[1] = "相互感知，生死与共，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "欢喜羊羊"
wds[11] = "item.wdf"
wds[12] = 0x42C8E012
wds[13] = 0xD84AEFD9
elseif wd == "气宇轩昂" then
wds[1] = "潇潇洒洒，气宇轩昂，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "欢喜羊羊"
wds[11] = "item.wdf"
wds[12] = 0xC29077C1
wds[13] = 0x153B18EB
elseif wd == "如花似玉" then
wds[1] = "如花似如梦，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "欢喜羊羊"
wds[11] = "item.wdf"
wds[12] = 0x56A40A70
wds[13] = 0x95F2DAEA
elseif wd == "傲视天下" then
wds[1] = "群雄傲世英雄盖世，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "魔力斗兽"
wds[11] = "item.wdf"
wds[12] = 0x399B3F51
wds[13] = 0xC124D1F4
elseif wd == "铁血豪情" then
wds[1] = "铁汉柔情，刚柔并济乃侠之大者，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "魔力斗兽"
wds[11] = "item.wdf"
wds[12] = 0xF0ECED8B
wds[13] = 0x369C76E3
elseif wd == "唯我独尊" then
wds[1] = "天大地大唯我独大，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "魔力斗兽"
wds[11] = "item.wdf"
wds[12] = 0xD8246960
wds[13] = 0x1F226C87
elseif wd == "叱咤风云" then
wds[1] = "一声怒喝而使风云翻滚，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "披甲战狼"
wds[11] = "item.wdf"
wds[12] = 0x82DBAAF6
wds[13] = 0x58DC5C54
elseif wd == "异域风情" then
wds[1] = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "披甲战狼"
wds[11] = "item.wdf"
wds[12] = 0x22245346
wds[13] = 0x7F5AF2ED
elseif wd == "假面勇者" then
wds[1] = "藏在面具后面的脸，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "披甲战狼"
wds[11] = "item.wdf"
wds[12] = 0x84389440
wds[13] = 0x6D92CEB9
elseif wd == "霓裳魅影" then
wds[1] = "似是天上仙女霓裳飘飘，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "闲云野鹤"
wds[11] = "item.wdf"
wds[12] = 0x347CE5F8
wds[13] = 0xC3127ABF
elseif wd == "披星戴月" then
wds[1] = "犹如夜空中最亮的星，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "闲云野鹤"
wds[11] = "item.wdf"
wds[12] = 0x7A72E56A
wds[13] = 0xFFB05D4D
elseif wd == "烈焰燃情" then
wds[1] = "热情澎湃，此物必配蒙情英雄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "闲云野鹤"
wds[11] = "item.wdf"
wds[12] = 0x1FFD79EC
wds[13] = 0x8B15F395
elseif wd == "天雨流芳" then
wds[1] = "似是天上流星天雨，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "云魅仙鹿"
wds[11] = "item.wdf"
wds[12] = 0x5B7FC4A3
wds[13] = 0x65099256
elseif wd == "灵光再现" then
wds[1] = "灵光闪动跳跃着智慧和力量，必是侠者不可缺少之物，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "云魅仙鹿"
wds[11] = "item.wdf"
wds[12] = 0x5E631741
wds[13] = 0x0587D5F5
elseif wd == "倾国倾城" then
wds[1] = "美艳动人，美丽与智慧并存，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
wds[2] = "坐骑饰品"
wds[3] = 1
wds[4] = "云魅仙鹿"
wds[11] = "item.wdf"
wds[12] = 0x208D42ED
wds[13] = 0x8138AFE1
elseif wd == "天蚕丝" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x14E761F5
wds[13] = 0x4460B6DC
elseif wd == "玄龟板" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x5623AC23
wds[13] = 0x375D214F
elseif wd == "阴沉木" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xD2817A66
wds[13] = 0x9331724B
elseif wd == "麒麟血" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 4
wds[11] = "item.wdf"
wds[12] = 0xD639DEE5
wds[13] = 0xF491B41E
elseif wd == "内丹" then
wds[1] = "修炼者经过百年甚至千年的修炼在体内以灵气结成的丹丸，是锻造法宝必备的材料。"
wds[2] = 1001
wds[3] = 1
wds[4] = 5
wds[11] = "item.wdf"
wds[12] = 0x32AAB711
wds[13] = 0x629E3769
elseif wd == "金凤羽" then
wds[1] = "蜂巢百凤之王金凤凰的羽毛，羽毛上带着不熄的火焰，一片凤羽即可燎原，是锻造法宝的上好材料。"
wds[2] = 1001
wds[3] = 1
wds[4] = 6
wds[11] = "item.wdf"
wds[12] = 0xDD59C419
wds[13] = 0x6060D273
elseif wd == "补天石" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 7
wds[11] = "item.wdf"
wds[12] = 0x3E7764B4
wds[13] = 0xC078A142
elseif wd == "龙之筋" then
wds[1] = "为合成法宝的材料之一"
wds[2] = 1001
wds[3] = 1
wds[4] = 8
wds[11] = "item.wdf"
wds[12] = 0x0309AD83
wds[13] = 0x335299FF
elseif wd == "金银锦盒" then
wds[1] = "满载富贵与祝福的锦盒，上交帮派白虎堂总管，使帮派增加50000的资金并获得10点帮贡。"
wds[2] = 1002
wds[3] = 1
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xA8BB247D
wds[13] = 0xF1AB952C
elseif wd == "神秘钥匙" then
wds[1] = "神秘的钥匙，使用后有意想不到的效果。"
wds[2] = 1002
wds[3] = 1
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0xA4E274FD
wds[13] = 0x65649830
elseif wd == "仙玉锦囊" then
wds[1] = "传闻是仙神身上携带的锦囊，开启1000仙玉。"
wds[2] = 1002
wds[3] = 1
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x1563E41D
wds[13] = 0xB7A2F46E
elseif string.find(wd, "点仙玉") then
    local 取出=分割文本(wd,"点")
    wds[1] = "传闻是仙神身上携带的锦囊，开启"..取出[1].."仙玉。"
    wds[2] = 1002
    wds[3] = 1
    wds[4] = 3
    wds[11] = "物品图标.wdf"
    wds[12] = 0x1563E41D
    wds[13] = 0xB7A2F46E

elseif wd == "随机强化丹" then
wds[1] = "使用后随机强化技能等级增加一级。"
wds[2] = 1002
wds[3] = 1
wds[4] = 3
wds[11] = "物品图标.wdf"
wds[12] = 0X75E517A5
wds[13] = 0XBBBF65A1
elseif wd == "强化升级丹" then
wds[1] = "使用后增加强化技能等级一级。"
wds[2] = 1
wds[3] = 11
wds[4] = 0
wds[8] = 3
wds[11] = "物品图标.wdf"
wds[12] = 0X5ECBF9DD
wds[13] = 0X389EAEC4
elseif wd == "进化丹" then
wds[1] = "用于宠物进化。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0X5ECBF9DD
wds[13] = 0X389EAEC4
elseif wd == "造灵丹" then
wds[1] = "用于宠物造灵。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0X75E517A5
wds[13] = 0XBBBF65A1
elseif wd == "魔化丹" then
wds[1] = "用于宠物魔化。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "赐福图标.wdf"
wds[12] = 0x47180002
wds[13] = 0x47AD0001
elseif wd == "觉醒丹" then
wds[1] = "用于宠物觉醒。"
wds[2] = 9
wds[3] = 0
wds[4] = 0
wds[11] = "赐福图标.wdf"
wds[12] = 0xA3080002
wds[13] = 0xA39D0001



elseif wd == "贪狼令牌" then
wds[1] = "积攒999个，可找老G换贪狼神兽一只。"
wds[2] = 1003
wds[3] = 11
wds[4] = 0
wds[8] = 1
wds[11] = "item.wdf"
wds[12] = 0x3DD12EF3
wds[13] = 0x8F8DC4AF

elseif wd == "降魔斗篷" then
wds[1] = "战斗中遭受法术攻击的时候有一定几率出现神兵现身保护，随着境界提升增加被保护的几率。"
wds[2] = 1000
wds[3] = 2
wds[4] = 3
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "item.wdf"
wds[12] = 0x8F0E6273
wds[13] = 0xC1B54E00
elseif wd == "缚妖索" then
wds[1] = "天师的法宝，战斗中祭起后将目标牢牢捆缚住，使其的逃跑成功率降低。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xD1AE3698
wds[13] = 0x555438C2
elseif wd == "鬼脸面具" then
wds[1] = "用天蚕丝所制的面具，辅以上古符咒，是非常好的变身辅助。戴上它可以在战斗中使用变身卡进行变身。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xF6001248
wds[13] = 0x119F576D
elseif wd == "金钱镖" then
wds[1] = "财神爷的看家宝贝，散出千枚铜钱伤人，如果碰上不为金钱所动的人就没有办法了。每次使用消耗当前金钱2000。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 1
wds[6] = 60
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x3D9C84A5
wds[13] = 0xC876D78A
elseif wd == "玄冰面具" then
wds[1] = "戴上这个面具，面容就像千年寒冰下的湖水，谁也不知道是什么样子，拥有者可以在战斗中使用变身卡变幻身份。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x2A0DD83C
wds[13] = 0xC1D43099
elseif wd == "降魔斗篷" then
wds[1] = "采天蚕之丝，辅以七彩云锻为其缝制的斗篷，披上它有几率抵挡部分法术伤害。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x8F0E6273
wds[13] = 0xC1B54E00
elseif wd == "捆仙绳" then
wds[1] = "天庭法宝，专为缉拿神仙所制，材料不知为何物，柔韧结实，一旦被捆则降低目标的逃跑成功率。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x2320B82F
wds[13] = 0x483454AC
elseif wd == "现形符" then
wds[1] = "无论对方如何变幻形体，用此符都有可能将其识破。只允许在战斗中对对方使用，有一定几率解除目标变身效果。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x86AF33D1
wds[13] = 0x6FE3C110
elseif wd == "聚妖铃" then
wds[1] = "这铃铛声是号召妖怪们战斗的号角，据说是蚩尤当年为涿鹿之战而制。战斗中摇晃此铃，附近的妖物会聚集过来协助战斗。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xCB2C7DF6
wds[13] = 0xCF3377CC
elseif wd == "万鬼幡" then
wds[1] = "地府钟馗的法宝，此幡一祭，天地变色，鬼影憧憧，黄泉十万阴兵应幡而出。在战斗中使用可以召唤鬼魂助战。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 150
wds[8] = 150
wds[11] = "xfb.wdf"
wds[12] = 0xF1D0DFC7
wds[13] = 0x0E4DC36F
elseif wd == "番天印" then
wds[1] = "广成子修炼的独门宝贝，砸中后能使人神志不清，三魂出窍，失去对法宝的控制。战斗中祭后有一定几率使目标身上佩带的被动法宝3回合内失去作用。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xB33784E0
wds[13] = 0x8B590810
elseif wd == "罗汉珠" then
wds[1] = "使用后玩家下3个回合使用任何消耗魔法的门派法术消耗减少。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x14846B1B
wds[13] = 0x695614DB
elseif wd == "分水" then
wds[1] = "以水为盾，可以护体。此宝为西海龙女佩带之物，佩带后遭受攻击时一定几率将伤害转化为气血，是龙宫秘宝。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0xD330F6C9
wds[13] = 0xF1CF0FC1
elseif wd == "赤焰" then
wds[1] = "此物乃牛魔王与铁扇公主定情之时赠送给娘子的宝贝，使用此宝能在三回合内回复魔法。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 1
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x743685D8
wds[13] = 0x62AEC7E3
elseif wd == "宝烛" then
wds[1] = "当佩戴者当前气血小于气血最大值的70%时，每回合恢复一定的当前气血。效果随法宝等级提升而提升。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x044A3417
wds[13] = 0x14A6F162
elseif wd == "天煞" then
wds[1] = "上面记载着凌波城的秘法，可以大幅度提升凌波城弟子的物理伤害威力。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 0
wds[8] = 0
wds[11] = "xfb.wdf"
wds[12] = 0x690B67CD
wds[13] = 0xE498691F
elseif wd == "神木宝鼎" then
wds[1] = "神木林祭师祭天地所用之物。佩带在战斗中此鼎临时提升增加大量法术伤害。"
wds[2] = 1000
wds[3] = 2
wds[4] = 1
wds[5] = 0
wds[6] = 80
wds[7]= 10
wds[8] = 10
wds[11] = "xfb.wdf"
wds[12] = 0x93A0FC49
wds[13] = 0xF07197ED
elseif wd == "曼陀罗" then
wds[1] = "精巧的银制匣子，内藏百花之毒，是女儿村的镇山法宝，佩戴此宝的女儿村弟子封印抗封得到相应提高。"
wds[2] = 1000
wds[3] = 3
wds[4] = 1
wds[5] = 0
wds[6] = 100
wds[7]= 0
wds[8] = 0
wds[11] = "common/item1.wdf"
wds[12] = 0x9E4D4D2A--
wds[13] = 0x546D7271
elseif wd =="驭魔笼" then        ------九黎法宝
wds[1] = "【九黎城门派法宝】昔日蚩尤遨游魔域，收服万邪，以此笼囚禁诸魔异兽，妖气浓郁，威压四方。佩戴后可令“黎魂”触发3个师门技能概率增加。"
wds[2] = 1000
wds[3] = 3
wds[4] = 1
wds[5] = 0
wds[6] = 100
wds[7] = 1
wds[8] = 0
wds[11] = "jmtb.wdf"
wds[12] = 0x10000075 ---小
wds[13] = 0x10000076
elseif wd=="铸兵锤" then
wds[1] = "于九黎城魔息熔浆中锻炼，由兵主蚩尤亲自铸造，魔兵之魂汇入其中，击之震撼乾坤。佩戴后有几率使三荒尽灭人数+1。"
wds[2] = 1000
wds[3] = 1
wds[4] = 1
wds[5] = 0
wds[6] = 60
wds[7] = 1
wds[8] = 0
wds[11] = "jmtb.wdf"
wds[12] = 0x10000077
wds[13] = 0x10000078
elseif wd == "冰符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x934E9733
wds[13] = 0x6A962ED6
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {体质=1}
elseif wd == "土符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x3E964C29
wds[13] = 0x7E78A604
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {耐力=1}
elseif wd == "雷符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x67B1F794
wds[13] = 0x953A5574
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {敏捷=1}
elseif wd == "电符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xFCCD6BDA
wds[13] = 0x45E07435
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {法术防御=1}
elseif wd == "风符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x9D282EE9
wds[13] = 0x4180FB8D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黄色"
wds[21] = {魔力=1}
elseif wd == "炎符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x21B13715
wds[13] = 0xEEAF3D8E
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黄色"
wds[21] = {力量=1}
elseif wd == "火符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0xDC81D311
wds[13] = 0x71E54CDB
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黄色"
wds[21] = {法术伤害=1}
elseif wd == "红云符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x76BEE0E4
wds[13] = 0x74261456
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {气血=10}
elseif wd == "碧玉符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x43676CDF
wds[13] = 0x74261456
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {防御=3}
elseif wd == "金光符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x5737526C
wds[13] = 0x727F812B
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {命中=4}
elseif wd == "天神符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x81D8C883
wds[13] = 0x24549F76
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {伤害=1.5}
elseif wd == "飘渺符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x6B9B8016
wds[13] = 0x463956C5
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "绿色"
wds[21] = {灵力=1.5}
elseif wd == "天仙符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0xE059F69F
wds[13] = 0xCC940789
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "绿色"
wds[21] = {魔法=6}
elseif wd == "霞光符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0xC32FCFBF
wds[13] = 0xC94732AA
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "绿色"
wds[21] = {速度=1.5}
elseif wd == "逍遥符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x96B0982
wds[13] = 0x8CCCA725
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "绿色"
wds[21] = {躲避=3}
elseif wd == "虹珀符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x5CF34122
wds[13] = 0xDF8358B
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,魔法=6}
elseif wd == "陌影符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x6CCF8F49
wds[13] = 0x2207D0E7
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,命中=4}
elseif wd == "北冥符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x90B92A2C
wds[13] = 0x8197B629
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,伤害=1.5}
elseif wd == "灵月符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xFEA25D6F
wds[13] = 0xD83B95B5
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,防御=3}
elseif wd == "锦瑟符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x22CBF322
wds[13] = 0xA9D94F23
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,速度=1.5}
elseif wd == "银光符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xFC3CDE97
wds[13] = 0x23F7A22E
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,躲避=3}
elseif wd == "清心符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x5610AE50
wds[13] = 0x2E6B730A
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,灵力=1.5}
elseif wd == "星辰符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x2E893EE4
wds[13] = 0x41C0E80A
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,法术伤害=2}
elseif wd == "雪月符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xEF64D308
wds[13] = 0x1088694D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,法术防御=2}
elseif wd == "玄魂符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x35232317
wds[13] = 0xBCA29B7A
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {体质=1,固定伤害=2}
elseif wd == "乾坤符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x7F4F2A9
wds[13] = 0x44861CDA
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,气血=10}
elseif wd == "珍珀符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x5CF34122
wds[13] = 0x0DF8358B
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,魔法=6}
elseif wd == "银竹符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x3C1B72B
wds[13] = 0xCCE17B90
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,命中=4}
elseif wd == "神川符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xF95B369D
wds[13] = 0x240C05AE
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,伤害=1.5}
elseif wd == "玲珑符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x6AACFD5
wds[13] = 0x22F35AB7
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,速度=1.5}
elseif wd == "暮影符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x66A5CAF
wds[13] = 0xA1EFCBCD
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,躲避=3}
elseif wd == "天珍符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xDD550E98
wds[13] = 0x5A1058B4
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,灵力=1.5}
elseif wd == "九影符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xC14E158C
wds[13] = 0x74570AD9
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,法术伤害=2}
elseif wd == "百冥符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xE7C31FAB
wds[13] = 0x204A7770
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,法术防御=2}
elseif wd == "莫念符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x35232317
wds[13] = 0x7E8A4D54
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {耐力=1,固定伤害=2}
elseif wd == "醉魂符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xDF29F445
wds[13] = 0x684A5B33
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,气血=10}
elseif wd == "玄羽符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x2BFB0E6E
wds[13] = 0xFD8EB3CF
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,命中=4}
elseif wd == "霸风符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x579C9F2A
wds[13] = 0x5AA0CA98
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,伤害=1.5}
elseif wd == "无相符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x4ADA8502
wds[13] = 0x5FBDBE85
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,防御=3}
elseif wd == "无极符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x1ED49DA6
wds[13] = 0x8A6D58ED
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,速度=1.5}
elseif wd == "紫晶符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x53616D8A
wds[13] = 0xA7782996
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,躲避=3}
elseif wd == "圣火符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xCA106E2F
wds[13] = 0x74D36FFF
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,固定伤害=2}
elseif wd == "昔光符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x6FC365B8
wds[13] = 0xCBD03425
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,魔法=6}
elseif wd == "子蚀符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xF688BFDE
wds[13] = 0x93C04775
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,法术防御=2}
elseif wd == "流风符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x9D0D30EF
wds[13] = 0x9B44A508
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {魔力=1,法术伤害=1.5}
elseif wd == "地炎符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x9577140F
wds[13] = 0x2B2257FF
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,气血=10}
elseif wd == "素影符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xED15475A
wds[13] = 0x17DE2A61
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,魔法=6}
elseif wd == "燕灵符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xEE41CD63
wds[13] = 0xD5F14ADC
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,防御=3}
elseif wd == "降龙符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xEA2DFDAF
wds[13] = 0x7F18A6FB
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,速度=1.5}
elseif wd == "苍玉符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x867985EB
wds[13] = 0x5336983C
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,躲避=3}
elseif wd == "流魂符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xF0888E17
wds[13] = 0xF21E1F30
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,灵力=1.5}
elseif wd == "九凤符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x7CCD1DFA
wds[13] = 0xEC558958
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,法术防御=2}
elseif wd == "墨陀符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x3F791B1
wds[13] = 0x44ED9122
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,法术伤害=2}
elseif wd == "南夕符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x5DBC1A4E
wds[13] = 0xBAB64C34
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {力量=1,固定伤害=2}
elseif wd == "引幽符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xA3130920
wds[13] = 0xAC5683E0
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,气血=10}
elseif wd == "波涛符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x5DA7088A
wds[13] = 0xDFD1841C
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,魔法=6}
elseif wd == "铃星符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0xAC6C9B58
wds[13] = 0x7D44AFFC
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,命中=4}
elseif wd == "狂念符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x64DD0A08
wds[13] = 0x5D8AFACD
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,伤害=1.5}
elseif wd == "乱花符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x9722DD59
wds[13] = 0xFAE16C2E
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,灵力=1.5}
elseif wd == "幽月符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x8EDB338
wds[13] = 0x5C16DDD5
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,法术伤害=2}
elseif wd == "两仪符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x6149F028
wds[13] = 0xB0A5618D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,法术防御=2}
elseif wd == "七情符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x4FBA3175
wds[13] = 0x35DC8D80
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,固定伤害=2}
elseif wd == "召影符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x7AF9E2F7
wds[13] = 0xF28A91D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {敏捷=1,防御=3}
elseif wd == "太阳符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "红色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "少阳符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黄色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "少阴符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "蓝色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "太阴符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "绿色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "阳仪符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "白色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "阴仪符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "黑色"
wds[21] = {气血=15,速度=1.5}
elseif wd == "太极符石" then
wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
wds[2] = 889
wds[3] = 88
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0XDE2C33B7
wds[13] = 0x40DAD77D
wds[15] = "可以镶嵌在有开运孔数的装备上"
wds[20] = "紫色"
wds[21] = {气血=15,速度=1.5}
elseif wd =="一级未激活符石" then
wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
wds[2] = 889
wds[3] = 2
wds[4] = 1
wds[11] = "item.wdf"
wds[12] = 0x580E0DE1
wds[13] = 0xC45E19C4
wds[15] = "鼠标右键点击使用激活"
elseif wd =="二级未激活符石" then
wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
wds[2] = 889
wds[3] = 2
wds[4] = 2
wds[11] = "item.wdf"
wds[12] = 0x580E0DE1
wds[13] = 0xC45E19C4
wds[15] = "鼠标右键点击使用激活"
elseif wd =="三级未激活符石" then
wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
wds[2] = 889
wds[3] = 2
wds[4] = 3
wds[11] = "item.wdf"
wds[12] = 0x580E0DE1
wds[13] = 0xC45E19C4
wds[15] = "鼠标右键点击使用激活"
----------------------------


elseif wd =="未激活的星石" then
wds[1] = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
wds[2] = 889
wds[3] = 1
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0x6F4932B8
wds[13] = 0xE305DAF3
wds[15] = "鼠标右键点击使用激活"
elseif wd == "符石卷轴" then
wds[1] = "一张记载高级符石合成方式的卷轴。"
wds[2] = 889
wds[3] = 2
wds[4] = 6
wds[11] = "item.wdf"
wds[12] = 0xF9DD83C6
wds[13] = 0xDF3E0DDE
elseif wd == "云荒" then
wds[1] = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
wds[2] = 889
wds[3] = 91
wds[4] = 1
wds[11] = "item.wd1"
wds[12] = 0xA2E438B8
wds[13] = 0x457CA6AB
elseif wd == "暮霭" then
wds[1] = "正反两面为不同颜色的陨星。双面绯二色,暮沉沉,楚天辽阔。"
wds[2] = 889
wds[3] = 91
wds[4] = 2
wds[11] = "item.wd1"
wds[12] = 0XF53294B4
wds[13] = 0XF91B9A26
elseif wd == "落日" then
wds[1] = "正反两面为不同颜色的陨星。双面金赤二色，落日熔金，山河沐血。"
wds[2] = 889
wds[3] = 91
wds[4] = 3
wds[11] = "item.wd1"
wds[12] = 0x0C940FE8
wds[13] = 0x9A9DB0F8
elseif wd == "晓天" then
wds[1] = "正反两面为不同色的陨星。双面苍二色,晓天迷雾,江川双寥。"
wds[2] = 889
wds[3] = 91
wds[4] = 4
wds[11] = "item.wd1"
wds[12] = 0X6DC88994
wds[13] = 0x155DBB4A
elseif wd == "林海" then
wds[1] = "正反两面为不同颜色的陨星。双面翠青二色，林海叠翠，远峰数青。"
wds[2] = 889
wds[3] = 91
wds[4] = 5
wds[11] = "item.wd1"
wds[12] = 0xA61A5027
wds[13] = 0x3B34F66E
elseif wd == "流霞" then
wds[1] = "正反两面为不同颜色的陨星。双面绯二色,流霞浴火,枫舞霜天。"
wds[2] = 889
wds[3] = 91
wds[4] = 6
wds[11] = "item.wd1"
wds[12] = 0X5F22903A
wds[13] = 0x8DA4F07E
elseif wd == "巨剑·元身" then
wds[1] = "等待被唤醒的洪荒巨剑，与战魄一起锻造为[长息]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0XD5E5ADD3
wds[13] = 0X43CC0E3B
elseif wd == "伞·元身" then
wds[1] = "等待被唤醒的风云之伞，与战魄一起锻造成为[晴雪]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0XCB5C6EFD
wds[13] = 0x47EA4C41
elseif wd == "灯笼·元身" then
wds[1] = "等待被唤醒的河汉之灯，与战魄一起锻造为[荒尘]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x7AE2641F
wds[13] = 0x4DCB3823
elseif wd == "长杖·元身" then
wds[1] = "等待被唤醒的天地之杖，与战魄一起锻造为[弦月]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x3221FB78
wds[13] = 0x7023E521
elseif wd == "宝珠·元身" then
wds[1] = "等待被唤醒的盘古之珠，与战魄一起锻造为[赤明]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xAED3678B
wds[13] = 0x9381644E
elseif wd == "弓·元身" then
wds[1] = "等待被唤醒的射日之弓，与战魄一起锻造为[若木]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xCE170DFA
wds[13] = 0x157E1425
elseif wd == "扇·元身" then
wds[1] = "等待被唤醒的玄冥之扇，与战魄一起锻造为[星瀚]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x6DF2FD31
wds[13] = 0x4370EED8
elseif wd == "刀·元身" then
wds[1] = "等待被唤醒的复仇之刀，与战魄一起锻造为[鸣鸿]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x42313640
wds[13] = 0xE8E78B92
elseif wd == "剑·元身" then
wds[1] = "等待被唤醒的宿敌之剑，与战魄一起锻造为[擒龙]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xAD7B3E5B
wds[13] = 0xE0BB9E80
elseif wd == "斧·元身" then
wds[1] = "等待被唤醒的魔君之斧，与战魄一起锻造为[裂天]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xFBEC3D5B
wds[13] = 0xE5709BCF
elseif wd == "锤·元身" then
wds[1] = "等待被唤醒的盘古龙齿，与战魄一起锻造为[碎寂]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x397D0A2C
wds[13] = 0x4A0E1D74
elseif wd == "枪·元身" then
wds[1] = "等待被唤醒的王者之枪，与战魄一起锻造为[弑皇]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xAA64F92D
wds[13] = 0x2F2973EB
elseif wd == "飘带·元身" then
wds[1] = "等待被唤醒的九霄澄云，与战魄一起锻造为[九霄]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x4F4AD0CD
wds[13] = 0xDF316EF7
elseif wd == "魔棒·元身" then
wds[1] = "等待被唤醒的混沌异果，与战魄一起锻造为[醍醐]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x8D1F0679
wds[13] = 0xAB525F51
elseif wd == "双环·元身" then
wds[1] = "等待被唤醒的朝夕霞雾，与战魄一起锻造为[朝夕]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x111D93EB
wds[13] = 0x7D9D4D19
elseif wd == "双剑·元身" then
wds[1] = "等待被唤醒的双飞利刃，与战魄一起锻造为[浮犀]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xEB9EDC89
wds[13] = 0x5EDAC2DE
elseif wd == "长鞭·元身" then
wds[1] = "等待被唤醒的九曲月华，与战魄一起锻造为[霜陨]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x94B20072
wds[13] = 0x1C30212D
elseif wd == "爪刺·元身" then
wds[1] = "等待被唤醒的天地离愁，与战魄一起锻造为[离钩]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x0F776C4A
wds[13] = 0x9CE1A36C
elseif wd == "头盔·元身" then
wds[1] = "等待被唤醒的浑天玄火，与战魄一起锻造为[浑天玄火盔]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x764A4001
wds[13] = 0x80644D9A
elseif wd == "冠冕·元身" then
wds[1] = "等待被唤醒的乾元鸣凤，与战魄一起锻造为[乾元鸣凤冕]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xCD93E6F7
wds[13] = 0xD97AD016
elseif wd == "坚甲·元身" then
wds[1] = "等待被唤醒的混元一气，与战魄一起锻造为[混元一气甲]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xD08B5887
wds[13] = 0x5FC5E447
elseif wd == "纱衣·元身" then
wds[1] = "等待被唤醒的鎏金浣月，与战魄一起锻造为[鎏金浣月衣]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x99EDA596
wds[13] = 0x4A94E5EC
elseif wd == "挂坠·元身" then
wds[1] = "等得被唤醒的落霞陨星，与战魄一起锻造为[落霞陨星坠]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x2365F2C0
wds[13] = 0xC31B0927
elseif wd == "束带·元身" then
wds[1] = "等待被唤醒的紫霄云芒，与战魄一起锻造为[紫霄云芒带]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x83D8E526
wds[13] = 0xDA79287A
elseif wd == "鞋履·元身" then
wds[1] = "等待被唤醒的紫霄云芒，与战魄一起锻造为[紫霄云芒带]。"
wds[2] = 66
wds[3] = 1
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0x2D4D76E4
wds[13] = 0x2E7EEDEF
elseif wd == "战魂" then
wds[1] = "十二神兵精魄所凝的玄彩战魄，不屈的杀意仍在其间咆哮呐喊，他们誓要铸躯重生，再续与魔气这万年未竟之战，与元身一同锻造则可制作160级装备。"
wds[2] = 67
wds[3] = 2
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xF87C4047
wds[13] = 0x54382E1C
elseif wd == "陨铁" then
wds[1] = "由婉君雷霆劈裂出来的陨铁，由于千万年来被神兵与魔气交战所淬炼，其上的痕迹无一不铭刻着各式神兵的印记，亦含有强大神秘力量。可对150级装备进行幻化。"
wds[2] = 65
wds[3] = 3
wds[4] = 0
wds[11] = "物品图标.wdf"
wds[12] = 0xe1e3f845
wds[13] = 0x26dc005

elseif wd == "如意符" then
wds[1] = "用于删除家具，右击使用，点击要删除的家具就可以了"
wds[2] = 201
wds[3] = 3
wds[4] = 0
wds[11] = "房屋图标.wdf"
wds[12] = 0x56D82E47
wds[13] = 0xA2148CBF
elseif wd == "蝴蝶兰" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xF1AA1CDC
wds[13] = 0x3DCA686
wds[15] = "鼠标右键点击使用"
elseif wd == "桦木圆桌" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xEA3F791
wds[13] = 0x48FAED8
wds[15] = "鼠标右键点击使用"
elseif wd == "五谷轮回桶" then
wds[1] = ""
wds[2] = 200
wds[3] = 4
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xE14D7033
wds[13] = 0x85E408B
wds[15] = "鼠标右键点击使用"
elseif wd == "凤凰傲意图" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x9AE42B3
wds[13] = 0x4488275C
wds[15] = "鼠标右键点击使用"
elseif wd == "狮子图屏风" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xC15DCDE
wds[13] = 0xB77C05F8
wds[15] = "鼠标右键点击使用"
elseif wd == "神仙帐" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x7336C5AB
wds[13] = 0xE745545
wds[15] = "鼠标右键点击使用"
elseif wd == "麻布地毯" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xFFC56CAC
wds[13] = 0xFFC56CAC
wds[15] = "鼠标右键点击使用"
elseif wd == "虎威太师椅" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xDD6A29AE
wds[13] = 0x9662814C
wds[15] = "鼠标右键点击使用"
elseif wd == "红木地板" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xDD1346DC
wds[13] = 0x35997A39
wds[15] = "鼠标右键点击使用"
elseif wd == "桦木立柜" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x40DBF469
wds[13] = 0x950DB91E
wds[15] = "鼠标右键点击使用"
elseif wd == "月牙凳" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x36FEC0EE
wds[13] = 0x958ACF12
wds[15] = "鼠标右键点击使用"
elseif wd == "银烛台" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x1802F06C
wds[13] = 0x966FD5CD
wds[15] = "鼠标右键点击使用"
elseif wd == "蓝绸绣花帘" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x43D43BC3
wds[13] = 0x59166107
wds[15] = "鼠标右键点击使用"
elseif wd == "波丝地毯" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x5FF1A254
wds[13] = 0x5FF1A254
wds[15] = "鼠标右键点击使用"
elseif wd == "千佛图" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xFD182818
wds[13] = 0xA9B71F42
wds[15] = "鼠标右键点击使用"
elseif wd == "双鱼吉庆柜" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x7CF14A8C
wds[13] = 0xFC060E32
wds[15] = "鼠标右键点击使用"
elseif wd == "仙人掌" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x3970879B
wds[13] = 0xFB18050C
wds[15] = "鼠标右键点击使用"
elseif wd == "雕花马桶" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x264A5EC9
wds[13] = 0xF0698B61
wds[15] = "鼠标右键点击使用"
elseif wd == "水仙" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x10ACEF55
wds[13] = 0x2BA074EC
wds[15] = "鼠标右键点击使用"
elseif wd == "漆花地板" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xBC647367
wds[13] = 0x1133B493
wds[15] = "鼠标右键点击使用"
elseif wd == "花鸟图屏风" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x16B2E033
wds[13] = 0xA466DED1
wds[15] = "鼠标右键点击使用"
elseif wd == "龟鹤延年灯" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x17520E38
wds[13] = 0x338882F8
wds[15] = "鼠标右键点击使用"
elseif wd == "壮丽山河" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x1C93E78C
wds[13] = 0xEABCDF89
wds[15] = "鼠标右键点击使用"
elseif wd == "踏春图" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x1D00C78D
wds[13] = 0xE14EA35A
wds[15] = "鼠标右键点击使用"
elseif wd == "红木八仙桌" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x1E3B47E4
wds[13] = 0xCE322B80
wds[15] = "鼠标右键点击使用"
elseif wd == "黑麻垂曼帘" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xBB7384E5
wds[13] = 0x1F74CEFC
wds[15] = "鼠标右键点击使用"
elseif wd == "雕花马桶" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x264A5EC9
wds[13] = 0xF0698B61
wds[15] = "鼠标右键点击使用"
elseif wd == "漆花竹凳" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x2A858ABF
wds[13] = 0xDD195E16
wds[15] = "鼠标右键点击使用"
elseif wd == "白虎皮地毯" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xE873EBDA
wds[13] = 0x2B479E5D
wds[15] = "鼠标右键点击使用"
elseif wd == "天山云雪" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x2F988214
wds[13] = 0xC59023F1
wds[15] = "鼠标右键点击使用"
elseif wd == "桦木靠背椅" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x31FC79B2
wds[13] = 0x6FC9A4F8
wds[15] = "鼠标右键点击使用"
elseif wd == "百兽镇邪桌" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x33181B3E
wds[13] = 0x38B5ADC6
wds[15] = "鼠标右键点击使用"
elseif wd == "八宝呈祥桌" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x34F3E6FA
wds[13] = 0xD941BC31
wds[15] = "鼠标右键点击使用"
elseif wd == "黄锻锦边帘" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x373D5C17
wds[13] = 0xE71A42E5
wds[15] = "鼠标右键点击使用"
elseif wd == "彩绘立柜" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA52D57A2
wds[13] = 0x40DC127D
wds[15] = "鼠标右键点击使用"
elseif wd == "夕阳山水图" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x64D8CADE
wds[13] = 0xCC5DD99C
wds[15] = "鼠标右键点击使用"
elseif wd == "兽皮地毯" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x69CC2D84
wds[13] = 0xE3EFB84D
wds[15] = "鼠标右键点击使用"
elseif wd == "麻布地毯" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x69CC2D84
wds[13] = 0x6A2EADCD
wds[15] = "鼠标右键点击使用"
elseif wd == "红杏闹春帘" then
wds[1] = ""
wds[2] = 200
wds[3] = 4
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x6C7143EF
wds[13] = 0x80D12303
wds[15] = "鼠标右键点击使用"
elseif wd == "紫檀雕花椅" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "印花屏风" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x8D1C9B16
wds[13] = 0x6E75C55E
wds[15] = "鼠标右键点击使用"
elseif wd == "玉瓷画瓶" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x72B05C62
wds[13] = 0xBD83A424
wds[15] = "鼠标右键点击使用"
elseif wd == "嵌玉虎纹桌" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x749A8DE7
wds[13] = 0x822EDE52
wds[15] = "鼠标右键点击使用"
elseif wd == "招财聚宝柜" then
wds[1] = ""
wds[2] = 200
wds[3] = 4
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x7EF80073
wds[13] = 0xB3589DB5
wds[15] = "鼠标右键点击使用"
elseif wd == "八卦镇邪塌" then
wds[1] = ""
wds[2] = 200
wds[3] = 4
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x9C7E2DE5
wds[13] = 0x8479C234
wds[15] = "鼠标右键点击使用"
elseif wd == "龙凤呈祥" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xCA7094E6
wds[13] = 0xF001907F
wds[15] = "鼠标右键点击使用"
elseif wd == "文竹" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA3E461E0
wds[13] = 0xE6265000
wds[15] = "鼠标右键点击使用"
elseif wd == "金座雕龙屏风" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xBED2AAC0
wds[13] = 0xE43EE153
wds[15] = "鼠标右键点击使用"
elseif wd == "木地板" then
wds[1] = ""
wds[2] = 200
wds[3] = 42
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xE2A1D30F
wds[13] = 0xE2A1D30F
wds[15] = "鼠标右键点击使用"
elseif wd == "长信女宫灯" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x9FAC7C21
wds[13] = 0xDEC76AF6
wds[15] = "鼠标右键点击使用"
elseif wd == "紫檀雕花柜" then
wds[1] = ""
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xDF3EB09B
wds[13] = 0xD78204FC
wds[15] = "鼠标右键点击使用"
elseif wd == "宁安夜梦" then
wds[1] = ""
wds[2] = 200
wds[3] = 4
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xDB9D4A0F
wds[13] = 0xA02C51DB
wds[15] = "鼠标右键点击使用"
elseif wd == "彩绘花瓶" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xD9438601
wds[13] = 0xA3274661
wds[15] = "鼠标右键点击使用"
elseif wd == "白鹤展翅帘" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xD0522308
wds[13] = 0xBA96E2CF
wds[15] = "鼠标右键点击使用"
elseif wd == "桦木地板" then
wds[1] = ""
wds[2] = 200
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xDD1346DC
wds[13] = 0x8E5DC844
wds[15] = "鼠标右键点击使用"
elseif wd == "君子兰" then
wds[1] = ""
wds[2] = 200
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xAE1FE52C
wds[13] = 0x8A122388
wds[15] = "鼠标右键点击使用"
elseif wd == "白栅绿竹门" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x2DAB0826
wds[13] = 0xFAD67DD7
wds[15] = "鼠标右键点击使用"
elseif wd == "篱笆花圃" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x6C72DD99
wds[13] = 0x8864A0CD
wds[15] = "鼠标右键点击使用"
elseif wd == "篱笆院墙" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x8C633A1C
wds[13] = 0xA5231FE6
wds[15] = "鼠标右键点击使用"
elseif wd == "石凳" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x6E128DF0
wds[13] = 0x2C1A8B0E
wds[15] = "鼠标右键点击使用"
elseif wd == "石制宫灯" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA7335624
wds[13] = 0x730D86FC
wds[15] = "鼠标右键点击使用"
elseif wd == "石制影壁" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x855CEC56
wds[13] = 0x1319D9F2
wds[15] = "鼠标右键点击使用"
elseif wd == "石桌" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA4526D87
wds[13] = 0x25B4AC07
wds[15] = "鼠标右键点击使用"
elseif wd == "大理石凳" then
wds[1] = ""
wds[2] = 202
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xB4BAF8A6
wds[13] = 0x9604FFF6
wds[15] = "鼠标右键点击使用"
elseif wd == "大理石花圃" then
wds[1] = ""
wds[2] = 202
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x76F59455
wds[13] = 0x3FD069AF
wds[15] = "鼠标右键点击使用"
elseif wd == "大理石桌" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x5C5CA419
wds[13] = 0x4D8638F2
wds[15] = "鼠标右键点击使用"
elseif wd == "红漆雕花门" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x04DD49CD
wds[13] = 0x5242BF7B
wds[15] = "鼠标右键点击使用"
elseif wd == "青瓷花盆" then
wds[1] = ""
wds[2] = 202
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x91444F58
wds[13] = 0x993DEAF9
wds[15] = "鼠标右键点击使用"
elseif wd == "青石路砖" then
wds[1] = ""
wds[2] = 202
wds[3] = 2
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xD1194D50
wds[13] = 0x8D95A24
wds[15] = "鼠标右键点击使用"
elseif wd == "青铜鼎" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x9EC60BCF
wds[13] = 0xB84D82E
wds[15] = "鼠标右键点击使用"
elseif wd == "石制院墙" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x9166DA38
wds[13] = 0x1C09259A
wds[15] = "鼠标右键点击使用"
elseif wd == "白玉花圃" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xFBCA03F8
wds[13] = 0xA981ED59
wds[15] = "鼠标右键点击使用"
elseif wd == "白玉狮子" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x2DAB0826
wds[13] = 0x54465561
wds[15] = "鼠标右键点击使用"
elseif wd == "白玉石凳" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x289B58A7
wds[13] = 0xD74AAC36
wds[15] = "鼠标右键点击使用"
elseif wd == "白玉石桌" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xB9751A7A
wds[13] = 0xA2D03958
wds[15] = "鼠标右键点击使用"
elseif wd == "白玉影壁" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x835DDD76
wds[13] = 0x85F6F181
wds[15] = "鼠标右键点击使用"
elseif wd == "花岗石路砖" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x36D589DC
wds[13] = 0x2F630A54
wds[15] = "鼠标右键点击使用"
elseif wd == "混土砖石院墙" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x8BAC864B
wds[13] = 0x4680BDAE
wds[15] = "鼠标右键点击使用"
elseif wd == "金丝楠木门" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xD7492DA6
wds[13] = 0x29115EDF
wds[15] = "鼠标右键点击使用"
elseif wd == "山水盆景" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xB63474A0
wds[13] = 0x79C83349
wds[15] = "鼠标右键点击使用"
elseif wd == "四圣兽之白虎" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x6B08F32E
wds[13] = 0xD9D5BAB8
wds[15] = "鼠标右键点击使用"
elseif wd == "四圣兽之青龙" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xFEEF9473
wds[13] = 0xD2DF07DC
wds[15] = "鼠标右键点击使用"
elseif wd == "四圣兽之玄武" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x3E50047F
wds[13] = 0xD79EE5DF
wds[15] = "鼠标右键点击使用"
elseif wd == "四圣兽之朱雀" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x3CA923F0
wds[13] = 0x2A25E1F7
wds[15] = "鼠标右键点击使用"
elseif wd == "物品柜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0x135D021A
wds[13] = 0x44D8C646
wds[15] = "鼠标右键点击使用"
elseif wd == "西瓜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "木瓜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "苦瓜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "荔枝树" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "茄子" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "绿树" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "白菜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "萝卜" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "梨子树" then
wds[1] = ""
wds[2] = 202
wds[3] = 1
wds[4] = 1
wds[11] = "物品图标.wdf"
wds[12] = 567106113
wds[13] = 4251752243
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫藏书架" then
wds[1] = "叮当猫主题的书柜，让你殇徜徉于书香之中，感受阅读的美好与喜悦。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000001
wds[13] = 0x00000001
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫贵妃椅" then
wds[1] = "叮当猫主题的贵妃椅，慵懒的趴趴猫已经在等你了，快坐下来休息吧。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫梦幻屛" then
wds[1] = "叮当猫主题的屏风，似乎能看到可爱的尾巴在一摇一摆。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫木桌" then
wds[1] = "叮当猫主题的木桌,圆润的轮廓带来柔和的感觉。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫如意饰" then
wds[1] = "叮当猫抱着大鲤鱼笑咪了双眼,给房间带来一股活泼而喜悦的味道."
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫衣柜" then
wds[1] = "叮当猫主题的衣柜，木材特有的清香萦绕,柜门上的猫咪图案仿佛在夸奖你的穿着。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当猫迎客屏" then
wds[1] = "叮当猫主题的迎客屏风，清新优雅的图案让来客心情愉悦。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓编织毯" then
wds[1] = "可爱的叮当猫主题地毯，柔软中一点调皮的粗糙，就像生活的味道。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓靠背椅" then
wds[1] = "叮当貓主题的靠背椅，独特的设计让它坐起来舒适无比，猫咪团的靠背也令人心情愉悦。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓朦胧榻" then
wds[1] = "叮当猫主题的卧榻，舒适的布料、软和的床垫，每天伴你入眠。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓书桌" then
wds[1] = "叮当猫主题的书桌,简洁的线条勾勒出宽敞的桌面，不论美观性还是实用性都是一等一的好。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓温馨帘" then
wds[1] = "叮当貓主题窗帘,牛奶白和奶酪黄的撞色搭配给房间带来温馨的气息。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "叮当貓摇揺椅" then
wds[1] = "叮当猫主题的摇摇椅，别具匠心的设计让它仿佛一个温暖的拥抱。有什么烦恼，就让可爱的猫猫来安慰你吧。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "房屋图标.wdf"
wds[12] = 0xA2F9250A
wds[13] = 0x6E1F9949
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔藏经阁" then
wds[1] = "玲珑兔主题的书柜，颜色轻松明快，原来读书也可以如此轻松。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000041
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔粉缎帘" then
wds[1] = "玲珑主题窗帘，采用粉色绸缎与花边精心缝制而成。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000044
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔宫灯" then
wds[1] = "玲珑兔主题的小宫灯，造型精巧别致。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000047
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔贵妃卧" then
wds[1] = "玲珑兔主题的贵妃卧，精致的小兔雕花让人爱不释手。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000050
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔靠背椅" then
wds[1] = "玲珑兔主题的靠背椅，兼顾了舒适与实用，是人们的最爱。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000053
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔立柜" then
wds[1] = "玲珑兔主题的储物柜，采用松木制成，摸上去有柔和温馨的感觉。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000056
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔美梦屏风" then
wds[1] = "玲珑兔主题的隔断屏风，用它来创造一个甜蜜浪漫的私密空间吧。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000059
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔愜意桶" then
wds[1] = "玲珑兔主题的雕花玉桶，小兔子的图案一脸委屈。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000062
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔书桌" then
wds[1] = "玲珑兔主题的书桌，造型简单又时尚。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000065
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔甜梦榻" then
wds[1] = "玲珑兔主题的床榻，设计师在可爱的小兔与糖果间找到灵感让整个床榻显得甜蜜温馨。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000068
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔揺揺椅" then
wds[1] = "玲珑兔主题的摇摇椅，困暇时坐在摇摇椅上，让人感到浪漫又舒适。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000071
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔迎客屏" then
wds[1] = "玲珑兔主题的迎客屏风，可爱的小兔图案总是能让来客惊収和忍俊不禁。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000074
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔圆桌" then
wds[1] = "玲珑兔主题的木桌，采用松木制成，摸上去有柔和温馨的感觉。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000076
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔织毯" then
wds[1] = "玲珑兔主题的手织地毯，触感柔软，坐在上面，仿佛连心情也变得柔软起来了。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000078
wds[15] = "鼠标右键点击使用"
elseif wd == "玲珑兔珠帘" then
wds[1] = "玲珑兔主题珠帘，名匠将玉石明珠与绸缎精心搭配而成。"
wds[2] = 200
wds[3] = 3
wds[4] = 1
wds[11] = "xzjj.wdf"
wds[12] = 0x00000038
wds[13] = 0x00000081
wds[15] = "鼠标右键点击使用"




---------------九黎

elseif wd == "顽石双斧(乾)" then
wds[1] = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 0
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000392
wds[13] = 0x10000391
elseif wd == "顽石双斧(坤)" then
wds[1] = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 0
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000390
wds[13] = 0x10000389
elseif wd == "镔铁双斧(乾)" then
wds[1] = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 10
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000442
wds[13] = 0x10000441
elseif wd == "镔铁双斧(坤)" then
wds[1] = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 10
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000440
wds[13] = 0x10000439




---------------------------------------------------------

elseif wd == "黑曜双斧(乾)" then
wds[1] = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 20
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000446
wds[13] = 0x10000445
elseif wd == "黑曜双斧(坤)" then
wds[1] = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 20
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000444
wds[13] = 0x10000443
elseif wd == "枭首双斧(乾)" then
wds[1] = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 30
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000496
wds[13] = 0x10000495
elseif wd == "枭首双斧(坤)" then
wds[1] = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 30
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000494
wds[13] = 0x10000493
elseif wd == "破军双斧(乾)" then
wds[1] = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 40
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000500
wds[13] = 0x10000499
elseif wd == "破军双斧(坤)" then
wds[1] = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 40
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000498
wds[13] = 0x10000497
elseif wd == "隳城双戚(乾)" then
wds[1] = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 50
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000504
wds[13] = 0x10000503
elseif wd == "隳城双戚(坤)" then
wds[1] = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 50
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000502
wds[13] = 0x10000501
elseif wd == "飞头蛮(乾)" then
wds[1] = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 60
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000508
wds[13] = 0x10000507
elseif wd == "飞头蛮(坤)" then
wds[1] = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 60
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000506
wds[13] = 0x10000505
elseif wd == "竹叶青(乾)" then
wds[1] = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 70
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000584
wds[13] = 0x10000583
elseif wd == "竹叶青(坤)" then
wds[1] = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 70
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000582
wds[13] = 0x10000581
elseif wd == "鲛煞(乾)" then
wds[1] = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 80
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000588
wds[13] = 0x10000587
elseif wd == "鲛煞(坤)" then
wds[1] = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 80
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000586
wds[13] = 0x10000585
elseif wd == "啖月(乾)" then
wds[1] = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 90
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000618
wds[13] = 0x10000617
elseif wd == "啖月(坤)" then
wds[1] = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 90
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000616
wds[13] = 0x10000615
elseif wd == "义战(乾)" then
wds[1] = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 100
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000004
wds[13] = 0x10000003
elseif wd == "义战(坤)" then
wds[1] = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 100
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000002
wds[13] = 0x10000001
elseif wd == "恶来(乾)" then
wds[1] = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 110
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000008
wds[13] = 0x10000007
elseif wd == "恶来(坤)" then
wds[1] = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 110
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000006
wds[13] = 0x10000005
elseif wd == "烬世野火(乾)" then
wds[1] = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 120
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000058
wds[13] = 0x10000057
elseif wd == "烬世野火(坤)" then
wds[1] = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 120
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000056
wds[13] = 0x10000055
elseif wd == "九州海沸(乾)" then
wds[1] = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 130
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000108
wds[13] = 0x10000107
elseif wd == "九州海沸(坤)" then
wds[1] = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 130
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000106
wds[13] = 0x10000105
elseif wd == "八狱末劫(乾)" then
wds[1] = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 140
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000158
wds[13] = 0x10000157
elseif wd == "八狱末劫(坤)" then
wds[1] = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 140
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000156
wds[13] = 0x10000155
elseif wd == "罗喉计都(乾)" then
wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 150
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000208
wds[13] = 0x10000207
elseif wd == "罗喉计都(坤)" then
wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 150
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000206
wds[13] = 0x10000205
elseif wd == "非天(乾)" then
wds[1] = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
wds[2] = 2
wds[3] = 3
wds[4] = 26
wds[5] = 160
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000258
wds[13] = 0x10000257
elseif wd == "非天(坤)" then
wds[1] = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
wds[2] = 2
wds[3] = 4
wds[4] = 1
wds[5] = 160
wds[6] = "女"
wds[7] = {"影精灵"}
wds[11] = "yjlsc.wdf"
wds[12] = 0x10000256
wds[13] = 0x10000255








end
	-- 1为种类 2为分类 3为子类 制造
	return wds
end

function 复制物品(物品)
	local 道具数据 = 物品类()
	道具数据:置对象(物品.名称)
	道具数据.总类 = 物品.总类
	道具数据.分类 = 物品.分类
	道具数据.子类 = 物品.子类
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.气血 ~= nil then
		道具数据.气血 = 物品.气血
	end
	if 物品.魔法 ~= nil then
		道具数据.魔法 = 物品.魔法
	end
	if 物品.愤怒 ~= nil then
		道具数据.愤怒 = 物品.愤怒
	end
	if 物品.体力 ~= nil then
		道具数据.体力 = 物品.体力
	end
	if 物品.活力 ~= nil then
		道具数据.活力 = 物品.活力
	end
	if 物品.命中 ~= nil then
		道具数据.命中 = 物品.命中
	end
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.防御 ~= nil then
		道具数据.防御 = 物品.防御
	end
	if 物品.速度 ~= nil then
		道具数据.速度 = 物品.速度
	end
	if 物品.躲避 ~= nil then
		道具数据.躲避 = 物品.躲避
	end
	if 物品.灵力 ~= nil then
		道具数据.灵力 = 物品.灵力
	end
	if 物品.体质 ~= nil then
		道具数据.体质 = 物品.体质
	end
	if 物品.魔力 ~= nil then
		道具数据.魔力 = 物品.魔力
	end
	if 物品.力量 ~= nil then
		道具数据.力量 = 物品.力量
	end
	if 物品.耐力 ~= nil then
		道具数据.耐力 = 物品.耐力
	end
	if 物品.敏捷 ~= nil then
		道具数据.敏捷 = 物品.敏捷
	end
	if 物品.品质 ~= nil then
		道具数据.品质 = 物品.品质
	end
	if 物品.附带技能 ~= nil then
		道具数据.附带技能 = 物品.附带技能
	end
	if 物品.镶嵌四相 ~= nil then
		道具数据.镶嵌四相 = 物品.镶嵌四相
	end
	if 物品.锻炼等级 ~= nil then
		道具数据.锻炼等级 = 物品.锻炼等级
	end
	if 物品.镶嵌宝石 ~= nil then
		道具数据.镶嵌宝石 = 物品.镶嵌宝石
	end
	if 物品.级别限制 ~= nil then
		道具数据.级别限制 = 物品.级别限制
	end

	if 物品.特效 ~= nil then
		道具数据.特效 = 物品.特效
	end
	if 物品.特技 ~= nil then
		道具数据.特技 = 物品.特技
	end
	if 物品.价格 ~= nil then
		道具数据.价格 = 物品.价格
	end
	if 物品.五行 ~= nil then
		道具数据.五行 = 物品.五行
	end
  if 物品.耐久 ~= nil then
    道具数据.耐久 = 物品.耐久
  end
	if 物品.数量 ~= nil and 物品.可叠加 then
		道具数据.数量 = 物品.数量
	end
	if 物品.制造者 ~= nil then
		道具数据.制造者 = 物品.制造者
	end
	return 道具数据---2025613
end

